{
  "filename": "BINDU_KAPUREA_VS._SUBHASISH_PANDA.pdf",
  "page_count": 48,
  "content": "2025 INSC 784\nPage 1 of 48  REPORTABLE  IN THE SUPREME COURT OF INDIA CIVIL ORIGINAL / INHERENT / CRIMINAL JURISDICTION   Contempt Petition (Civil) No. _______ / 2025 (Diary No. 21171/2024) IN Writ Petition (Civil) No. 4677 / 1985   Bindu Kapurea                         ….Petitioner(s) versus  Subhashish Panda and others              ….Respondent(s)  WITH SMC (Crl.) No. 2/2024   WITH  I.A. No. 98622 / 2024 in Writ Petition (Civil) No. 202 / 1995   JUDGEMENT  SURYA KANT, J. 1. The instant petition has been filed invoking Article 129 of the Constitution of India, Section 12 of the Contempt of Courts Act, 1971, and Rule 3(c) of the Rules to Regulate Proceedings for Page 2 of 48  Contempt of the Supreme Court, 1975. It prays for the initiation of contempt proceedings against the Respondents for wilful disobedience of this Court’s order dated 09.05.1996 passed in W.P. (C) No. 4677/1985, titled MC Mehta v. Union of India & Others. 2. These proceedings arise from a decades-long saga that is associated with a series of writ petitions, wherein this Court has consistently endeavoured to mitigate further environmental degradation in the National Capital Territory of Delhi and across the country. A. FACTS 3. At this juncture, it becomes imperative to set out the sequence of events from the outset, in order to provide a comprehensive understanding of the developments that have culminated into the present proceedings. A.1 Brief background of the cases giving rise to the present controversy  3.1. MC Mehta (supra) is an ongoing matter comprising petitions through which this Court has pronounced several landmark judgments giving new dimensions to environmental jurisprudence, with the specific objective of regulating land use and shutting down of hazardous industries to protect the environment. The said Writ Petition was initially instituted on 16.04.1985 in public interest, to bring to light the grave and escalating pollution of the river Ganga, Page 3 of 48  caused by the indiscriminate discharge of vast quantities of sewage from the city of Kanpur, Uttar Pradesh. It thereafter metamorphosed into a case through which this Court routinely addressed various threats posed to the environment and ecological biodiversity.   3.2. The Delhi Development Authority (DDA) notified the Master Plan for Delhi Perspective 2001 on 05.08.1990 (Delhi Master Plan), wherein it was expressly provided that no further encroachment or infringement upon the Delhi Ridge would be permitted, and that the Ridge would be preserved and maintained in its pristine condition. To explicate, the Delhi Ridge constitutes a natural rock formation, forming a part of the ancient Aravalli hill range. It encompasses approximately 7,777 hectares of forest land and extends over a stretch of nearly 35 kilometres—commencing from the Bhatti Mines area in the southeast, traversing through Tughlaqabad, and tapering towards the northern periphery of the city at Wazirabad. Commonly referred to as the ‘Lungs of Delhi’, the Ridge plays a vital ecological role and forms part of one of the oldest geological formations on the planet, with its origins dating back to the Proterozoic era.   3.3. The Delhi Master Plan accordingly recognised that, in light of the pressures exerted by rapid urbanisation over the years, the Delhi Page 4 of 48  Ridge Area had been subjected to significant threats and adverse environmental impacts. In response, the Master Plan mandated that the Ridge Area be clearly identified and conserved with the utmost care, taking into consideration its critical role as a natural buffer against escalating pollution levels in the National Capital Territory. It further stipulated that afforestation efforts within the Delhi Ridge must prioritise the use of indigenous species, with minimal reliance on artificial landscaping, in order to preserve the ecological integrity and natural character of the forest. 3.4. Commensurately, in M.C. Mehta (supra), this Court issued a series of directions for the conservation and protection of the Delhi Ridge. Pursuant thereto, the then Lieutenant Governor of Delhi issued an order dated 06.10.1995, constituting a dedicated body, known as the Ridge Management Board (RMB), which was entrusted with the responsibility of protecting and restoring the Delhi Ridge Forest. The RMB was established under the Chairmanship of the Chief Secretary of Delhi and was assigned various functions, including the implementation of the management scheme for the Ridge forests, protection and demarcation of its boundaries, and the preparation and execution of detailed plans for the ecological upgradation and long-term preservation of the Ridge area. Page 5 of 48  3.5. In furtherance of the aforementioned directions, this Court, vide orders dated 25.01.1996 and 13.03.1996, directed that regardless of the mandate contained in Section 154 (vii) of the Delhi Land Reforms Act, 1954, the uncultivated surplus land of the Gaon Sabha falling within the Delhi Ridge shall not vest in the Gaon Sabha, and shall instead be used for the creation of a Reserved Forest. In compliance with the said directions, the Government of the National Capital Territory of Delhi (GNCTD) issued a notification dated 02.04.1996, declaring 10,517 acres of uncultivated Gaon Sabha land, as surplus and placed it at the disposal of the Forest Department. This area now forms a part of the aforementioned 7,777 hectares of the Notified Ridge Area.  3.6. To this end, this Court also passed the order dated 09.05.1996, which the Petitioner herein alleges has been violated by the Respondents. The order reads as follows:  “The provisions of the Master Plan makes it mandatory that the Ridge is to be kept free from encroachers and its pristine glory must be maintained for all times. It is a pity that neither the Central Government nor the N.C.T., Delhi Administration has ever applied its mind towards maintaining the Ridge and River Yamuna, which is necessary to maintain the ecological balance of the city. We are of the view that no cut off date can come in the way of relocating the J.J. dwellers which are encroaching on the Ridge. The directions given by this Court in the order dated April 9, 1996 shall have to be complied with. We have already directed in the said order that all encroachers must be shifted from the Ridge before October 31, 1996. Mr. Khanduri, present in Court, has very fairly stated that the work of relocation of J.J. dwellers from Ridge has already Page 6 of 48  been undertaken on war footing. We have no doubt that the Union of India shall render all assistance to the N.C.T., Delhi Administration in clearing the Ridge area. The next progress report be filed in July, 1996.”  3.7. It may be seen from the contents of the aforesaid order that this Court reiterated the exigency of protecting the Delhi Ridge and ensuring that it remains free from encroachment, so as to preserve its pristine condition. In doing so, the Court referred to the statutory Delhi Master Plan, which unequivocally proscribed any infringement upon the Ridge and mandated its continuous protection and maintenance. The Court further observed that neither the Central Government nor the GNCTD had, until then, adequately addressed the imperative of maintaining the Delhi Ridge and the River Yamuna—both of which were essential to preserving the ecological balance of the city. Accordingly, the Court issued stringent directions to the concerned authorities to ensure the removal of all encroachments from the Ridge area on or before 31.10.1996. 3.8. Parallelly, a public interest litigation, being W.P. (C) No. 202/1995, titled T.N. Godavarman Thirumulpad v. Union of India, had been instituted before this Court on 18.02.1995. The proceedings had initially arisen out of concerns regarding large-scale deforestation, illegal logging, and unsustainable practices affecting forest lands in the Nilgiris region. Over time, this case also came to Page 7 of 48  be regarded as one of the most significant judicial interventions in the realm of forest preservation, environmental governance and conservation of natural resources in India through the innovative interpretation and application of the Forest Conservation Act, 1980 (FCA 1980). We find it necessary to highlight this matter, as the directions issued therein in relation to the Delhi Ridge subsequently intersect with the issues raised in the instant Contempt Petition. 3.9. Thereafter, in congruence with the directions put forth in M.C. Mehta (supra), this Court in the T.N. Godavarman (supra) constituted the Central Empowered Committee (CEC) on 09.05.2002, tasked with monitoring the implementation of its orders in respect of removal of encroachments in ecologically sensitive areas, implementation of working plans, compensatory afforestation, plantations and other conservation issues. This Court, in both of these cases, thus sought to continuously monitor initiatives geared towards the protection and conservation of the environment in the country, and also, specifically, the Delhi Ridge. 3.10. Thus, to recapitulate, the forested expanse known as the Delhi Ridge continues to enjoy the protection of this Court, as reaffirmed in MC Mehta (supra) by the order dated 09.05.1996. In tandem with the establishment of the CEC in T.N. Godavarman (supra), it Page 8 of 48  stands settled that any construction or developmental activity within the Delhi Ridge must receive prior approval from the RMB and thereafter from this Court, for which a proposal is to be mooted through the CEC. A.2   Events leading to the filing of the Contempt Petition 3.11.  In this backdrop, the Principal Chief Conservator of Forests, Delhi, cum Member Secretary of the RMB vide letter dated 21.09.2023, forwarded the Board’s recommendation to the CEC. This communication pertained to an application submitted by the DDA seeking approval for the construction of approach roads connecting the main Chattarpur Road to SAARC University, the Central Armed Police Forces Institute of Medical Sciences (CAPFIMS), and other establishments located in Maidangarhi, including the areas of Sayurpur and Satbari—all of which fall within the ecologically sensitive Southern Ridge region.  3.12. According to the DDA, the area in question had witnessed the emergence of several large-scale residential and institutional developments, including the SAARC University; housing for officials of the Central Bureau of Investigation (CBI), Delhi Police, and the National Investigation Agency (NIA); as well as CAPFIMS. Despite the scale and significance of these developments, the region was reportedly beset with inadequate access infrastructure. The Page 9 of 48  DDA accordingly proposed specific alignments and upgradations traversing notified forest land within the Delhi Ridge, with the stated objective of facilitating seamless access to the residential and institutional establishments referred to above.   3.13. Given the impending interventions into ecologically sensitive areas, the DDA, through the aforementioned application, sought permission to construct two approach roads—namely, the ‘Gaushala Road’ connecting Chattarpur Road to SAARC University and the ‘SAARC University–CAPFIMS Road’. The DDA proposed to utilise 3.60 hectares of the ecologically sensitive Southern Ridge and an additional 0.968 hectares of Morphological Ridge land for the alignment, construction, and widening of these roads, spanning a total length of 2.72 kilometres, which entailed the felling of approximately 1,051 trees. To clarify, Morphological Ridge land refers to areas that, while lying outside the officially notified boundaries of the Delhi Ridge, exhibit geological and ecological features characteristic of the Ridge itself. Owing to their environmental significance, such lands are accorded the same level of protection as the notified Ridge areas, and any activity thereon is subject to the same regulatory safeguards and judicial supervision. Page 10 of 48  3.14. Thereupon, the CEC, after due consideration of the DDA’s application, approved such proposal and submitted Report No. 36/2023 dated 06.12.2023, containing its detailed observations and recommendations. In arriving at its conclusions, the CEC took into account, inter alia, the following considerations: i. That the proposed project is in public interest, and the extent of forest land sought to be utilised for the road development represents the bare minimum required; ii. That the existing seven-metre-wide road is already in use and necessitates upgradation to a four-lane divided configuration with footpaths on either side to facilitate access to institutions of national significance being developed in the vicinity; iii. That a portion of the forest land proposed for the project is already in use by commuters; iv. That all requisite statutory clearances are to be obtained by the user agency/DDA under the FCA 1980 for the diversion of 3.60 hectares of forest land for non-forest purposes, along with necessary approvals from the Standing Committee of the National Board for Wild Life (SCNBWL) under the Wildlife (Protection) Act, 1972 for areas falling within the eco-sensitive zone; Page 11 of 48  v. That the user agency/DDA shall bear the cost of planting and maintaining 2,960 saplings—ten times the number of trees (296) proposed to be cut or transplanted from non-forest land; vi. That the DDA has expressed its willingness to make available suitable land for undertaking such compensatory plantation; and vii. That the DDA has already earmarked 3.68 hectares of non-forest land at Sector 29, Dwarka, Delhi, to be transferred to the Forest Department in lieu of the 3.60 hectares of forest land proposed to be diverted.  3.15. The CEC finally concluded as follows: “It is recommended that this Hon’ble Court may consider granting approval to the Applicant, Delhi Development Authority for construction of the approach road from Chattarpur Main Road to SAARC University (1.070 kms) and SAARC University to CAPFIMS (1.650 kms) subject to the following conditions:  i. the user-agency shall deposit 5% of the project cost, proportionate to the area falling within the ridge area, with the Ridge Management Board Fund and which fund under the close supervision of the Ridge Management Board shall be used for protection of the Delhi Ridge by the Forest Department of Delhi Government; ii. the user-agency shall obtain prior clearance under Forest (Conservation) Act 1980 in respect of the forest land being diverted for construction of the road and abide by all the conditions of forest clearance including payment of NPV and cost of compensatory afforestation; iii. the user-agency shall obtain necessary approval from the Standing Committee of the National Board for Wildlife in Page 12 of 48  respect of the project land falling within the eco-sensitive zone of Asola Bhati Wildlife Sanctuary; iv. the user-agency before felling/removal of 296 trees shall obtain necessary permission under the provisions of Delhi Preservation of Tree Act, 1994; v. the user-agency shall deposit the cost of planting and maintenance of 2960 indigenous plants with the Forest Department, Government of Delhi and make available suitable land for compensatory planting before the permission for felling is granted under the provisions of Delhi Preservation of Tree Act 1994; vi. the Forest Department, Government of NCT Delhi will undertake the planting of 2960 saplings of the indigenous species at the site to be made available by DDA for the purpose; and vii. Forest Department will raise compensatory planting over 3.68 ha. of non forest land at Sector-29, Dwarka, Delhi in lieu of the 3.60 ha. of forest land proposed to be diverted for non forest use.” 3.16. As matters stood thus, a Gazette Notification dated 14.02.2024 was issued, wherein the Lieutenant Governor of Delhi (LG), exercising powers conferred under Section 29 of the Delhi Preservation of Trees Act, 1994 (1994 Act), granted an exemption in terms of Section 9(3) of the said Act—in public interest—for an area measuring 4.9955 hectares to facilitate the construction of approach roads from Chattarpur to SAARC University, CAPFIMS, and other adjoining establishments. The notification stipulated an advance deposit of ₹2,40,54,000/- by the DDA towards a security amount earmarked for the creation and maintenance of compensatory plantation. Furthermore, it laid down a series of Page 13 of 48  binding conditions upon the DDA to be fulfilled: prior to undertaking the felling or transplantation of trees, during the execution of such activities, and thereafter for the purpose of assessing the success of the plantation efforts. The release of the aforementioned security deposit by the Tree Officer/Deputy Conservator of Forests was made contingent upon the satisfactory fulfilment of these stipulated conditions. 3.17. On 15.02.2024, the DDA moved I.A. No. 40494/2024 in MC Mehta (supra), seeking this Court’s permission for the felling and translocation of 1,051 trees in connection with the construction of the proposed approach roads. In the interim, the Petitioner came to learn of tree-felling activities underway in the Satbari area of South Delhi on 23.02.2024. They visited the site on 24.02.2024 and allegedly observed that a substantial portion of the Ridge Forest had been decimated, with heavy machinery actively engaged in levelling the land. Disturbed by the scale and apparent brazenness of the activity, the Petitioner then contacted the Green Helpline of the Department of Forests and Wildlife, GNCTD, to register a complaint. They however, received a telephonic response on 25.02.2024 from a Forest Guard, who informed them that the ongoing tree cutting was being carried out pursuant to due Page 14 of 48  authorisation, having been permitted by the LG vide the Gazette Notification dated 14.02.2024.  3.18. It is pertinent to highlight that the aforesaid IAs preferred by the DDA were dismissed by this Court on the grounds of vagueness vide its order dated 04.03.2024. The Court underscored that the DDA, being an instrumentality of the State, bore a heightened responsibility to prioritise environmental protection and was expected to explore all viable alternatives before resorting to the felling of trees, limiting such action strictly to those instances where it was absolutely unavoidable. The Court further noted that no prior permission had been sought under the FCA 1980. Consequently, the DDA was directed to revisit its proposal by engaging the services of qualified experts and ensuring that the revised exercise would be conducted in a manner that minimised tree felling to the greatest extent possible. Only upon undertaking these corrective steps was the DDA permitted to file a fresh application seeking the same relief. 3.19. The Petitioner has alleged that the DDA failed to disclose to this Court, during the hearing on 04.03.2024, that the area for which it had sought permission to fell trees had, in fact, already been cleared. It is the Petitioner’s case that the DDA, without awaiting the Court’s adjudication on its applications and in the absence of Page 15 of 48  any express permission, proceeded with the clearing of the Ridge reserved forest as well as the felling of trees on non-forest land to facilitate construction of the approach roads. In view of the above, the Petitioner has preferred the instant Contempt Petition, asserting that such actions on the part of the First Respondent constitute a wilful and deliberate violation of this Court’s binding order dated 09.05.1996 passed in MC Mehta (supra). The Petitioner has accordingly prayed for the initiation of contempt proceedings against the Vice Chairman of DDA/First Respondent.  A.3 Events subsequent to initiation of Contempt Proceedings 3.20. In addition to the events averred in the Contempt Petition, it will be appropriate to bring the subsequent developments of material significance that merit due consideration. The instant Contempt Petition came up for hearing on 09.05.2024, when notice was issued, the First Respondent was directed to maintain status quo and refrain from carrying out any further felling of trees. 3.21. On the following date of hearing, i.e., 16.05.2024, this Court took cognisance of the averments made in the affidavit filed by the First Respondent and deemed it appropriate to issue suo motu notice of criminal contempt, registered as SMC (Crl.) No. 2/2024. That affidavit revealed that a substantial number of trees had been felled without obtaining the requisite permissions from the prescribed Page 16 of 48  authorities, besides the blatant contravention of this Court’s binding orders. This Court, therefore, expressed grave concern, observing that the DDA’s actions of unauthorised felling of more than 1100 trees constituted a shocking disregard for the Rule of Law and amounted to interference with the administration of justice.  3.22. This Court thereafter proceeded to pass a series of consequential orders, namely: (i) the First Respondent was directed to produce the document evidencing the approval of the LG and to furnish the names of all officers responsible for the breach of this Court’s orders; (ii) the First Respondent was mandated to personally address a letter to the LG disclosing that, while the proposal for approval was forwarded to him, the material fact that the trees had already been felled was wilfully suppressed; (iii) ordered an inquiry into the conduct of the officers who had entrusted the tree felling to the contractor; (iv) directed the DDA to immediately halt all further activities pertaining to the two approach roads and to deploy appropriate officers to ensure strict compliance; (v) appointed an Independent Agency comprising of three eminent environmentalists (Committee) who were to be duly assisted by officers from the Forest Survey of India (FSI) to assess the number of trees felled, the extent of environmental degradation caused, and Page 17 of 48  to propose suitable species for replantation along with other ecological restoration measures; and (vi) directed the DDA to conduct an internal inquiry into the lapse committed by its Legal Department in failing to brief its counsel correctly on 04.03.2024 regarding the ongoing tree felling. Further, this Court also restrained the RMB from clearing project proposals for the diversion of the Ridge forests without seeking permission from this Court.  3.23. In the meantime, the Committee constituted by this Court submitted its preliminary report detailing the number of trees felled and the extent of environmental degradation caused. The report observed that the DDA had failed to offer a satisfactory explanation for the urgency with which the tree felling was undertaken. It cautioned that the absence of tree cover along the road could result in the creation of a heat island and lead to intensified urbanisation of the adjoining areas. The Committee further noted that no transplantation had taken place at the designated site and that, of the 145 trees transplanted at alternate, non-designated locations, nearly half comprised the invasive Subabool species, which ought to be removed. In light of these findings, the Committee recommended both possible outcomes—either the removal of the Page 18 of 48  road to facilitate restorative measures or its completion, should this Court so deem fit.  3.24. Pursuant to the aforesaid directions, the First Respondent also filed an affidavit dated 19.06.2024, tendering an unconditional apology and detailing steps undertaken in compliance. It was submitted that: (i) corrective measures were underway, including disciplinary action against the errant DDA officials and the formulation of Standard Operating Procedures (SOPs) to prevent recurrences; (ii) the First Respondent was on sanctioned medical leave from 16.02.2024 to 02.03.2024, and worked from home until 12.03.2024, during which period he remained unaware of the tree felling and therefore failed to apprise this Court; (iii) an internal Inquiry Committee found the following officials responsible: Executive Engineer Manoj Kumar Yadav (who instructed the contractor to fell the trees), Engineering Division officials Pawan Kumar and Ayush Saraswat (who permitted the felling), and Superintendent Engineer Pankaj Verma (who, along with Yadav, was found to have suppressed material facts from this Court on 04.03.2024); (iv) all four officers had been suspended and disciplinary proceedings initiated; (v) while prior contractor agreements did not include clauses mandating Court permission for tree felling, all future tenders would expressly incorporate such Page 19 of 48  terms; (vi) work at the site had been fully halted, and approximately 174 trees in non-forest areas and 468 in forest areas were confirmed to have been felled; (vii) the DDA would cooperate fully with the Committee constituted by this Court in implementing all remedial measures; (viii) the Chief Legal Advisor of the DDA had been misinformed by Manoj Kumar Yadav, leading to incorrect submissions before this Court; and (ix) the DDA had identified 185 acres of land for afforestation and committed to planting 100 trees for every tree felled, in addition to 500 trees along the widened sections of the site to aid ecological restoration.  3.25. This Court, on 24.06.2024, while considering the affidavit of the First Respondent, also examined the Inquiry Committee Report annexed thereto. Particular attention was drawn to three emails allegedly sent by the Executive Engineer instructing the contractor to commence tree felling. These emails purportedly referenced a visit by the LG, in his capacity as Chairperson of the DDA, to the site on 03.02.2024, during which he allegedly directed the clearing of trees. However, upon further questioning, it emerged that there was ambiguity as to whether the Learned LG had actually visited the tree-felling site or only the CAPFIMS campus. In view of this uncertainty, and considering the Executive Engineer’s subsequent claim before the Inquiry Committee that the emails were Page 20 of 48  manipulated, the Court directed the First Respondent to submit a clear and unequivocal statement clarifying whether any such direction had, in fact, been issued by the LG.  3.26. In this backdrop, this Court deemed it appropriate to show cause to the following officers of the DDA: (i) Manoj Kumar Yadav, Executive Engineer, SMD 5, DDA; (ii) Pawan Kumar, Assistant Engineer-I, SMD 5, South Zone, Engineering Division, DDA; (iii) Ayush Saraswat, Assistant Engineer-II, SMD 5, South Zone, Engineering Division, DDA; and (iv) Pankaj Verma, Superintending Engineer, SE/SCC-2, South Zone, DDA. Additionally, while perusing the affidavit filed by the First Respondent, the Court underscored that the appointment of serving judicial officers from the Delhi Higher Judicial Services as legal advisors to the DDA constituted a clear violation of the principle of judicial independence and the doctrine of separation of powers. Accordingly, it directed the Delhi High Court to take appropriate action concerning such appointments. 3.27.  On 26.06.2024, this Court directed several individuals and institutional authorities to file affidavits to shed further light on the incident. First, Ashok Kumar Gupta, Member (Engineering), DDA, was directed to file a detailed affidavit clarifying the events during the visit of the Learned LG, since he had been present at the time. Page 21 of 48  Second, the discrepancies in the Gazette Notification dated 14.02.2024 were noted, observing that no permission had been granted by the designated Tree Officer, nor had any valid exemption been extended to the DDA for the felling of trees. When asked about the whereabouts of the timber from the felled trees, the First Respondent failed to provide any response. Consequently, notice was issued to the GNCTD through the Principal Secretary, Department of Environment and Forests. In this regard, notice was also issued to the Tree Authority constituted under Section 3 of the 1994 Act, directing it to file an affidavit explaining its inaction in the face of the DDA’s violations. Third, the DDA was instructed to begin implementing certain recommendations from the Committee’s preliminary report, specifically those listed under paragraph 1 of the section titled ‘Suggestions and Recommendations’, including the removal of the tarmac and sub-base materials of the road to expose bare soil and initiate appropriate afforestation and ecological restoration measures. 3.28. Pursuant to this Court’s directions in its orders dated 24.06.2024 and 26.06.2024, multiple affidavits were filed by concerned individuals and institutions, which are briefly summarised herein. The First Respondent, in his affidavit dated 02.07.2024, explained that he had informed the office of the Engineer Member, DDA, on Page 22 of 48  02.02.2024 regarding the LG’s proposed visit to CAPFIMS on 03.02.2024. However, he also acknowledged that no formal minutes of the LG’s site visit were recorded, though the names of the officers present during the visit were provided in an annexure. Further, with regard to the implementation of the Committee’s recommendations, the DDA has sought guidance from that Committee to ensure compliance with the directions of this Court.  3.29. Similarly, Ashok Kumar Gupta, Member (Engineering) DDA, gave details of the senior officers who were present at the time of the LG’s visit on 03.02.2024 and that the said visit was only to inspect the CAPFIMS Hospital and assess the Central Public Works Department’s (CPWD) preparedness for its timely completion. The affidavit further highlighted that the LG directed CPWD officials to expedite the completion of the project. With respect to the CAPFIMS approach road, the LG was informed that requisite permissions for tree felling were still awaited from the competent authorities. Upon hearing this, the LG allegedly emphasised the need to expedite the process.  3.30. The Principal Secretary, Environment and Forest Department of GNCTD also filed a detailed affidavit, which outlined the following: (i) several initiatives had been undertaken to expand forest and tree cover in Delhi, including efforts to convert 1,700 acres of the Page 23 of 48  Yamuna Flood Plains into forest land and the development of City Forests; (ii) the project in question aimed to construct roads connecting institutions of national importance, including CAPFIMS; (iii) the DDA had submitted three applications: one to the RMB on 18.08.2023 seeking this Court’s approval for the construction of approach roads, another on 09.12.2023 for diversion of 3.6 hectares of Ridge forest land and felling of 629 trees, and a third on 29.12.2023 seeking permission to fell 422 trees in non-forest areas; (iv) the Gazette Notification dated 14.02.2024 merely exempted the applicability of Section 9(3) of the 1994 Act and did not amount to permission for felling trees; (v) while the DDA had initiated approval processes under the RMB and the FCA 1980, these had not been completed; (vi) action was being taken against the DDA for violations under both the 1994 Act and the FCA 1980—this included issuance of show cause notices, an interim order by the Tree Officer directing the plantation of at least 100 native trees, and initiation of a criminal case under relevant provisions of the Bharatiya Nagarik Suraksha Sanhita, 2023 and the 1994 Act; and (vii) adequate infrastructure had been provided to the Forest Department to enhance monitoring and vigilance over forest areas. The Tree Officer, in his affidavit, echoed similar submissions and further clarified that, as a quasi-judicial Page 24 of 48  authority, proceedings under the 1994 Act had been initiated before him since 05.03.2024. 3.31. The matter was heard again on 12.07.2024, when this Court deemed it necessary to ensure complete clarity regarding the visit of the LG. Accordingly, it directed all officials present during the site visit, along with the First Respondent and any other officer possessing relevant information, to file affidavits. In addition, since the contractor M/s. Satya Prakash and Brothers Private Limited was responsible for the felling of trees, notice was issued directing the contractor to disclose the location of the felled timber and the transplanted trees. Lastly, the GNCTD was directed to file a supplementary affidavit clarifying whether any officer of the Forest Department or the Tree Authority was present during the felling of trees.   3.32. In compliance with this Court’s directions, the relevant stakeholders once again filed their respective affidavits. The Additional Principal Chief Conservator of Forests, GNCTD; Ashok Kumar Gupta, Member (Engineering) DDA; the Principal Secretary, Environment and Forest Department, GNCTD; and the Chief Secretary, GNCTD all reiterated a consistent position—that during the LG’s visit on 03.02.2024, he was informed that the requisite permissions under the 1994 Act and the FCA 1980 were still Page 25 of 48  awaited. Ashok Kumar Gupta further stated that the felling of trees, which began on 16.02.2024, was carried out under the bona fide belief that the recommendations of the CEC dated 06.12.2023 and the subsequent Gazette Notification exempted the need for further permissions. Meanwhile, the Principal Secretary clarified, in response to the Court’s queries, that no officer from the Forest Department or the Tree Authority was present during the felling and also submitted that steps had been initiated to withdraw the Gazette Notification dated 14.02.2024. Lastly, the contractor, in his affidavit, stated that he acted on the instructions of Executive Engineer Manoj Kumar Yadav, who had emailed him on 07.02.2024 regarding the removal of bushes, shrubs, and dry trees, and followed up further emails on 14.02.2024 reiterating the same while referring to the LG’s visit on 03.02.2024. 3.33. This Court on 16.10.2024, further observed that the material on record required further elaboration, particularly from the LG. The Court specifically sought clarity on the role played by the LG, the point at which he became aware of the tree felling activity, the steps taken thus far to remediate the ecological damage, and the identification of officers responsible for the suppression of facts surrounding the incident.  Page 26 of 48  3.34. In response, the LG filed an affidavit stating that the actual number of trees felled was approximately 642, as opposed to the alleged figure of 1,100. He further submitted that, during his visit on 03.02.2024, he had not been informed of the requirement to obtain prior permission from this Court. He first became aware of such a requirement upon reviewing the DDA’s proposal dated 21.03.2024 and was subsequently informed by the First Respondent through his letter dated 10.06.2024 that the tree felling had commenced on 16.02.2024. The affidavit also noted that ecological restoration efforts were underway through tree plantations, and that the Inquiry Committee constituted by the DDA had already taken action against the officials found responsible. 3.35. Upon perusing the LG’s affidavit on 24.10.2024, this Court noted that further clarity was required regarding the precise date on which the LG became aware that tree felling had commenced on 16.02.2024. Accordingly, the Court directed both the First Respondent and the LG to file supplementary affidavits. In response, the LG reiterated the submissions made in his earlier affidavit and clarified that he became aware of the tree felling only on 12.04.2024 during a meeting. The First Respondent, in his affidavit, corroborated this timeline in part and submitted that he first learnt of the felling on 18.03.2024 upon the issuance of a show Page 27 of 48  cause notice by the Delhi High Court to the Department of Forest and Wildlife. He was thereafter informed by the Member Engineer on 21.03.2024 that the felling had, in fact, commenced on 16.02.2024. With this, all affidavits and relevant material filed by the concerned stakeholders appear to have been placed on record. 3.36. After this saga of affidavits was completed, we may notice that the FSI, pursuant to this Court’s order dated 16.05.2024, submitted its final report containing key findings that are critical to the adjudication of the present controversy. Based on extensive fieldwork and surveys, the FSI reported that approximately 1,670 trees were felled, both within the reserved forest area and beyond, resulting in substantial carbon stock loss. The report also uncovered alarming discrepancies in the data provided by the Delhi Forest Department and concluded with observations pointing to systemic deficiencies in the Department’s operational practices. 3.37. Having undertaken the arduous task of tracing the root cause of this issue over the course of nearly a year, this Court ultimately afforded all parties an opportunity to tender their submissions and, on 21.01.2025, reserved judgment in the matter.   B. CONTENTIONS ON BEHALF OF THE PARTIES 4. Although the parties’ respective positions are discernible from the multitude of affidavits examined above, it remains essential to Page 28 of 48  canvass the contentions advanced by them in support of their claims.  5. Mr. Gopal Sankaranarayanan, learned Senior Advocate appearing on behalf of the Petitioner, laid a strong challenge to the actions of the First Respondent and DDA officials, emphasising the irreversible nature of the ecological damage caused. Seeking strict action against the errant officials in view of the grave nature of contempt committed, learned Senior Counsel adduced the following contentions:  (a) There was a deliberate and coordinated attempt to conceal material facts from this Court, during the hearing dated 04.03.2024. The felling of trees had not only commenced on 16.02.2024 but had also been wilfully carried out and completed over a span of ten days, without obtaining permission from either this Court or the relevant statutory authorities. Notably, during the same period, in some related proceedings pending before the Delhi High Court, the DDA suppressed this critical information and got the matter adjourned.  (b) Even the CEC and the Amicus Curiae appointed by this Court were not informed of the tree felling exercise. However, rather than accepting responsibility, the First Respondent has sought Page 29 of 48  to deflect blame onto the officials and engineers, attempting to make them scapegoats for this unfortunate breach.  (c) The material on record, along with depositions by subordinate engineers and officials, indicates that the tree felling and road construction were expedited following the LG’s visit. This is corroborated by internal emails and correspondence, which suggest that the DDA, acting upon the LG’s express directions, proceeded in haste and undertook the tree felling exercise despite lacking requisite permissions. (d) The road was sought to be widened despite the presence of an already functional roadway, with the underlying intent of facilitating access to private residences and farmhouses of affluent individuals in the vicinity of CAPFIMS. The justification of serving the Central Armed Police Forces has been conveniently used as a pretext. This is further corroborated by the First Respondent’s own affidavit dated 15.05.2024, wherein it is admitted that the infrastructure project was envisaged not solely for the benefit of CAPFIMS and other public institutions but also for adjoining areas such as the Chattarpur Residential area and other large-scale residential developments. It thus appears that the exercise was Page 30 of 48  an orchestrated effort to advance private interests, with environmental degradation reduced to mere collateral damage. 6. Au contraire, Mr. Maninder Singh, Mr. Vikas Singh, Mr. Aditya Sondhi, Mr. Anupam Lal Das, and Mr. Sanjay Jain, Learned Senior Counsels, along with Ms. Aishwarya Bhati, Learned Additional Solicitor General of India, appeared on behalf of the DDA and the GNCTD. Mr. Mahesh Jethmalani, Learned Senior Counsel, appeared on behalf of the LG. In the course of their oral arguments, Mr. Singh sought to candidly acknowledge that the DDA officials had defied the orders of this Court and that contempt had been committed. Having regard to the same, the learned counsels collectively advanced the following submissions: (a) In light of the construction of CAPFIMS and other institutions of national importance, there was an urgent requirement to develop a broader approach road to facilitate improved access. To achieve this objective, it became necessary to undertake tree felling on both forest and non-forest land.  (b) The DDA accordingly initiated the statutory process by submitting the requisite applications to the competent authorities. However, the present controversy appears to have stemmed from a misunderstanding among DDA officials, who, upon receiving certain in-principle approvals from the Page 31 of 48  Government, erroneously presumed that all necessary clearances—including from this Court—had been obtained. Acting under this misconception, the DDA proceeded to carry out the tree-felling operations on both categories of land.  (c) Significant steps have been initiated to scale up afforestation efforts, including a commitment to plant 100 trees for every tree felled, in line with the recommendations of the Committee constituted by this Court as well as that of the FSI. To this end, an area of approximately 185 acres has been identified for carrying out the afforestation programme. Furthermore, departmental proceedings have already been initiated against the DDA officials responsible for the lapses, and appropriate action will be taken in accordance with law. C. ISSUES 7. In light of the extensive material placed on record and the detailed submissions advanced by the parties, coupled with the acknowledgement proffered by the Respondents that the orders of this Court have been disobeyed, we find that the following question falls for our consideration:  i. Whether the breach of the orders of this Court dated 09.05.1996 and 04.03.2024 by the Respondents was wilful and deliberate, and if so, what are the remedial and corrective Page 32 of 48  measures that must be undertaken by them to purge the contempt? D. ANALYSIS 8. Based on the factual matrix and unique circumstances of this case, we are of the view that our analysis and consequent directions must remain focused and purpose-driven. Such a calibrated approach is essential to ensure that the course adopted balances not only the interests of the parties before us but also safeguards the concerns of those who stand to be impacted by the outcome of these proceedings for years to come. 9. There is no gainsaid that this Court enjoys wide and sweeping powers to punish individuals found guilty of interfering with or obstructing the administration of justice—an act that squarely falls within the definition of contempt not only under the Contempt of Courts Act, 1971 but most importantly, under Article 129 of the Constitution of India. This Court, being a court of record, is thus vested with inherent powers to punish contempt. These broad-ranging powers are not merely procedural but are central to preserving the dignity, authority, and effective functioning of the judiciary. In fact, it has been quoted in a catena of decisions that the contempt powers afforded to this Court are integral to maintaining the sanctity of judicial proceedings. Page 33 of 48  10. The majesty of law is supreme and is unequivocally recognised by the Constitution through the conferment of plenary powers of contempt upon this Court. Unlike jurisdictions where contempt is solely governed by statutory law, India, by virtue of its constitutional framework, accords this power a higher pedestal. The constitutional provision for contempt is not subordinate to Parliamentary Legislation; rather, it represents an intrinsic aspect of the judiciary’s autonomy. As a nation rooted in the Rule of Law and constitutionalism, there is immense faith placed in its judiciary, so much so that orders of this Court carry a binding force equivalent to that of Legislative enactments. 11. In this light, we proceed to assess the nature and gravity of contempt attributed to the First Respondent and other officials of the DDA. It must be noted at the outset that there appears to be, across a range of affidavits, an implicit if not express admission that: (i) no permission had been granted by this Court for the felling of trees in the Delhi Ridge area, thereby amounting to a non-compliance of this Court’s order dated 09.05.1996; and (ii) the omission to disclose, during the hearing on 04.03.2024, that tree felling had already commenced on 16.02.2024—while the relevant application remained pending—constitutes wilful disobedience that palpably obstructed the administration of justice.  Page 34 of 48  12. Needless to say, these very findings and observations have consistently been recorded by this Court in its various orders passed during the pendency of this petition over the past year. Without delving into excessive detail, it is an admitted position that the First Respondent and officials of the DDA acted in an errant manner, which not only amounted to a concealment of this Court’s directions but also led to an unfortunate and avoidable misconstruction of communications attributed to the LG, thereby placing him in an embarrassing position. There can thus be no second opinion but to answer the issue in the affirmative and hold that there was indeed wilful disobedience on the part of the Respondents, resulting in contempt of this Court’s orders.  13. As already recapitulated, this Court possesses wide discretion in matters pertaining to contempt. Given that the First Respondent, through his affidavits, has conceded that there was a violation of this Court’s orders tantamount to contempt and has consequently expressed his willingness to purge it, the question that then arises is the approach which ought to be adopted by this Court in these circumstances—whether it should be liberal, magnanimous, or retributive? In answering this, this Court must be guided not by vengeance or punitive action but rather by the overarching objective of upholding the Rule of Law and restoring public Page 35 of 48  confidence in the judicial process. The power to punish for contempt, though wide and constitutionally entrenched, is to be exercised with circumspection in a manner that serves the ends of justice rather than merely penalising the individual. 14. Public authorities and public servants are duty-bound to act in the furtherance of public interest, with every action aligned to subserve the common good. In adjudicating contempt, the Court must necessarily consider the nature and degree of contempt. To instantiate, while public officials may be engaged in the performance of their duties, if there is even an attempt to exhibit wilful and deliberate disregard for the orders of this Court, such conduct would not merely amount to contempt in the narrow sense defined under Statute. Rather, it has a cascading effect—it fosters a perception that judicial directives can be defied with impunity. This cannot be viewed as routine disobedience but must be recognised as a serious affront to the Rule of Law itself. Such acts are generally classified as grave and offensive instances of contempt, warranting appropriate punishment without any misplaced sympathy or unwarranted magnanimity from the Court. 15. On the contrary, where the Court finds that a breach of its order amounts to technical contempt, absent any intent to wilfully defy or disobey its authority, this Court has evolved the practice of Page 36 of 48  affording an opportunity to purge such contempt. For example, where the breach of the Court’s order stems from an act genuinely intended to serve the larger public interest and undertaken in good faith, the Court may lean towards magnanimity and provide the contemnor(s) with an opportunity to purge the contempt.  16. In this backdrop, we deem it appropriate to divide the contemptuous conduct attributed to the Respondents into two distinct parts: first, the simpliciter non-compliance of this Court’s order dated 09.05.1996, which mandated obtaining prior permission for the felling of trees; and second, the deliberate concealment from this Court of the fact that tree felling had already commenced. The gravity and degree of contempt must, therefore, be assessed on a composite evaluation of both these aspects. 17. Even if the first limb of the contempt is assumed to have arisen from a bona fide misapprehension of the permissions granted, the second limb is entirely indefensible. The conscious non-disclosure of material facts before this Court during the course of proceedings strikes at the very heart of the justice delivery system. It contaminates the sanctity of judicial proceedings, may cause irreversible prejudice to the opposite parties, and carries the potential to result in erroneous precedents being laid down. Page 37 of 48  18. We are thus left with no hesitation in holding that the Respondents’ conduct has been gravely contumacious, and when viewed cumulatively, their actions amount to a blatant obstruction of the administration of justice. These acts, in our considered view, fall squarely within the ambit of ‘criminal contempt’ as defined under Section 2(c) of the Contempt of Courts Act, 1971. 19. Having said that, it must be emphasised that while the misadventure undertaken by the errant officials of the DDA was in clear and flagrant contravention of this Court’s orders, the underlying objective—namely, to facilitate improved access through broader approach roads for CAPFIMS and other public institutions—appears, does not seem to be in bad faith and certainly not to defy the authority of this Court. The Court is conscious of the distinction between mala fide abuse of power and genuine administrative misjudgement, and we are inclined to deem that the present instance falls within the latter category.  20. We say so because, as a Constitutional Court, it often becomes our solemn duty to incline towards decisions that, in the long run, subserve the larger public interest. In a scenario such as the present, where competing claims of public interest are at play—some capable of being fulfilled and others falling short of expectations—this Court is guided in its adjudication by the Page 38 of 48  principles of constitutional morality. Our decision in such circumstances ought to be grounded in the constitutional values of equality, social justice, and economic justice, which lie at the very nucleus of our Constitution.  21. To provide extrapolation, we have duly considered the relevance of CAPFIMS as an institution, which was established primarily as a tertiary care hospital to cater to the medical needs of personnel serving in paramilitary forces (such as the Border Security Force, Central Reserve Police Force, Central Industrial Security Force, Indo-Tibetan Border Police, and others), who, in the discharge of their duties to the nation, are frequently exposed to grave risks and injuries. CAPFIMS seeks to address these exigencies by offering world-class medical facilities not only to such personnel but also to their families, pensioners, beneficiaries under the Central Government Health Scheme, and the general public at large.  22. Such institutions become particularly very pertinent when personnel are stationed in remote areas, often with no access to basic communication such as phone connectivity, and their families—including women, elderly parents, and young children—reside far away, frequently in circumstances of vulnerability. In such a context, ensuring access to quality medical care is not a privilege but an imperative necessity, one that is both essential and Page 39 of 48  urgent. The provision of such infrastructure is not merely an administrative act—it reflects the moral compass of a welfare state and echoes the principle of parens patriae, whereby the State bears responsibility for the well-being of those who may not be in a position to secure it for themselves. This duty extends equally to the elders, homemakers, and children of the force personnel who dedicate their lives to serving the nation. 23. Given these noble objectives, it is imperative to recognise the significance of an institution like CAPFIMS, particularly in the lives of families of personnel belonging to the lower ranks of the paramilitary forces. These are the kith and kin of individuals who routinely place themselves at risk to protect the nation and defend its borders under extremely harsh conditions. We are of the considered view that such individuals, who remain largely voiceless and without representation in proceedings such as the present one, stand to benefit directly from the construction of an improved approach road to CAPFIMS. Better road access would enable emergency vehicles, including ambulances, to reach the facility swiftly, thereby potentially saving the lives of those who routinely safeguard ours. In the discharge of our judicial function, this overarching public interest weighs heavily upon the conscience of this Court.    Page 40 of 48  24. We are compelled to, however, add that any incidental benefit or ancillary use of such infrastructure by other institutions or adjoining residential localities does not, in any manner, dilute or detract from the primacy of its intended purpose. We must further clarify that in the event it is found that the development of such a facility has been undertaken under the ostensible guise of serving the needs of paramilitary forces, but in actuality is intended to confer undue benefit upon affluent individuals or private interests, such actions will be viewed by this Court through an entirely different lens and with the seriousness they warrant. 25. In spite of that, this Court remains equally cognizant of the clamant ecological concerns arising from the refractory conduct of the Respondents. Undeniably, the reckless decimation of a substantial portion of the Delhi Ridge, carried out without any discernible effort to mitigate environmental harm, has resulted in an alarming loss of biodiversity. It must be recognised that a forested area is not solely a collection of trees—it is a delicate and intricate ecosystem comprising of mammals, migratory birds, amphibians, critters and countless other life forms that together inexplicably contribute to the region’s ecological balance. As has already been reiterated, the Delhi Ridge functions as the lungs of the city. In light of this, there is no gainsaying that urgent and sustained measures must be Page 41 of 48  taken not only to preserve it but also to restore and enhance its ecological vitality.  26. That being so, having holistically considered the matter from multiple dimensions, this Court finds itself confronted with a difficult juxtaposition—between the imperative of much-needed development and improved access to medical facilities on the one hand and the undeniable and pervasive harm caused to the environment on the other. In this vein, we must remain mindful that the establishment of CAPFIMS, the felling of trees, and the construction of approach roads are now fait accompli. While it may be theoretically possible to contemplate a reversal of these actions, such a course is practically untenable. In our view, the die is cast, and what is done cannot now be undone—any refusal to put institutions like CAPFIMS to optimal use or to undo road construction at this stage risks not only undermining public interest but also squandering significant public resources.   27. However, that by no means can connote that this Court has its hands tied and is entirely powerless when affronted with such issues. We have taken the liberty of meticulously scrutinising the reports submitted by the Committee and the FSI, which set out in detail the extent of environmental degradation and the corresponding remedial measures recommended. In this respect, Page 42 of 48  we are sanguine that the long arms of justice can be equipped towards issuing directions aimed at not only purging the contempt but also advancing the broader objective of strengthening environmental safeguards and restorative efforts.   E. CONCLUSION AND DIRECTIONS 28. In light of the aforesaid analysis, we dispose of these Contempt Petitions, discharge the rule nisi and issue the following directions:  i. In light of the extensive ecological damage caused, urgent and time-bound remedial measures must be undertaken by the DDA in coordination with the GNCTD. These efforts shall be guided and overseen by the Committee constituted by this Court and comprising of Shri Ishwar Singh, Shri Sunil Limaye and Shri Pradip Krishen. The following directions are issued to be complied with strictly within a period of three (3) months: a. The DDA is directed to arrange the visit of the Committee to see the suitability of the 185 acres of land identified and proposed to be used towards compensatory afforestation; b. If the Committee opines that such land can be utilised for the purposes of afforestation, it may then, with the assistance of other domain experts, initiate the process of selection or shortlisting of appropriate native species, the Page 43 of 48  methodology of plantation, survival rate monitoring, and post-plantation maintenance and care; c. The Committee may commence the afforestation exercise by formulating a plan that ensures the plantation of trees is undertaken in a manner that optimally maximises the ecological advantage of the impending monsoon season. ii. In order to ensure strict and effective enforcement of (i) above, the Forest Department shall work under the supervision of the Committee, for which, the entire expenditure is to be borne by the DDA and disbursed to the Forest Department. The Forest Department is directed to strictly abide by the directions issued by the Committee and will be responsible for maintaining detailed records of the health, survival, and mortality rates of the saplings planted.  iii. In furtherance thereof, the DDA and the Forest Department shall submit a jointly signed bi-annual compliance report before this Court, duly supported by photographic and video documentation, clearly evidencing the status and upkeep of the afforested areas. The veracity of such report shall be cross-checked by this Committee. The directions enumerated in (i) to (iii) are also applicable to the afforestation efforts already claimed to have been undertaken by the DDA;  Page 44 of 48  iv. The DDA, in conjunction with the GNCTD and the Forest Department, are further directed to implement in full earnest the comprehensive measures recommended by the Court-appointed Committee in its final report, aimed at enhancing and restoring the green cover within the National Capital Territory of Delhi. These measures shall be treated as binding and implemented under the supervision of the Committee, with periodic progress reports filed before this Court; v. The directions contained in (i) to (iii) shall equally apply to I.A. No. 98622/2024 in W.P. (C) No. 202/1995, which involves the diversion of 6,200 square metres of Morphological Ridge land located at Plot No. 11B Vasant Kunj, New Delhi. Accordingly, the DDA, in conjunction with the Forest Department, is directed to identify an appropriate parcel of land and report the same to the Committee to ensure effective compliance and implementation of these directions; vi. The DDA is further directed to ensure the expeditious completion of the approach roads as envisaged, keeping in mind that the construction was at varying stages of progress prior to the cessation of work. The Committee, in this context, may also explore the possibility of implementing a thick Page 45 of 48  coverage of healthy trees on both sides, in congruence with such road construction; vii. In view of the concerns raised regarding the potential undue benefit accruing to certain affluent residential owners from the construction of the approach roads, the GNCTD, in consultation with DDA, is directed to undertake a due identification exercise of such beneficiaries. Upon such identification, the GNCTD, along with DDA, shall be at liberty to impose a one-time levy, commensurate with the proportionate cost of construction, on such affluent individuals who may be the direct beneficiaries of the newly constructed road. Such a fee shall, however, be levied in accordance with principles of natural justice; viii. Since the First Respondent was not an officer in the DDA cadre and is no longer holding any position in that organisation, we deem it appropriate to close the proceedings qua him. However, all other Respondents and officials of DDA found responsible by the internal inquiry for the acts leading to the present contempt are directed to deposit a sum of Rs. 25000 each as an environmental fee with the Forest Department, in addition to and without any prejudice to the departmental action that may be taken against them. This sum can be utilised towards Page 46 of 48  the remedial measures sought to be undertaken, as the Committee deems fit. Additionally, we direct that a formal penalty of censure be imposed upon all such officials. Accordingly, the contempt proceedings against the Respondents are closed; ix. The departmental proceedings initiated against the erring DDA officials, if pending, shall be concluded expeditiously and in any event no later than six months; and  x. Similar contempt petitions or proceedings pending before the Delhi High Court in relation to the same cause of action also stand disposed of. 29. Accordingly, I.A. No. 98622/2024 in W.P. (C) No. 202/1995 stands disposed of in the above terms. All other pending IAs also stand disposed of. 30. In conclusion, we place on record our sincere appreciation for the invaluable assistance rendered by the Committee. The diligence, expertise, and constructive suggestions tendered in their reports have been instrumental in guiding the Court towards a balanced resolution of the complex issues arising in the instant matter.  31. We also deem it appropriate to appreciate the valuable assistance rendered by the Learned Amicus Curiae appointed by this Court—Page 47 of 48  Mr. Guru Krishna Kumar, Ms. Anitha Shenoy, and Mr. A.D.N. Rao, Learned Senior Counsels.  32. As an epilogue to this chronicle, we must state that the instant matter is yet another classic case of institutional missteps and administrative overreach. The facts before us reveal a troubling pattern: permissions not obtained, court orders ignored, and environmental degradation inflicted with impunity. Such actions certainly raise fundamental concerns about governance and accountability. We truly hope that these proceedings have been conducive to incorporating necessary course corrections by the DDA and other bodies so as to avoid any such lapses in the future. 33. Insofar as this Court has taken a view in the present instance, it must be unequivocally stated that any recurrence of such conduct will not be met with similar indulgence. It is only the overwhelming public interest served by the establishment of CAPFIMS that has, in effect, overshadowed the sheer administrative incompetence and blatant disregard for both established procedures and the orders of this Court. It is the good fortune of the concerned DDA officials that this larger objective has weighed in their favour, without which this Court may have been compelled to adopt a far more stringent approach and deal with an iron fist. Accordingly, we deem it appropriate to also direct the DDA that henceforth, every Page 48 of 48  notification or order relating to afforestation, road construction, tree felling, or any activity with potential ecological impact must explicitly mention the pendency of relevant proceedings before this Court. This direction is being issued to ensure that, in future, the plea of ignorance is not taken as a defence.  34. Be that as it may, the DDA is directed to file a status report upon completion of the directions put forth in (i).  35. Post the matter after the first compliance reports are filed. 36. Ordered accordingly.                                          .........................J.                                                                            (SURYA KANT)                                                         ............................................…….........J.                                 (NONGMEIKAPAM KOTISWAR SINGH)  NEW DELHI; DATE: 28.05.2025"
}