{
  "filename": "CENTRAL_BUREAU_OF_INVESTIGATION_VS._SEKH_JAMIR_HOSSAIN.pdf",
  "page_count": 14,
  "content": "2025 INSC 788\nREPORTABLE\nIN THE SUPREME COURT OF INDIA\nCRIMINAL APPELLATE JURISDICTION\nCRIMINAL APPEAL NO(S). 2880 OF 2025 \n(Arising out of SLP (Crl.) No (s). 10538 of 2023)\nCENTRAL BUREAU OF \nINVESTIGATION               .….APPELLANT(S)\nVERSUS\nSEKH JAMIR HOSSAIN \nAND ORS.    ....RESPONDENT(S)\nWITH\nCRIMINAL APPEAL NO(S). 2881 OF 2025 \n(Arising out of SLP (Crl.) No (s).15160 OF 2023)\nJ U D G M E N T\nMehta, J.\n1.Heard.\n2.Leave granted.\n1\nCrl. Appeal @ SLP (Crl.) No (s). 10538/2023 with connected matter3.These two appeals take exception to the orders\ndated  24th January,  2023  and  13th April,  2023\npassed by the learned Division Bench of High Court\nat Calcutta1 whereby the respondents in both the\nappeals were granted bail in connection with FIR\nbearing No. RC0562021S0051 dated 16th December,\n2021 registered at CBI/SCB/Kolkata Police Station\nfor  the  offences  punishable  under  Sections  143,\n144, 147, 148, 149, 427, 326, 376 read with 511\nand 34 of Indian Penal Code, 18602.\n4.Succinctly stated, the facts as narrated in the\nFIR are that the incident in question took place on\n2nd May,  2021  just  after  the  announcement  of\nresults of  the  Assembly elections  in the  State  of\nWest  Bengal.  The  complainant  claims  to  be  a\nfollower  of  Hindu  religion.  It  is  alleged  that  the\nmajority of the villagers residing in the village of the\ncomplainant, namely, Gumsima, PO Jatra belong to\nthe other community and are the supporters and\nworkers of the ruling dispensation. The complainant\nalleged that  being in minority,  he was  unable to\ncarry on his religious pursuits in the village. The\n1 Hereinafter, referred to as “High Court”.\n2 Hereinafter, referred to as “IPC”.\n2\nCrl. Appeal @ SLP (Crl.) No (s). 10538/2023 with connected mattercomplainant  and  few  more  villagers  gathered\ncourage and started campaigning for the Bharatiya\nJanta Party prior to the Assembly elections in the\nState of West Bengal, thereby drawing the wrath of\nthe  supporters  of  the  ruling  dispensation  who\nthreatened that he and his family members would\nbe harmed. Before the elections, a bomb was thrown\nat his tea stall. On the evening of 2nd May, 2021 i.e.,\nthe date on which election results were announced,\na gang of miscreants led by Sekh Mahim s/o Sekh\nJalil, a leader belonging to the ruling dispensation\nfrom village Gumsima, PO Jatra gathered together\nand started throwing bombs towards the house of\nthe complainant. It is alleged that around 40 to 50\nmiscreants, who were heavily armed, launched an\noffensive on his house. The assailants were carrying\nweapons like sticks, knives, iron rods, revolvers, etc.\nand  started  assaulting  the  complainant  and  his\nfamily  members.  The  complainant’s  house  was\ntotally  vandalized  and  looted  by  the  accused\npersons. The wife of the complainant was grabbed\nby hair, her clothes were snatched away, and she\nwas forcibly undressed. The assailants indulged in\n3\nCrl. Appeal @ SLP (Crl.) No (s). 10538/2023 with connected mattermolesting the complainant’s wife by inappropriately\ntouching her private parts. In order to save herself,\nthe complainant’s wife poured kerosene oil on her\nperson and threatened that she would set fire to\nherself on which the miscreants left the spot. The\ncomplainant,  his  wife  and  their  two  children\nsomehow escaped from the village to save their lives\nand approached the Sadaipur Police Station on the\nnext  day,  to  lodge  a  complaint  in  respect  of  the\nincident dated 2nd May, 2021. The officer-in-charge\nof the police station did not accept the complaint\nand advised the complainant to leave the village to\nsave his and his family’s life.  \n5.This Court has been apprised that numerous\nincidents  with  like  allegations  took  place  in  the\naftermath of the election results in the State of West\nBengal.  It is a common grievance that the local\npolice refused to lodge the FIRs on which a number\nof writ petitions3 came to be filed in the High Court\nat  Calcutta.  The  High  Court  by  order  dated  19th\nAugust,  2021  directed  the  Central  Bureau  of\nInvestigation4 to investigate all the cases where the\n3 WPA(P) Nos. 142, 143, 144, 145, 146, 147, 148, 149, and 167 of 2021.\n4 Hereinafter, referred to as “CBI”.\n4\nCrl. Appeal @ SLP (Crl.) No (s). 10538/2023 with connected matterallegations  involved  murder  and/or  crime  against\nwomen  regarding rape/attempt  to  rape.  Acting  in\nfurtherance of the above direction, FIR bearing No.\nRC0562021S0051 dated 16th December, 2021 came\nto be registered at CBI/SCB/Kolkata Police Station\nfor  the  offences  punishable  under  Sections  143,\n144, 147, 148, 149, 427, 326, 376 read with 511\nand 34 of IPC in connection with the incident which\ntook place at the house of the complainant.\n6.The accused respondents in both the appeals\ncame to be arrested on 3rd November, 2022 and were\nremanded to judicial custody. After investigation, a\ncharge-sheet has been filed by the CBI against a\nnumber  of  assailants  including  the  respondents\nherein for the offences punishable under Sections\n34, 148, 149, 326, 354, 511 read with 376D and\n450 of IPC. \n7.The respondents applied for bail5 in the High\nCourt which accepted their applications vide orders\ndated 24th January, 2023 and 13th April, 2023 which\nare subject matter of challenge in these appeals by\nspecial leave.  \n5 CRM(DB) No. 56 of 2023 and CRM (DB) No. 1249 of 2023.\n5\nCrl. Appeal @ SLP (Crl.) No (s). 10538/2023 with connected matter8.We  have  heard  and  considered  the\nsubmissions advanced by Mr. Vikramjeet Banerjee,\nlearned  Additional  Solicitor  General  representing\nthe  appellant-CBI  and  Mr.  S.  Hariharan,  learned\ncounsel representing the accused respondents.\n9.Mr.  Vikramjeet  Banerjee,  learned  Additional\nSolicitor  General  representing  the  appellant-CBI\nsubmitted that the High Court granted bail to the\nrespondents  on  totally  extraneous  considerations.\nThe fact remains that there is no possibility of a fair\ntrial being conducted because the respondents are\npolitically  influential  and  they  even  managed  to\nprevent the registration of the FIR in respect of such\nghastly crimes. The FIR in the present case could be\nregistered that too by the CBI only after the High\nCourt  intervened  in  the  matter  and  passed\ndirections to register the FIRs vide judgment dated\n19th August,  2021 . The  CBI  was  directed  to\ninvestigate  all  the  cases  where  the  allegations\ninvolved the crime of murder and/or crime against\nwomen  regarding  rape/attempt  to  rape.  I n\nfurtherance  of  the  directions  given  by  the  High\nCourt, the CBI registered the instant FIR and with\n6\nCrl. Appeal @ SLP (Crl.) No (s). 10538/2023 with connected mattergreat degree of difficulty, the accused persons were\narrested  and  charge-sheet  could  be  filed  in  the\nmatter.\n10.He urged that the respondents are influencing\nthe trial and are not letting the proceedings to be\ncontinued.  On  numerous  dates  of  hearing,  the\naccused respondents have failed to  appear before\nthe trial Court, which is struggling to even frame\nthe  charges against the accused respondents. He\nfurther  submitted  that  the  accused  respondents\nwere  specifically  named  in  the  statement  of  the\ncomplainant  and  the  victim  lady,  and  as  such,\nlooking to the nature and gravity of the allegations\nand the propensity of the accused respondents to\nabscond and/or adversely affect the proceedings of\nthe  trial  and  the  imminent  probability  of  the\nwitnesses being threatened and tampered, the High\nCourt should have refrained from granting bail to\nthe accused respondents.\n11.Per  contra,  learned  counsel  representing  the\nrespondents, being the accused persons, opposed\nthe  submissions  advanced  by  Mr.  Banerjee.  He\n7\nCrl. Appeal @ SLP (Crl.) No (s). 10538/2023 with connected mattercontended that  the High Court has analysed the\nfactual  matrix  in  an  apropos manner  while\ndistinguishing  the  case  of  the  respondents  and\nenlarging  them  on  bail.  The  fact  remains  that\nneither  in  the  highly  belated  FIR  nor  in  the\nstatement  of  the  witnesses  recorded  by  the\nInvestigating  Officer,  any  specific  role  has  been\nassigned to the respondents herein and thus, there\nis no justification for entertaining these appeals and\ninterfering with the well-reasoned order passed by\nthe High Court granting bail to the respondents. He\nthus, implored the Court to dismiss the appeals.\n12.We have given our thoughtful consideration to\nthe submissions advanced at the bar and have gone\nthrough the material placed on record.\n13.Law is well-settled by a catena of decisions of\nthis Court that the considerations for grant of bail\nand cancellation thereof are entirely different. Bail\nonce granted to the accused should normally not be\ninterfered  with/cancelled  unless  there  exist\ncircumstances giving rise to an inference that the\nbail has been procured by practicing fraud or mis-\n8\nCrl. Appeal @ SLP (Crl.) No (s). 10538/2023 with connected matterrepresentation;  that  the  allegations  against  the\naccused are so grave that the same have an adverse\nimpact  on  the  society  at  large  and  shake  the\nconscience of the Court; that releasing the accused\nrespondents on bail is likely to create a sense of fear\nand terror amongst the society or that the accused\nwhile  on  bail  may  abscond  or  tamper  with  the\nprosecution evidence.\n14.Having regard to the facts enumerated above,\nwe feel that the present one is a case wherein the\nallegations against the accused respondents are so\ngrave that the same shake the conscience of the\nCourt.   Furthermore,  there  is  an  imminent\npropensity  of  the  accused  persons  adversely\naffecting  the  proceedings  of  the  trial.  It  is\nundisputed  that  the  complainant  approached  the\nSadaipur  Police  Station  on  3rd May,  2021  for\nregistering a complaint in respect of incident dated\n2nd May, 2021, but the officer-in-charge refused to\nregister the FIR conveying that he and his family\nmembers should go away from the village for their\nown safety. Apparently, this approach of the local\npolice  lends credence to  the apprehension  of the\n9\nCrl. Appeal @ SLP (Crl.) No (s). 10538/2023 with connected mattercomplainant about the clout and influence which\nthe accused respondents bear over the locality and\neven the police.\n15.The  FIR  in  the  present  case  came  to  be\nregistered only upon intervention by the High Court\nvide judgment dated 19th August, 2021 in a batch of\nwrit petitions, directing the CBI to investigate all the\ncases where the allegations involve crime of murder\nand/or  crime  against  women  regarding\nrape/attempt to rape. \n16.Mr.  Banerjee  had  submitted  that  even  the\nofficers of the CBI were not receiving the required\ncooperation  from  the  local  police  and  thus,\nculmination of the investigation took almost one and\na half years. \n17.Having gone through the contents of the FIR,\nwe  find  that  there  is  hardly  any  scope  for\ndistinguishing the case of the respondents and that\nof the accused to whom the specific allegation of\ndisrobing the complainant’s wife is attributed. The\nconcerted attack on the complainant’s house was\nlaunched on the day of election results with the sole\n10\nCrl. Appeal @ SLP (Crl.) No (s). 10538/2023 with connected matterobjective  of  wreaking  vengeance  because  he  had\nsupported  the  saffron  party.  This  is  a  grave\ncircumstance which convinces us that the accused\npersons  including  the  respondents  herein  were\ntrying  to  terrorize  the  members  of  the  opposite\npolitical party whom the accused respondents were\nsupporting. The reprehensible manner in which the\nincident  was  perpetrated  shows  the  vengeful\nattitude of the accused persons and their avowed\nobjective to subdue the supporters of the opposite\nparty  into  submission  by hook  or  by  crook.  The\ndastardly  offence  was  nothing  short  of  a  grave\nattack on the roots of democracy. \n18.There is prima facie material to establish that\nthe accused persons formed an unlawful assembly\nand launched a concerted attack on the house of\nthe complainant vandalising the same and looting\naway the household articles. The complainant’s wife\nwas viciously pulled by the hair and was disrobed.\nThe  accused  persons  were  about  to  assault  her\nsexually when the lady gathered courage to pour\nkerosene  on  her  body  and  gave  a  threat  of  self-\nimmolation on which the accused persons including\n11\nCrl. Appeal @ SLP (Crl.) No (s). 10538/2023 with connected matterthe  respondents  herein  fled  away  from  the\ncomplainant’s house. \n19.The charge-sheet has been filed way back in\nthe year 2022 and till date, the trial has not budged\nan inch. The prosecution has alleged that this delay\nis  mostly  attributable  to  non-cooperation  by  the\naccused persons including the respondents herein\nwhich fact is palpably established from record.\n20.In this background, we feel that there is no\npossibility  of  a  fair  and  impartial  trial  being\nconducted, if the accused respondents are allowed\nto remain on bail. Thus, on both counts, i.e., (i) the\nnature and gravity of the offence which is nothing\nshort of an attack on the roots of democracy and (ii)\nthe  imminent  likelihood  of  the  accused  adversely\naffecting a fair trial, the bail granted to the accused\nrespondents has to be cancelled.\n21.Consequently, the impugned orders dated 24th\nJanuary, 2023 and 13th April, 2023  deserve to be\nand are hereby reversed. The bail granted to the\naccused  respondents  by  the  High  Court  is\naccordingly  cancelled.  The  accused  respondents\n12\nCrl. Appeal @ SLP (Crl.) No (s). 10538/2023 with connected mattershall surrender before the trial Court within two\nweeks from today, failing which, the trial Court shall\nadopt coercive measures to secure their presence.\nUpon  surrendering/being  arrested,  the  accused\nrespondents shall be remanded to custody. \n22.The trial Court shall expedite the proceedings\nand will try to conclude the trial within a period of\nsix months from the date of receipt of a copy of this\norder. In case, any stay orders have been passed on\nthe proceedings before the trial Court by any higher\nforum including the High Court, the same shall be\ndeemed to have been vacated. The Home Secretary,\nState of West Bengal and the Director General of\nPolice, State of West Bengal shall ensure that proper\nprotection is provided to the complainant and all\nother  material  witnesses  so  that  they  can  freely\nappear and depose at the trial without any fear or\napprehension. Any violation of the above direction\nmay be reported to this Court by the appellant-CBI\nor the complainant for suitable action. \n13\nCrl. Appeal @ SLP (Crl.) No (s). 10538/2023 with connected matter23.Additionally,  the  observations  made  in  this\njudgment and in the orders of the High Court shall\nnot prejudice the trial in any manner.\n24.The appeals are allowed in these terms.\n25.Pending  application(s),  if  any,  shall  stand\ndisposed of.\n….……………………J.\n                            (VIKRAM NATH)\n...…………………….J.\n                               (SANDEEP MEHTA)\nNEW DELHI;\nMay 29, 2025.\n14\nCrl. Appeal @ SLP (Crl.) No (s). 10538/2023 with connected matter"
}