{
  "filename": "GREATER_MOHALI_AREA_DEVELOPMENT_AUTHORITY_(GMADA)_VS._ANUPAM_GARG_ETC.pdf",
  "page_count": 15,
  "content": "2025 INSC 808\nCA@ SLP © Nos. 27847 -48 of 2019   Page 1 of 15 \n REPORTABLE  \n \nIN THE SUPREME COURT OF INDIA  \nCIVIL APPELLATE JURISDICTION  \n \nCIVIL APPEAL NO S.                             OF 202 5 \n(Arising out of SLP(C) Nos.27847 -27848 of 2019)  \n \n \nGREATER MOHALI AREA  \nDEVELOPMENT AUTHORITY  \n(GMADA) THR OUGH ITS ESTATE  \nOFFICER (H)         … A PPELLANT (S)  \n      \nVERSUS  \n \n \nANUPAM GARG   ETC.         … RESPONDENT (S)  \n  \nJ U D G M E N T  \n \nSANJAY KAROL J.  \nLeave Granted.  \n2.   Under challenge in these appeals is a judgment  and \nfinal order dated 1st April , 2019 passed in First Appeal Nos. \n1852 of 2018 and 1853 of 2018 by the National Consumer \nDispute s Redressal Commission, New Delhi1, at the instance \n \n1 NCDRC  CA@ SLP © Nos. 27847 -48 of 2019   Page 2 of 15 \n of Greater Mohali Area Development Authority2, who is \naggrieved by the order  dated 1st March, 2018  of the State \nConsumer Dispute s Redressal Commission, Punjab, \nChandigarh3, whereby the State Commission partly allowed \nthe respondents’ complaints (being CC No.438 of 2017 filed \nby respondent Anupam Garg ; and CC No. 439 of 2017 filed \nby respondent Rajiv Kumar) against GMADA directing the \nlatter to refund the entire amount deposited by both parties in \nrespect of securing fl ats in the residential scheme launched \nby it along with 8% interest  thereon as also paying additional \ncosts for mental harassment, litigation and the interest paid \nby the respondents to the State Bank of India , for the loans \nthat they had secured to arrange for the funds required to be \ninvested in the project.  \n3.  For the sake of convenience we only illustrate the facts \nof CC No.438 of 2017 filed by Anupam Garg, which are \nsimilar to the facts being in CC No.439 of 2017 filed by Rajiv \nKumar.  The sequence of events and background (as per CC \n438 of 2017) , as have been culled out by the Commission s, \nleading up to these appeals are:  \n3.1  GMADA launched a scheme of residential flats \ntermed ‘Pu rab Premium Apartments’ to be constructed \nin the Sector 88 locality, at Mohali in the year 2011. \n \n2 GMADA  \n3 State Commission  CA@ SLP © Nos. 27847 -48 of 2019   Page 3 of 15 \n Anupam Garg secured an application for m for  a 2-BHK \n+ Servant Room Residential Apartment -Type II upon \npayment of 10% of the total consideration of ₹ 55 lakhs, \ni.e., ₹ 5 ,50,000 /- as earnest money.  \n3.2  The allotment of the fl ats took place through a \n‘draw of lots’ on  19th March , 2012.  He was successful \nand a Letter of Intent4 was issued in his favour on 21st \nMay, 2012.   It provided details regarding price, payment \nschedule, possible plans of payment, locations where \npayment can be deposited, particulars of ownership, \npossession, management and maintenance and other \ngeneral terms and conditions. The relevant extracts of \nthe LOI are as follows:  \n \n“PAYMENT SCHEDULE  \n 2.1 For Initial 30%  \n  (i) Payment of Rs.1100000 (Eleven \nLakhs Only) being 20 % price of the apartment is to be \nmade by 22.6.2012 to complete 30% of the apartment.  \n (ii) In case of failure to make the payment within \nstipulated period, the amount paid shall be refunded with \n10% deduction and allotment cancelled. However, this \nperiod can be further extended up to 30 days with 2% \nPenalty, up to 60 days with 3 % penalty and u p to 90 days \nwith 5 % penalty on prior written request.  \n 2.2 For Balance Payment of 65%  \n   Plan-A \n  A sum of Rs.33,96,250/ - (Thirty three lakhs \nninety six thousand two hundred fifty only) being \n \n4 LOI CA@ SLP © Nos. 27847 -48 of 2019   Page 4 of 15 \n balance 65% of tentative price of apartment within 60 \ndays of the issue of LOI with a rebate of 5% on the \nbalance amount payable.  \n   Plan-B \n A sum of Rs. 35,75,000 (Thirty five lakhs seventy \nfive thousand only) being balance 65% of the tentative \nprice can be paid with 12% interest in 6 half yearly \ninstalments from the date of issue of LOI, Payment \nschedule mentioned as under: - \n \n2.3  For Balance Payment of 5%  \n(i)   The balance amount of Rs.275000/ - (Two lakhs \nseventy five thousand Only) being 5% of the tentative \nprice of apartment shall be payable at the time of \npossession.  \n(ii)    Delays in payment of instalments shall result in \ncancellation of the allotment. However, on request \nestablishing genuine grounds, delays up to 12 months \ncan be condoned by the Estate Officer, by charging 18% \ninterest for the period of delay. Delays beyond 12 months \nshall not be condoned under any circumstances and shall \nresult in cancellation of allotment and refund of the \namounts paid, after forfeiture of 10% of the amount. \nPossession shall not be handed over till all dues are \ncleared.  \n(iii)  In case of fully paid apartments, the enhancement \nin price (due to the reasons laid down in para 1(ii), shall \nhave to be paid within 90 days of such demand without \npayment of any interest or in 6 Half Yearly instalments \nalong with interest @ 12 per annum. In other cases the \nenhancement shall be built into balance instalments.  \n(iv)   All payments shall be made by a bank draft drawn \nin favour of Estate Officer GMADA…  \nOWNERSHIP AND POSSESSION  \n(I) Allotments shall be on free hold basis.  \n(II) Possession of apartment shall be handed over \nafter completion of development works at site \nin a period of 36 months from the date of \nissuance of Letter of Intent. In case for any \nreason, the Authority is unable to deliver the CA@ SLP © Nos. 27847 -48 of 2019   Page 5 of 15 \n possession of apartments within stipulated \nperiod, allottee shall have the right to \nwithdraw from the scheme by moving an \napplication to the Estate Officer, in which \ncase, the Authority shall refund the entire \namount deposited by the applicant along with \n8 % interest compounded annually. Apart \nfrom this, there shall be no other liability of \nthe Authority.  \n(III) The ownership and possession of apartments \nshall continue to vest with Greater Mohali \nArea Development Authority until full \npayment is made of outstanding dues in \nrespect of said apartment.  \n(IV) The allottee shall be required to execute a \nDeed of Conveyance in prescribed format and \nmanner within 90 days of payment of entire \nmoney. The expenses of registration and \nexecution of Conveyance Deed shall be borne \nby the allottee.  \n(V) There shall be bar on sale of the apartment till \n2 years after handing over of possession or 5 \nyears from date of issuance of LOI whichever \nis earlier.  \n(VI) The floor of the apartment shall be allocated \nthrough draw of lots. ”  \n \n3.3  The scheduled date of delivery of possession was \n21st May, 2015.  It has been alleged that on his visit to the \ndevelopment site in May , 2015,  the respondent found no \ndevelopment commensurate to the time that had passed. \nSince  it did not appear likely that possession of the flat \nwould be delivered to the respective owners for another 2 -3 \nyears, he resolved to opt out of the scheme.  \n3.4  He approached the concerned official  in this regard , \nwho apparently informed him that if he chooses  to pursue \nthis route, GMADA would pay him the deposited amount, CA@ SLP © Nos. 27847 -48 of 2019   Page 6 of 15 \n along with 8% interest thereon , from 21st May, 2015, t ill the \ndate of payment.  \n3.5  Given that no relevant document stipulated such a \ncondition, the respondents filed a consumer complaint (CC \nNo.197 of 2016), which was withdrawn due to certain \ntechnical reasons.  Shortly after, GMADA issued a letter of \nallotment -cum-offer of possession dated 29th June, 2016, \nstating that the ‘numbering draw’ was held on 5th January , \n2016 and he had been allotted ‘Apartment No.902, Tower \nNo.7, Block C, Floor 8, Type 2’. \n3.6  Upon visiting the allotted flat,  of which he has \nallegedly been  in possession as of now, he found that various \nchanges were made  to the project itself, as also in the \nfacilities and amenities provided therein, unilaterally.  \n4.  It is in the aforesaid backdrop that the complain t, the \nsubject matter of these appeals, came to be filed.  \n5.   The State Commission’s findings can be summarized  inter \nalia as under  : \na) There is no substance to the allegation that the \nfacilities to be provided  by GMADA have not been \nprovided.  There are no photographs to substantiate this, nor \nis there any report issued by a competent person to prove the \nabsence of these facilities in the project.  CA@ SLP © Nos. 27847 -48 of 2019   Page 7 of 15 \n b) The presence of an arbitration clause would not bar \nthe jurisdiction of the State Commission , in view of the \nfindings of this Court in National Seeds Corporation Ltd . \nv. M. Madhusudan Reddy5. \nc) GMADA cannot stop the respondents from seeking \na refund of their money because it was concluded that there \nis no proof on record that the authority completed the project \nwithin the stipulated time. Such desire to seek a refund is \nalso not without precedent as GMADA had already \nextended this facility to another allotte e. \nd) It is an undisputed position that the respondents had \npaid a substantial amount of consideration towards the flats \nthey were to receive and only a small portion of the total \nconsideration remained to be paid.  \ne) The respondents were entitled to withdraw from the \nscheme. GMADA cannot be accorded any benefit on the \nground that they had offered possession to the respondents \non 29th June, 2016, which is more than a year after the \nstipulated date of completion.  \n6. Having come to the conclusions as above, the State \nCommission pass ed the following order:  \n \n“17. In view of the above discuss, the Consumer \nComplaint No.438 of 2017 is accepted and the opposite \nparty is directed to refund the entire deposited amount of \nRs.50,46,250/ - to the complainant along with interest at \nthe rate of 8%, compounded annually und er Clause 3(II) \n \n5 (2012) 2 SCC 505  CA@ SLP © Nos. 27847 -48 of 2019   Page 8 of 15 \n of the Letter of Intent, Ex. C -2. The opposite party shall \nalso pay a compensation of Rs.60,000/ - to the \ncomplainant for mental tension and harassment suffered \nby him and Rs.30,000/ -, as costs of litigation. The \nopposite party shall also pay the interest p aid by the \ncomplainant to State Bank of India on the loan taken \nfrom it and paid to the opposite party for the purchase of \nthe flat, as charged by the Bank from the complainant.  \n18. In view of reasons and discussion held in Consumer \nComplaint No.438 of 2017, the Consumer Complaint \nNo.439 of 2017 accepted and the opposite party is \ndirected to refund the entire deposited amount of \nRs.41,29,619/ - to the complainant, along with interest at \nthe rate of 8%, compounded annually under Clause 3(II) \nof the Letter of Intent, Ex. C -2. The opposite party shall \nalso pay a c ompensation of Rs.60,000/ - to the \ncomplainant for the mental tension and harassment \nsuffered by him and Rs.30,000/ - as costs  of litigation. \nThe opposite party shall also pay the interest paid by the \ncomplainant to State Bank of Hyderabad and State Bank \nof India on the loan taken from it and paid to the opposite \nparty for the purchase of the flat as charged by the Bank \nfrom the complainant. ” \n(Emphasis supplied)  \n \n7. GMADA carried the matter in appeal s to NCDRC.  In the \nimpugned order, reference is made to Greater Mahali Area \nDevelopment Authority v. Priyanka Naiyyar6, which was also \nreferred to by the State Commission, where the Commission had \ngranted compensation of ₹2 lakhs to the complainant in addition \nto the 8% interest, which was to be given on account of the fact \nthat the interest charged by the bank in th e case was @ 10.75%. \nIt was concluded that there was no merit in th e appeal s which  \nwere dismissed on the grounds of delay and merit, along with \n \n6 1st appeal No. 1456 of 2016  CA@ SLP © Nos. 27847 -48 of 2019   Page 9 of 15 \n costs quantified at ₹ 20,000 /- each to be paid to both the \nrespondents herein.  \n8. Aggrieved by this order, GMADA is before us.   Notice was \nissued on 8th November, 2019 limited to that part of the order  by \nwhich interest has been awarded on the loan taken by the \nrespondent -Anupam Garg  from the State Bank of India in \naddition to the 8% compounded interest already granted.  \n9. We have heard the learned counsel for the parties.  \n10. The appellants ’ case is that casting liability for the \nrespondents ’ loan upon GMADA is not a position under  law.  In \ncontrast, the  respondents argue to the contrary , stating that the \nCommissions have the requisite authority to grant compensation \nover and above what is agreed in the contract .  It is their case that \nthe terms of the agreement cannot circumscribe the authority of \nthe Commission to award just compensation.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          \n11. In Bangalore Development Authority v. Syndicate Bank7, \nthis Court having surveyed several other judgments, laid down \nseven principles regarding grant/non -grant of relief to an allottee \nwho is aggrieved by non -delivery or delay in delivery of \nplots/flats. This case is covered by the first one, which is as \nfollows  : \n \n“(a) Where the development authority having received \nthe full price, does not deliver possession of the allotted \nplot/flat/house within the time stipulated or within a \nreasonable time, or where the allotment is cancelled or \n \n7 (2007) 6 SCC 711  \n CA@ SLP © Nos. 27847 -48 of 2019   Page 10 of 15 \n possession is refused without any justifiable cause, the \nallottee is entitled for refund of the amount paid, with \nreasonable interest thereon from the date of payment to \ndate of refund. In addition, the allottee may also be \nentitled to compensation, as may  be decided with \nreference to the facts of each case.”  \n \n \n12. The observations made in GDA v. Balbir Singh8 are also \nimportant when it comes to the determination of compensation . \nIt was held as under  : \n \n“…Thus the Forum or the Commission must determine \nthat there has been deficiency in service and/or \nmisfeasance in public office which has resulted in loss \nor injury. No hard -and-fast rule can be laid down, \nhowever, a few examples would be where an allotment \nis made, price is received/paid but possession is not \ngiven within the period set out in the brochure. The \nCommission/Forum would then need to determine the  \nloss. Loss could be determined on basis of loss of rent \nwhich could have been earned if possession was given \nand the premises let out or if the consumer has had to \nstay in rented premises then on basis of rent actually paid \nby him. Along with recompensing  the loss the \nCommission/Forum may also compensate for \nharassment/injury, both mental and physical. Similarly, \ncompensation can be given if after allotment is made \nthere has been cancellation of scheme without any \njustifiable cause.  \n \n9. That compensation cannot be uniform and can best be \nillustrated by considering cases where possession is \nbeing directed to be delivered and cases where only \nmonies are directed to be returned. In cases where \npossession is being directed to be delivered th e \ncompensation for harassment will necessarily have to be \nless because in a way that party is being compensated by \nincrease in the value of the property he is getting. But in \ncases where monies are being simply returned then the \nparty is suffering a loss i nasmuch as he had deposited the \n \n8 (2004) 5 SCC 65 CA@ SLP © Nos. 27847 -48 of 2019   Page 11 of 15 \n money in the hope of getting a flat/plot. He is being \ndeprived of that flat/plot. He has been deprived of the \nbenefit of escalation of the price of that flat/plot. \nTherefore the compensation in such cases would \nnecessarily have to be higher. Further if the  construction \nis not of good quality or not complete, the compensation \nwould be the cost of putting it in good shape or \ncompleting it along with some compensation for \nharassment. Similarly, if at the time of giving possession \na higher price or other amount s are collected \nunjustifiably and without there being any provision for \nthe same the direction would be to refund it with a \nreasonable rate of interest. If possession is refused or not \ngiven because the consumer has refused to pay the \namount, then on the f inding that the demand was \nunjustified the consumer can be compensated for \nharassment and a direction to deliver possession can be \ngiven. If a party who has paid the amount is told by the \nauthority that they are not in a position to ascertain \nwhether he ha s paid the amount and that party is made to \nrun from pillar to post in order to show that he has paid \nthe amount, there would be deficiency of service for \nwhich compensation for harassment must be awarded \ndepending on the extent of harassment. Similarly, i f after \ndelivery of possession, the sale deeds or title deeds are \nnot executed without any justifiable reasons, the \ncompensation would depend on the amount of \nharassment suffered. We clarify that the above are mere \nexamples. They are not exhaustive. The ab ove shows \nthat compensation cannot be the same in all cases \nirrespective of the type of loss or injury suffered by the \nconsumer.”  \n \n13. The entitlement of compensation, therefore, is not in \ndispute.  A reference to Balbir Singh  (supra) shows that \ncompensation can take different forms, considering the facts a nd \ncircumstances at  hand.   Determination has to be made , keeping \nin view the stage of the work completed, where the service \nprovider has lapsed in duty and the loss caused thereby etc. CA@ SLP © Nos. 27847 -48 of 2019   Page 12 of 15 \n Uniformity is foreign to such determination.  Here only we may \nobserve that the State Commission,  as well as NCDRC’s reliance \non Priyanka Nayyar (supra) is misplaced.  In that case , ₹ 2 lakh s \nwas given as compensation, taking into account that the \ncomplainant had suffered interest in the loan taken at the rate of \n10.75% .  It was not given as payment for the interest itself.  By \nplacing reliance on this order, against which one special leave \npetition  indeed stands dismissed, what was open for the \ncommission to do was to, in the attending facts and \ncircumstances, compute an amount as compensation, in which \none of the factors would be that in order to secure a property in \nthe scheme floated by the GMA DA, the respondent s had taken \nout a loan and would be liable to pay interest thereon. However, \nthis order does not permit the interest on the loan, in its entirety, \nto be saddled by the authority responsible for the housing scheme \nand the delay, which is the genesis of the dispute.  \n14. We are supported in this view by the findings made by a \ncoordinate Bench of this Court in  DLF Homes Panchkula (P) \nLtd. v. D.S. Dhanda9, which is extracted as under  : \n \n“15. The District Forum under the Consumer Protection \nAct, 1986 (“the 1986 Act”) is empowered inter alia to \norder the opposite party to pay such amount as may be \nawarded as compensation to the consumer for any loss \nor injury suffered by the consumer due to the negligence \nof the opposite party including to grant punitive \ndamages. But the forums under the Act cannot award \ninterest and/or compensation by applying rule of thumb. \n \n9 (2020) 16 SCC 318  \n CA@ SLP © Nos. 27847 -48 of 2019   Page 13 of 15 \n The order to grant interest at the maximum of rate of \ninterest charged by nationalised bank for advancing \nhome loan is arbitrary and has no nexus with the default \ncommitted. The appellant has agreed to deliver \nconstructed flats. For delay in handing over possession, \nthe consumer is entitled to the consequences agreed at \nthe time of executing buyer's agreement. There cannot \nbe multiple heads to grant of damages and interest when \nthe parties have agreed for payment of damages @ Rs 1 0 \nper square foot per month . Once the parties agreed for a \nparticular consequence of delay in handing over of \npossession then, there have to be exceptional and strong \nreasons for  Scdrc/Ncdrc  to award compensation at more \nthan the agreed rate .” \n(Emphasis supplied)  \n \n15. A perusal of the judgment and order s of the Commissions \ndoes not reveal any exceptional or strong reasons for the interest \non the loan taken by the respondents to be paid by GMADA.  \nThat apart, whether the buyer s of the flat do so by utilizing  their \nsavings, taking a loan for such purpose or securing  the required \nfinances by any other permissible means, is not a consideration \nthat the developer of the project is required to keep in mind.  For, \nso far as they are concerned, such a consideration is irrelevant . \nThe one who is buying a flat is a consumer , and the one who is \nbuilding it is a service provider. That is the only relationship \nbetween the parties. If there is a deficiency or delay in service, \nthe consumer is  entitled to be compensated for the same. \nRepayment of the entire principal amount along with 8% interest \nthereon, as stipulated in the contract, alongside the clarification \nthat there shall be no other liability on the authority, sufficiently \nmeets this r equirement.  CA@ SLP © Nos. 27847 -48 of 2019   Page 14 of 15 \n 16. In DLF Homes Panchkula (P) Ltd . (supra) , it was also \nobserved as follows:  \n“17. This Court in a judgment reported as  Irrigation \nDepartment, State of Orissa  v. G.C. Roy  [Irrigation \nDepartment, State of Orissa  v. G.C. Roy , (1992) 1 SCC \n508] examined the question as to whether an arbitrator \nhas the power to award interest pendente lite. It was held \nthat a person deprived of use of money to which he is \nlegitimately entitled has a right to be compensated for \nthe deprivation w hich may be called interest, \ncompensation or damages. Thus, keeping in view the \nsaid principle laid down in the aforesaid judgment, the \namount of the interest is the compensation to the \nbeneficiary deprived of the use of the investment made \nby the complain ant. Therefore, such interest will take \ninto its ambit, the consequences of delay in not handing \nover his possession. In fact, we find that the \nlearned  Scdrc  as well as  Ncdrc  has awarded \ncompensation under different heads on account of \nsingular default of not handing over possession.  Such \naward under various heads in respect of the same default \nis not sustainable.”  \n(Emphasis supplied)  \n \n17.  What flows from the above is that the amount of interest \nawarded is the compensation to the investment maker for the \namount of money and the time he has been denied the fruits of \nthat investment.  The 8% interest awarded in this case on top of \nthe entire amount that is be ing invested, is the compensation for \nbeing deprived of the investment of that money.  Apart from this \nno amount of interest on the loan taken by the respondents could \nhave been awarded.  \n18. We clarify that we have in no way held that the \nCommission is not empowered to give compensation, generally. CA@ SLP © Nos. 27847 -48 of 2019   Page 15 of 15 \n For that reason, we do not interfere with the award of certain \namounts on account of mental agony and litigation costs .  We \nhave  only interfered with that part of the order as set out in the \nnotice.  It has come on record that the amount deposited before \nthe State Commission does not include the amount of interest on \nthe loan.  In view of the above discussion, we hold that there is \nno requirement for GMADA to make any further deposit. The \namount as it stands currently, be dispersed to the respondents.  \n19. The appeals are allowed.  Pending applications, if any, \nshall stand disposed of.  \n \n \n…………………….J.  \n(Sanjay Karol)       \n \n \n \n \n…………………….J.  \n(Pras anna B. Varale)                 \n4th June , 2025 ; \nNew Delhi ."
}