{
  "filename": "M_S_BALAJI_TRADERS_VS._THE_STATE_OF_U.P..pdf",
  "page_count": 19,
  "content": "2025 INSC 806\nCrl.A. @ SLP(Crl.)No. 3159/2025                                                   Page 1 of 19 \n REPORTABLE  \n \nIN THE SUPREME COURT OF INDIA  \nCRIMINA L APPELLATE JURISDICTION  \n \nCRIMINAL APPEAL NO.            OF 2025  \n(Arising out of SLP (Crl.)No.3159 /2025 ) \n \n \nM/S. BALAJI TRADERS          ...    APPELLANT(S)  \n \nVERSUS  \n \nTHE STATE OF U .P. & ANR .           ...    RESPONDENT(S)  \n \n \n \nJ U D G M E N T  \n \n \n \nSANJAY KAROL, J.  \n \nLeave Granted .  \n1. The instant appeal , preferred by appellant -complainant,  \narises out of the judgment  and order dated 28th June, 2024 passed Crl.A. @ SLP(Crl.)No. 3159/2025                                                   Page 2 of 19 \n by the High Court of Judicature at Allahabad in Criminal \nMiscellaneous Application No.19550/2024 whereby the \nsummoning order dated 28th August, 2023 as well as entire \nproceedings of Complaint Case No.58 of 2022 under Section 387 \nof the Indian Penal Code , 18601 has been quashed.  \n2. Brief facts that led to the present appeal are  : \nThe complainant , namely, Prof. Manoj Kumar Agrawal,  is \na proprietor of a firm M/s. Balaji Traders, carrying out the \nbusiness of betel nut leaves.   Sanjay Gupta2, allegedly started a \nbusiness under the same name, and litigations are pending \nbetween the parties with respect to Trademark and Copyright \nclaims.  On 22nd May, 2022, when the complainant was heading \ntowards his house, the accused , along with three unknown \npersons carrying rifles in their hands, stopped and threatened him \nto close down his business of betel nut.  They further threatened \nthat he could carry on the business only if he would pay  five la khs \nper month to the accused person.  On the complainant's refusal, \nthe accused persons not only beat him but also tried to kidnap \nhim. On failure of p olice to register F irst Information Report3, he \napproached the Court  by filing a complaint  u/s 200  of the Code \nof Criminal Procedure , 19734. \n \n1 Hereinafter referred to as ‘IPC’  \n2 Hereinafter ‘accused’  \n3 FIR  \n4 Hereinafter referred to as ‘CrPC’  Crl.A. @ SLP(Crl.)No. 3159/2025                                                   Page 3 of 19 \n 3. Pursuant to this complaint, the Trial Court5 after analyzing \nthe oral and documentary  evidence available , found a prima facie \ncase against the accused person and issued summons to him u/s \n387 IPC.  \n4. Being aggrieved, the a ccused person approached the High \nCourt by filing a Miscellaneous Application under section 482  \nCrPC for quashing of summoning order dated 28th August, 2023.  \n5. The High Court , while referring to various judicial \npronouncements, observed that to make out a case of extortion, \none of the essential ingredients is to deliver any property or \nvaluable security under threat by the complainant to the accused; \nand that such ingredient was missing in the instant case as no \nmoney was handed over to the accused person.  It further \nobserved that since no offence of extortion under Section 383  \nIPC is made out, consequently, no offence under Section 387  IPC \nwould be made out, thus , finding it a fit case to be quashed.  \n \n       SUBMISSIONS OF THE PARTIES  \n \n6. Learned Counsel for the petitioner submits that the Trial \nCourt rightly issued summons on the basis of the statement s of \nwitnesses and the complainant, and the High Court wrongly \nrelied on the judgments dealing with 38 4 IPC and not 387 IPC.  \n \n5 Court of Additional Sessions Judge/Special Judge(Dacoit  Prabhav  Area) Jalaun Place \nOrai Crl.A. @ SLP(Crl.)No. 3159/2025                                                   Page 4 of 19 \n 7. Learned Counsel for respondent No.2, while relying on \nDhananjay  @ Dhandhanjay Kumar Singh v . State of Bihar6 \nsubmits that since the essential ingredient of extortion, i.e. , \ndelivery of property, is not met, consequently, the charge under \nSection 387 IPC cannot be sustained . Respondent No.2, who is \nrunning a similar business to that of the complainant, had lodged \nan FIR against the complainant, as such  the instant FIR is directly \nlinked to the respondent's enforcement of his Intellectual \nProperty Rights and made as a counterblast to the respondent's \nlawful actions.  Further reliance is placed on State of Haryana v . \nBhajan L al7; and Inder Mohan Goswami v . State of \nUttaranchal8, submitting  that criminal prosecution should not be \nused as an instrument of harassment , or for seeking personal \nvendetta  with an ulterior motive of pressur izing  the accused . \nFurther, p lacing reliance on Motib hai Fulabhai  Patel & Co. v. \nR. Prasad9; Dilip Kumar Sharma v . State of M.P .10; and Tolaram \nRelumal v . State of Bombay11, it is submitted that  since  penal \nstatutes have to be construed and interpreted strictly, section 387  \nIPC is an aggravated form of extortion  and cannot be stretched to \n \n6 2007 (14) SCC 768  \n7 1992 Supp (1) SCC 335  \n8 2007 (12) SCC 1  \n9 1968 SCC OnLine SC310  \n10 (1976) 1 SCC 560 \n11 (1954) 1 SCC 961  Crl.A. @ SLP(Crl.)No. 3159/2025                                                   Page 5 of 19 \n cover mere threats , without any delivery of property or valuable \nsecurity.   \n   \nPOSITION OF LAW  \n \n8. Before adverting to the facts of the present case, it is \nimperative to acknowledge that IPC provides for offences, their \ningredients, and their distinct punishments. The relevant Sections  \nof extortion defined in Chapter XVII  of IPC  are reproduced \nbelow  : \n \n“Section 383 defines Extortion:     Whoever intentionally \nputs any person in fear of any injury to that person, or to \nany other, and thereby dishonestly induces the person so \nput in fear to deliver to any person any property or \nvaluable security or anything signed or sealed which \nmay be conv erted into a valuable security,  commits \n“extortion”.  \n \nSection 384  Punishment for extortion : Whoever \ncommits extortion  shall be punished with imprisonment \nof either description for a term which may extend to \nthree years, or with fine, or with both ; \n \nSection 385     Putting person in fear of injury in order to  \ncommit extortion -Whoever, in order to the committing \nof extortion, puts any person in fear, or attempts to put \nany person in fear, of any injury, shall be punished with \nimprisonment of either description for a term which may \nextend to two years, or with fine, or with both.  \n \nSection 386    Extortion  by putting a person in fear of \ndeath or grievous hurt. —Whoever commits extortion  by \nputting any person in fear of death or of grievous hurt to \nthat person or to any other, shall be punished with Crl.A. @ SLP(Crl.)No. 3159/2025                                                   Page 6 of 19 \n imprisonment of either description for a term which may \nextend to ten years, and shall also be liable to fine  \n \nSection 387 Putting person in fear of death or of grievous \nhurt, in order to commit extortion : Whoever, in order to \nthe committing of extortion, puts or attempts to put any \nperson in fear of death or of grievous hurt to that person \nor to any other, shall be punished with imprisonment of \neither description for a term which may extend to seven \nyears,  and shall also be liable to fine.  \n \nSection 388.     Extortion by threat of accusation of an \noffence punishable with death or imprisonment for life, \netc.—Whoever commits extortion  by putting any person \nin fear of an accusation against that person or any other, \nof having committed or attempted to commit any offence \npunishable with death, or with  imprisonment for life, or \nwith imprisonment for a term which may extend to ten \nyears, or  of having attempted to induce any other person \nto commit such offence, shall be punished with \nimprisonment of either description for a term which may \nextend to ten years, and shall also be liable to fine; and, \nif the offence be one punishable under Sectio n 377 of \nthis Code, may be punished with  imprisonment for life.  \n \nSection 389.    Putting person in fear or accusation of \noffence, in order to commit extortion .—Whoever, in \norder to the committing of extortion, puts or attempts to \nput any person in fear of an accusation, against that \nperson or any other, of having committed, or attempted \nto commit, an offence punishable with death or with \nimprisonment for life , or with imprisonment for a term \nwhich may extend to ten years, shall be punished with \nimprisonment of either description for a term which may \nextend to ten years, and shall also b e liable to fine; and, \nif the offence be punishable under section 377 of this \nCode, may be punished with  imprisonment for life .” \n \n(Emphasis Supplied)  \n  Crl.A. @ SLP(Crl.)No. 3159/2025                                                   Page 7 of 19 \n 9. A glance over all the Sections related to extortion would \nreveal a clear  distinction being carried out  between the actual \ncommission of extortion and the process of putting a person in \nfear for the purpose of committing extortion .  \n10. Section 383 defines extortion,  the punishment therefor is \ngiven in Section 384.  Sections 386 and 388 provide for an \naggravated form of extortion . These sections deal with the actual \ncommission of an act of extortion, whereas Sections 385, 387 and \n389 IPC seek to punish for an act committed for the purpose of \nextortion even though the act of extortion may not be complete \nand property not delivered.  It is in the process of committing an \noffence that a person is put in fear of injury, death or grievous \nhurt. Section 387 IPC provides for a stage prior to committing \nextortion, which is putting a person in fear of death or grievous \nhurt ' in order to commit extortion', similar to Section 385 IPC.   \nHence, Section 387 IPC is an aggravated form of 385  IPC, not \n384 IPC.  \n11. Having deliberated upon the offence of extortion  and its \nforms , we proceed to analyze the essentials of both Sections, i.e., \n383 and 387 IPC, the High Court dealt with .  \n12. The essential ingredients of extortion under Section 383 \nIPC, as laid down by this Court in R.S. Nayak v. A.R. Antulay12, \nare : \n \n12 (1986) 2 SCC 716  Crl.A. @ SLP(Crl.)No. 3159/2025                                                   Page 8 of 19 \n “60. …The main ingredients of the offence are:  \n \n(i) the accused must put any person in fear of injury to \nthat person or any other person;  \n \n(ii) the putting of a person in such fear must be \nintentional;  \n \n(iii) the accused must thereby induce the person so put \nin fear to deliver to any person any property, valuable \nsecurity or anything signed or sealed which may be \nconverted into a valuable security ; and  \n \n(iv) such inducement must be done dishonestly.  \n \n           Before a person can be said to put any per son in \nfear of any injury to that person, it must appear that he \nhas held out some threat to do or omit to do what he is \nlegally bound to do in future. If all that a man does is to \npromise to do a thing which he is not legally bound to do \nand says that if money is not paid to him he would not \ndo that thing, such act would not amount to an offence \nof extortion. …”  \n \n13. But a perusal of Section 387 IPC reveals its essential \ningredients, to be  : \n(a) Accused must have put a person in fear of death or \ngrievous hurt;  \n(b) Such an act must have been done in order to  commit \nextortion;   \nThe expression 'in order to ' has been defined in the following \nways:  Crl.A. @ SLP(Crl.)No. 3159/2025                                                   Page 9 of 19 \n “in order to ” : for the purpose of13 \n“in order to ” : with the purpose of doing14 \n \n‘in order to commit extortion ’ clearly reveal s that it is in \nthe process of committing the offence of extortion.  \n14. Thus, it can be said in terms of Sections 386  (an aggravated \nform of 38 4 IPC)  and 387 IPC that  the former is an act in itself, \nwhereas the latter is the process ; it is a stage before  committing \nan offence of extortion .  The Legislature was mindful enough to \ncriminali ze the process by making it a distinct  offence .  \nTherefore , the commission of an offence of extortion is not sine \nqua non  for an offence under this Section .  It is safe to deduce \nthat for prosecution under Section 387  IPC, the delivery of \nproperty is not necessary.   \n15. In Radha Ballabh v. State of U.P .15, this Court, while \ndealing with a case wherein ransom was demanded for releasing \nthe child, observed that it could not be punishable u nder Section  \n386 IPC as no ransom was extorted. Therefore, the conviction \nwas correctly made under Section 387 IPC.  Similarly, i n \nGursharan Singh v. State of Punjab16, the Court upheld the \nconviction under Section 387  IPC where  money extorted was not \npaid.  \n \n13 Merriam -Webster  \n14 Concise Oxford English Dictionary, Tenth Edition 1999  \n15 1995 Supp (3) SCC 119  \n16 (1996) 10 SCC 190  Crl.A. @ SLP(Crl.)No. 3159/2025                                                   Page 10 of 19 \n 16.  Further, i n Somasundaram v . State17 a three -Judge Bench \nof this Court upheld the conviction under Section 387  IPC, along \nwith other provisions,  on the facts , where  the deceased was tied \nwith an iron chain and rope to a cot and threatened to part with \ncrores of rupees or els e execute the document in their favour. On \nhis failure to do so, the deceased was killed. Thus, even though \nthere was no delivery of property, the conviction was upheld  by \nobserving that Section 387 IPC is a heightened, more serious \nform of the offence of extortion in which the victim is put in fear \nof death or grievo us hurt.  \n17. After going through the penal provisions related to \nextortion, it is also imperative to peruse the necessary principles \nof quashing , laid down by this Court through various judicial \npronouncements which govern the jurisdiction of the High Court \nunder Section 482 CrPC.  \n18. This Court in B.N. John v . State of U .P.18, reiterate d \nseveral principle s of quashing  criminal  cases/complaints/FIR  as \nlaid down , back in the days in Bhajan Lal  (supra)  :  \n \n“102. In the backdrop of the interpretation of the various \nrelevant provisions of the Code under Chapter XIV and \nof the principles of law enunciated by this Court in a \nseries of decisions relating to the exercise of the \nextraordinary power under Article 226 or the inherent \npowers under Section 482 of the Code which we have \nextracted and reproduced above, we have given the \n \n17 (2020) 7 SCC 722  \n18 2025 SCC OnLine SC 7  Crl.A. @ SLP(Crl.)No. 3159/2025                                                   Page 11 of 19 \n following categories of cases by way of illustration \nwherein such power could be exercised either to prevent \nabuse of the process of any court or otherwise to secure \nthe ends of justice, though it may not be possible to lay \ndown any precise, clearly define d and sufficiently \nchannelized and inflexible guidelines or rigid formulae \nand to give an exhaustive list of myriad kinds of cases \nwherein such power should be exercised.  \n \n(1) Where the allegations made in the first information \nreport or the complaint, even if they are taken at their face \nvalue and accepted in their entirety do not prima facie \nconstitute any offence or make out a case against the \naccused.  \n \n(2) Where the allegations in the first information report \nand other materials, if any, accompanying the FIR do not \ndisclose a cognizable offence, justifying an investigation \nby police officers under Section 156(1) of the Code \nexcept under an order of a Mag istrate within the purview \nof Section 155(2) of the Code.  \n \n(3) Where the uncontroverted allegations made in the \nFIR or complaint and the evidence collected in support \nof the same do not disclose the commission of any \noffence and make out a case against the accused.  \n \n(4) Where, the allegations in the FIR do not constitute a \ncognizable offence but constitute only a non -cognizable \noffence, no investigation is permitted by a police officer \nwithout an order of a Magistrate as contemplated under \nSection 155(2) of the Code.  \n \n(5) Where the allegations made in the FIR or complaint \nare so absurd and inherently improbable on the basis of \nwhich no prudent person can ever reach a just conclusion \nthat there is sufficient ground for proceeding against the \naccused.  \n \n(6) Where there is an express legal bar engrafted in any \nof the provisions of the Code or the concerned Act (under Crl.A. @ SLP(Crl.)No. 3159/2025                                                   Page 12 of 19 \n which a criminal proceeding is instituted) to the \ninstitution and continuance of the proceedings and/or \nwhere there is a specific provision in the Code or the \nconcerned Act, providing efficacious redress for the \ngrievance of the aggrieved party.  \n \n(7) Where a criminal proceeding is manifestly attended \nwith mala fide and/or where the proceeding is \nmaliciously instituted with an ulterior motive for \nwreaking vengeance on the accused and with a view to \nspite him due to private and personal grudge. ” \n \nIn Dalip Kaur v. Jagnar Singh19 -  \n \n11. There cannot furthermore be any doubt that the High \nCourt would exercise its inherent jurisdiction only when \none or the other propositions of law, as laid down in R. \nKalyani v. Janak C. Mehta [(2009) 1 SCC 516 : (2009) 1 \nSCC (Cri) 567] is attracted, wh ich are as under: (SCC p. \n523, para 15)  \n \n“(1) The High Court ordinarily would not \nexercise its inherent jurisdiction to quash a \ncriminal proceeding and, in particular, a first \ninformation report unless the allegations \ncontained therein, even if given face value and \ntaken to be correct in their en tirety, disclosed no \ncognizable offence.  \n \n(2) For the said purpose the Court, save and \nexcept in very exceptional circumstances, \nwould not look to any document relied upon by \nthe defence.  \n \n(3) Such a power should be exercised very \nsparingly. If the allegations made in the FIR \ndisclose commission of an offence, the Court \nshall not go beyond the same and pass an order \nin favour of the accused to hold absence of any \nmens rea or actus reus.  \n \n19 (2009) 14 SCC 696  Crl.A. @ SLP(Crl.)No. 3159/2025                                                   Page 13 of 19 \n  \n(4) If the allegation discloses a civil dispute, the \nsame by itself may not be a ground to hold that \nthe criminal proceedings should not be allowed \nto continue.”  \n \n(Emphasis supplied)  \n \n \nA three -Judge Bench of this Court, while summarizing the \nprinciples of quashing in Neeharika Infrastructure (P) Ltd. v. \nState of Maharashtra20, has held that the power of quashing \nshould be exercised sparingly with circumspection in the 'rarest \nof rare cases' and not as an ordinary rule  : \n \n“13.4.   The power of quashing should be exercised \nsparingly with circumspection, in the “rarest of rare \ncases”. (The rarest of rare cases standard in its \napplication for quashing under Section 482CrPC is not \nto be confused with the norm which has been formulated \nin the context of the death penalty, as explained \npreviously by this Court.)  \n… \n13.7.   Quashing of a complaint/FIR should be an \nexception and a rarity than an ordinary rule.  \n… \n13.15.   When a prayer for quashing the FIR is made \nby the alleged accused, the Court when it exercises the \npower under Section 482CrPC, only has to consider \nwhether or not the allegations in the FIR disclose the \ncommission of a cognizable offence and is not requir ed \nto consider on merits whether the allegations make out a \ncognizable offence or not and the Court has to permit the \ninvestigating agency/police to investigate the allegations \nin the FIR. ” \n \n \n20 (2021) 19 SCC 401  Crl.A. @ SLP(Crl.)No. 3159/2025                                                   Page 14 of 19 \n        OUR VIEW  \n \n \n19. It is a well -settled principle of law that penal statutes must \nbe given strict interpretation. The Court ought not to read \nanything into a statutory provision that imposes penal liability.   \n20. A Constitution Bench of this Court in Tolaram Relumal  \n(supra)  has observed  :  \n \n“8. …and it is a well -settled rule of construction of penal \nstatutes that if two possible and reasonable constructions \ncan be put upon a penal provision, the Court must lean \ntowards that construction which exempts the subject \nfrom penalty rather than the one which imposes penalty. \nIt is not competent for the Court to stretch the meaning \nof an expression used by the Legislature in order to carry \nout the intention of the Legislature. As pointed out by \nLord Macmillan in London & North Eastern Railway \nCo. v. Berriman  [London & North Eastern Railway \nCo. v. Berriman , 1946 AC 278 at p. 295 (HL)] : (AC p. \n295) \n \n“… Where penalties for infringement are \nimposed it is not legitimate to stretch the \nlanguage of a rule, however, beneficent its \nintention, beyond the fair and ordinary \nmeaning of its language.”  \n \n21. In M. Narayanan Nambiar v. State of Kerala21,  this Court \nreiterated the observations made by the Privy Council in respect \nof the interpretation of penal statutes  : \n \n“10. A decision of the Judicial Committee in ‘ Francis \nHart Dyke (Appellant) and Henry William Elliott , and \n \n21 1962 SCC OnLine SC 85  Crl.A. @ SLP(Crl.)No. 3159/2025                                                   Page 15 of 19 \n the owners of the steamtug or Vessel  ‘Gauntlet ' [ Law \nReports Privy Council Appeals (4) 1872, p. 184] cited \nby the learned counsel as an aid for construction neatly \nstates the principle and therefore may be extracted : Lord \nJustice James speaking for the Board observes at p. 19:  \n \n“No doubt all penal Statutes are to be \nconstrued strictly, that is to say, the Court \nmust see that the thing charged as an offence \nis within the plain meaning of the words \nused, and must not strain the words on any \nnotion that there has been a slip, that there \nhas been a casus omissus, that the thing is so \nclearly within the mischief that it must have \nbeen intended to be included if thought of.  \nOn the other hand, the person charged has a \nright to say that the thing charged although \nwithin the words, is not within the spirit of \nthe enactment. But where the thing is \nbrought within the words and within the \nspirit, there a penal enactment is to be \nconstrued, like any other instrument, \naccording to the fair common sense meaning \nof the language used, and the Court is not to \nfind or make any doubt or ambiguity in the \nlanguage of a penal statute, where such \ndoubt or ambiguity would clearly not be \nfound o r made in the same language in any \nother instrument.\"  \n \n22. A three -Judge Bench of this Court has also observed in \nDilip Kumar Sharma  (supra)  that a penal provision must be \nstrictly construed; that is to say, in the absence of clear, \ncompelling language, the provision should not be given a wider \ninterpretation . Crl.A. @ SLP(Crl.)No. 3159/2025                                                   Page 16 of 19 \n 23. This Court in  R. Kalyani v. Janak C. Mehta22, while \ndiscussing the strict interpretation of penal statutes has held  : \n \n“37. Maxwell in The Interpretation of Statutes (12th \nEdn.) says:  \n \n“The strict construction of penal statutes \nseems to manifest itself in four ways: in the \nrequirement of express language for the \ncreation of an offence; in interpreting strictly \nwords setting out the elements of an offence ; \nin requiring the fulfilment to the letter of \nstatutory conditions precedent to the \ninfliction of punishment; and in insisting on \nthe strict observance of technical provisions \nconcerning criminal procedure and \njurisdiction.”  \n \n38. In Craies Statute Law (7th Edn. at p. 529) it is said \nthat penal statutes must be construed strictly. At p. 530 \nof the said treatise, referring to U.S. v. Wiltberger [5 L \nEd 37 : 18 US (5 Wheat.) 76 (1820)] it is observed, thus:  \n \n\"The distinction between a strict \nconstruction and a more free  one has, no \ndoubt, in modern times almost disappeared, \nand the question now is, what is the true \nconstruction of the statute? I should say that \nin a criminal statute you must be quite sure \nthat the offence charged is within the letter \nof the law. This rul e is said to be founded on \nthe tenderness of the law for the rights of \nindividuals, and on the plain principle that \nthe power of punishment is vested in the \nLegislature, and not in the judicial \ndepartment, for it is the Legislature, not the \nCourt, which is  to define a crime and ordain \nits punishment.\"  \n \n \n22  (2009) 1 SCC 516  Crl.A. @ SLP(Crl.)No. 3159/2025                                                   Page 17 of 19 \n 24. The scope of the provision cannot be extended by reading \ninto it words which are not there. Section 387  IPC, being a penal \nprovision , has to be strictly interpreted, and no \ncondition/essential ingredient can be read into it that the \nStatute/Section does not prescribe. Since there is no ambiguity in \nthe ingredients of Section 387 IPC, t he observations of Tolaram \nRelumal  (supra)  as contended by the learned counsel appearing \nfor Respondent No.2 would not come to his rescue.   \n25. The reasoning adopted by the High Court is , on the face of \nit, flawed and misplaced. When the Legislature has created two \nseparate offences with distinct  ingredients  and punishments , then \nassigning the essential ingredient of one to another is not a \ncorrect approach adopted by the High Court.   Nowhere does the \nSection say that extortion has to be committed while putting a \nperson in fear of death or grievous hurt.  Instead, it is the other \nway around, that is to say, putting a person in fear of death or \ngrievous hurt to commit extortion. Extortion is not yet \ncommitted; it is in the process of committing it that a person is \nput in fear.  Putting a person in fear would make an accused guilty \nof an offence under Section 387 IPC; it need not satisfy all the \ningredients of extortio n provided under Section 383 IPC . The \nHigh Court ought not to have relied on Dhananjay  (supra) as that \ncase, on the face of it , is clearly distinguishable on facts, the Crl.A. @ SLP(Crl.)No. 3159/2025                                                   Page 18 of 19 \n reason being it dealt with allegations of 384  IPC not 387  IPC, and \ndiscussed the elements of extortion.  \n26. Without going into the merits of the case, we are of the \nview that the instant case is not fit for quashing as the two \nessential ingredients for prosecution under Section 387  IPC, as \ndiscussed supra have been prima facie  disclosed  in the \ncomplaint , (a) that the complainant has been put in fear of death \nby pointing a gun towards him ; and (b) that it was done to \npressur ize him to deliver Rs.5  lakhs. The High Court , while \nquashing, has wrongly emphasized the fact that the said amount \nwas not delivered ; it failed to consider  whether the \nmoney /property  was delivered or not , is not even necessary  as the \naccused  is not charged with Section 38 4 IPC. The allegations of \nputting a person in fear of death or grievous hurt would itself \nmake him liable to be prosecu ted under Section 3 87 IPC.   The \nnatural corollary thereof is that the allegation of the criminal case \nbeing a counterblast is negated.  \n27. With the aforesaid observations, the appeal is accordingly \nallowed. The impugned order dated  28th June, 2024  is set aside, \nand the proceedings emanating from Complaint Case No. 58 of \n2022  are restored to the file of the Trial Court.  Parties are \ndirected to appear before the Trial Court on 12th August, 2025 .  \nParties are further directed to fully cooperate and the hearing is \nexpedited.  Crl.A. @ SLP(Crl.)No. 3159/2025                                                   Page 19 of 19 \n Pending application(s), if any, are disposed of.  \n \n \n……………………J.  \n(SANJAY  KAROL)  \n \n \n \n \n……… .…… .…….J.  \n(MANOJ  MISRA ) \n \nNew Delhi;  \n5th June,  2025."
}