{
  "filename": "N.S._GNANESHWARAN_ETC._VS._THE_INSPECTOR_OF_POLICE.pdf",
  "page_count": 8,
  "content": "2025 INSC 787\nSLP (CRL) NO S. 17481 -17482 OF 2024  Page 1 of 8 \n REPORTABLE  \nIN THE SUPREME COURT OF INDIA  \nCRIMINAL APPELLATE JURISDICTION  \n \nCRIMINAL APPEAL NOS.                    OF 2025  \n(@ SLP (CRL) NOS. 17481 -17482 OF 2024)  \n \nN.S. GNANESHWARAN ETC.                …APPELLANT(S)  \nVERSUS  \nTHE INSPECTOR OF POLICE & ANR.  …RESPONDENT(S)  \n \nJ U D G M E N T  \n \nVIKRAM NATH, J.  \n1. Leave granted.  \n2. The present appeal s arise out of order dated 19.11.2024 \npassed by the Madurai Bench of the High Court of Madras \nin Crl.  O.P. (MD) Nos. 586 and 595 of 2024, whereby the \nHigh Court dismissed the petitions filed by the appellants \nunder Section 482 of the Code of Criminal Procedure, \n19731, seeking quashing of criminal proceedings initiated \nagainst them for offences under Section 120B read with \nSections 420, 468, and 471 of the Indian Penal Code, \n \n1 CrPC.  SLP (CRL) NO S. 17481 -17482 OF 2024  Page 2 of 8 \n 18602, and under Section 13(2) read with Section 13(1)(d) \nof the Prevention of Corruption Act, 19883. \n3. The facts relevant to the present appeal s are as follows:  \n3.1. The appellants herein are arrayed as accused nos. 3 and   \n6 in C.C. No. 16 of 2006, arising out of FIR No. RC MA1 \n2005 0020, registered on the basis of a complaint dated \n27.04.2005 lodged by the respondent no.2 – Bank . It was \nalleged that the accused persons caused wrongful loss \nto the Bank to the tune of Rs.25.89 lakhs, leading to the \nfiling of the charge sheet against nine accused, including \nthe appellants.  \n3.2. The allegations against appellant no.1, N.S. \nGnaneshwaran, are that he was instrumental in \norchestrating the fraudulent diversion of funds \nsanctioned to M/s Vinayaka Corporation. He is alleged \nto have facilitated the encashment of multiple cheques \ndrawn from the fraudulently obtained credit limit, usin g \na network of relatives, employees, and fictitious \nidentities. It is further alleged that he forged signatures \n \n2 IPC. \n3 PC Act.  SLP (CRL) NO S. 17481 -17482 OF 2024  Page 3 of 8 \n and diverted  the funds through various accounts linked \nto his family members and associates.  \n3.3. Appellant no.2, N.S. Madanlal, the brother of \nGnaneshwaran, is alleged to have assisted in the scheme \nby operating a Bank account in the name of Bharathi \nTraders along with his wife, through which cheques were \ndeposited and funds withdrawn. He is also accused of \nphysically filling in cheques and ensuring their credit \nand encashment as part of the larger conspiracy to \nsiphon o ff funds from the Bank . \n3.4. Parallel to the criminal proceedings, the Bank initiated \nrecovery proceedings in O.A. Nos. 186 of 2005 and 5 of \n2006 before the Debt Recovery Tribunal, Chennai4, \nwhich were later renumbered as T.A. Nos. 16 and 57 of \n2007.  \n3.5. The High Court, vide order dated 07.01.2023, allowed \nthe petition under Section 482 CrPC filed by accused \nno.7, who is the wife of appellant no.1, and quashed the \nFIR insofar as it pertained to her. The said order was \n \n4 DRT.  SLP (CRL) NO S. 17481 -17482 OF 2024  Page 4 of 8 \n assailed before this Court by way of Special Leave \nPetition, which came to be dismissed on 26.03.2021.  \n3.6. In identical cases being C.C. Nos. 13 of 2006 and 151 of \n2010, which were initiated by the Central Bureau of \nInvestigation (CBI) against the appellants and other \naccused based on the same set of transactions, a \nsettlement was arrived at between the princip al accused \nand the Bank for an amount of Rs.52,79,000/ -. Taking \nnote of this compromise, the High Court proceeded to \nquash the proceedings against the accused on the \nground of parity, and extended similar relief to the \nappellants herein vide order dat ed 26.09.2022.  \n3.7. Subsequently, the Bank floated a One Time Settlement \n(OTS) scheme, which was availed of by the main \nborrowers, namely accused nos. 4 and 5. Upon full \nrepayment of the dues, the Bank recorded its \nsatisfaction in the pending recovery proceedings, which \nwere dismissed as settled vide order dated 15.12.2023. \nThereafter, the Debt Recovery Certificates were recalled, \nand No Dues Certificates were issued to the borrowers.  SLP (CRL) NO S. 17481 -17482 OF 2024  Page 5 of 8 \n 3.8. In view of the settlement, the appellants moved the High \nCourt under Section 482 CrPC seeking quashing of the \ncriminal proceedings pending against them.  \n3.9. However, the High Court, vide the impugned order, \ndismissed the petitions on the ground that the stage of \ntrial was advanced and held that the criminal \nproceedings could not be quashed merely on the basis of \nthe OTS when a prima facie case was made out.  \n3.10. Aggrieved by the said decision, the appellants are before \nus in the present appeal s. \n4. We have heard the learned counsel appearing for the \nparties and carefully perused the material on record.  \n5. The learned counsel for the appellants submits that the \ndispute in question arises out of a commercial transaction \nwhich has since been amicably resolved through a One \nTime Settlement scheme extended by the Bank . It is \ncontended that the recovery proceedings initiated by the \nBank have been fully settled, no dues remain, and the \nBank has formally issued certificates recording its \nsatisfaction. It is further urged that the appellants are \nsimilarly placed to other co -accused against whom \nproceedings have alrea dy been quashed, and that the SLP (CRL) NO S. 17481 -17482 OF 2024  Page 6 of 8 \n continuation of proceedings in the present matter would \namount to unfair treatment. Additionally, it is submitted \nthat the offences under the Prevention of Corruption Act \nare not attracted in the case of the appellants, who are \nprivate individuals and not public servants.  \n6. On the other hand, learned counsel for the respondents \ncontends that the settlement of dues or compromise \nbetween the parties does not automatically warrant \nquashing of criminal proceedings when serious allegations \ninvolving fraud and criminal conspiracy a re made out. It is \nsubmitted that the existence of a prima facie case is \nsufficient to warrant trial and that private settlements \nshould not interfere with criminal prosecution, especially \nat an advanced stage.  \n7. Having considered the submissions of both sides and \nexamined the record, we are of the view that no useful \npurpose would be served by continuing the criminal \nproceedings in the present matter. The dispute has, \nadmittedly, culminated in a comprehensive One Time \nSettlement under which the Bank has received the entire \noutstanding amount. The recovery proceedings before the \ntribunal have been dismissed as settled, and no residual \nclaim survives. The Bank has not raised any objection to SLP (CRL) NO S. 17481 -17482 OF 2024  Page 7 of 8 \n the closure of the matter and has issued formal \nacknowledgments of satisfaction.  \n8. Further, in identical proceedings filed by the CBI against \nthe appellants in C.C. Nos. 13 of 2006 and 151 of 2010, \nthe charge sheets were quashed by the High Court after \ntaking note of the settlement reached in the recovery \nproceedings. The special leave p etitions preferred by the \nState being SLP (Crl) No. 711 of 2021 and SLP (Crl) No. 825 \nof 2021 challenging the said quashing were dismissed by \nthis Court, rendering the orders final. Since the facts and \nlegal position are the same in the present matter, we see \nno reason why the appellants should not be given the same \nrelief.  \n9. In our view, allowing the present criminal proceedings to \ncontinue would serve no meaningful purpose, particularly \nwhen the dispute between the parties has already been \nresolved through a full and final settlement. The \nsettlement between the parties having  taken place after the \nalleged commission of the offence, and there being no \ncontinuing public interest we see no justification for \nallowing the matter to proceed further.  \n10. In view of the above discussion, we find it appropriate to \nquash the proceedings pending in C.C. No. 16 of 2006 SLP (CRL) NO S. 17481 -17482 OF 2024  Page 8 of 8 \n against the appellants herein. Consequently, the appeals  \nare allowed.  \n11. Pending application(s), if any, shall stand disposed of.  \n \n………………………………..J.  \n[VIKRAM NATH]  \n \n \n \n………………………………..J.  \n[SANDEEP MEHTA]  \n \nNEW DELHI;  \nMAY 28, 2025"
}