{
  "filename": "NAGARAJAN_VS._THE_STATE_OF_TAMIL_NADU.pdf",
  "page_count": 19,
  "content": "2025 INSC 802\nNON-REPORTABLE\nIN THE SUPREME COURT OF INDIA\nCRIMINAL APPELLATE JURISDICTION\nCRIMINAL APPEAL NOS.2892-2893 OF 2025\n(ARISING OUT OF SLP (CRL.) NOS.621-622 OF 2024)\nNAGARAJAN     … APPELLANT\n VERSUS\nSTATE OF TAMIL NADU     … RESPONDENT\nJ U D G M E N T\nNAGARATHNA, J.\nLeave granted.\n2.Being  aggrieved  by  the  common  impugned  order  dated\n29.11.2021  passed  by  the  High  Court  of  Judicature  at\nMadras Bench at Madurai dismissing the Criminal Appeal\npreferred by the appellant being Crl. A. (MD) No. 137/2015\nand allowing the suo motu revision being Crl. R.C. (MD) No.\n248/2015 thereby convicting the appellant under Sections\n306 and 448 of the Indian Penal Code, 1860 (hereinafter\nPage 1 of 19referred to as “IPC”), the present Criminal Appeals have been\nfiled by the appellant (accused).\n3.Briefly stated, the facts of the case are that the appellant\nwas the neighbour of the deceased Smt. Mariammal. On the\nnight of 11.07.2003, the appellant entered the room of the\ndeceased and while hugging her, attempted to outrage her\nmodesty.  Upon hearing the disturbance, the mother-in-law\nof the deceased intervened and scolded the appellant, who\nthen  fled  from  the  premises.  The  next  day  i.e.,  on\n12.07.2003, at around 5:00 A.M., the mother-in-law of the\ndeceased  found  the  deceased  and  her  infant  daughter\nmissing from the house. Thereafter, she searched for them\nand enquired about their whereabouts from the deceased’s\nfather.  It  was  later  revealed  that  in  the  morning,  the\ndeceased had visited the school where her elder daughter\nwas studying in Class III and attempted to take her away.\nHowever, due to the absence of the warden, the teachers did\nnot allow the child to leave. The deceased thereafter went to\na nearby field with her infant of one and half years and\ncommitted suicide by consuming oleander seeds and also\nPage 2 of 19administered poison to her child. Both the deceased and her\nchild were later discovered by a passerby who was grazing\ncattle  nearby,  who  then  alerted  the  village  watchman.\nAlthough  the  child  was  still  alive  when  found,  she  was\ndeclared dead when she was taken to the hospital. \n4.Based on the complaint lodged by the watchman, FIR No.\n239/2003  was  registered  with  Kannivadi  Police  Station\nunder  Section  306  of  IPC  against  the  appellant.  Upon\ncompletion of the investigation, a charge-sheet was filed on\n30.10.2003 against the appellant under Section 306 of IPC.\nThe case was committed to the Mahila Court, Fast Track\nCourt, Dindigul as S.C. No. 54 of 2007. The Trial Court\naltered the charges to Sections 354 and 448 of IPC and on\n29.05.2015, the Trial Court acquitted the appellant of the\ncharge  under  Section  306  of  IPC.  The  appellant  was\nconvicted under Sections 354 and 448 of IPC and sentenced\nto undergo simple imprisonment for three years and one\nmonth and to pay a fine of Rs. 25,000/- and in default\nwhereof to undergo simple imprisonment for three months\nfor  the  offence  under  Section  354  of  IPC  and  a  further\nPage 3 of 19sentence  simple  imprisonment  for  three  months  for  the\noffence under Section 448 of IPC. The Trial Court observed\nthat  the  evidence  on  record  reveals  that  the  appellant\ntrespassed  into  the  house  of  deceased  at  midnight  and\nhugged  her.  Accordingly,  the  Trial  Court  convicted  the\nappellant under Sections 354 and 448 of IPC. Insofar as\nSection 306 of IPC was concerned, the Trial Court observed\nthat the actions of the appellant did not constitute abetment\nof suicide as the appellant did not instigate the deceased to\ncommit  suicide.  Hence,  the  Trial  Court  acquitted  the\nappellant under Section 306 of IPC. \n5.Being aggrieved by the conviction under Sections 354 and\n448 of IPC, the appellant filed Criminal Appeal before the\nHigh  Court  being  Crl.  A.  (MD)  No.  137/2015.  While\nadmitting  the  appeal  and  entertaining  the  appellant’s\napplication  for  suspension  of  sentence,  the  High  Court,\nupon a prima facie appraisal of the Trial Court’s reasoning,\nformed the view that the appellant’s acquittal under Section\n306 of IPC may require further examination. Observing that\nthe evidence relating to abetment of suicide was not duly\nPage 4 of 19appreciated  and  noting  that  the  State  had  not  filed  an\nappeal against the acquittal, the High Court by order dated\n08.06.2015, suo motu directed the registration of a criminal\nrevision case to examine the propriety of the acquittal. This\ncame to be registered as Crl. R.C.(MD) No. 248 of 2015. This\nwas during the pendency of accused appeal before the High\nCourt.\n6.In order to exercise of suo motu revisional powers of the High\nCourt, appointed an Amicus Curiae to assist the Court. The\nAmicus  was  further  tasked  to  examine  the  Trial  Court’s\nfindings in acquitting the Appellant accused under Section\n306 of IPC.\n7.By common impugned judgment dated 29.11.2021, the High\nCourt asserted that it has the inherent power to initiate suo\nmotu revision under Section 401 of the Code of Criminal\nProcedure,  1973  (for  short,  “CrPC”).  The  High  Court\ndismissed the Criminal Appeal filed by the appellant and\nallowed  the  suo  motu Criminal Revision  Petition,  thereby\nconvicting the appellant under Sections 306 and 448 of IPC\nand sentenced him to undergo rigorous imprisonment for\nPage 5 of 19five years and to pay a fine of Rs. 5,000/- and in default, to\nundergo  simple  imprisonment  for  three  months  for  the\noffence  under  Section  306  of  IPC  and  sentenced  him  to\nundergo  simple  imprisonment  for  three  months  for  the\noffence committed under Section 448 of IPC. The High Court\nobserved that  the appellant  has  played an active  role in\ntarnishing the self-esteem of the deceased by outraging her\nmodesty  and  thereby  instigated  her  to  commit  suicide.\nHence, the offence under Section 306 of IPC was made out. \n8.Being aggrieved, the appellant has filed the present Criminal\nAppeals.\n9.We have heard learned counsel for the respective parties and\nperused  the  material  on  record.  This  appeal  is  being\ndisposed  of  by  following  the  judgment  of  this  Court  in\nSachin  vs.  State  of  Maharashtra,  Criminal  Appeal\nNos.2073-2075 of 2025  dated  21.04.2025. The relevant\nparagraphs of the said judgment read as under:\n“23.The  question  for  consideration  in  this  case  is,\nwhether, in an appeal against conviction, the appellate\ncourt could have directed enhancement of the sentence in\nan  appeal  filed  by  the  accused.  Under  clause  (b)  of\nSection  386  CrPC,  firstly,  the  appellate  court  can  no\nPage 6 of 19doubt  alter  the  findings  and  sentence  and  acquit  or\ndischarge the accused or order him to be retried by a\nCourt  of  competent  jurisdiction  subordinate  to  such\nappellate  court  or  committed  for  trial.   Secondly,  the\nappellate court can also alter the findings but maintain\nthe  sentence.  Thirdly,  the  appellate  court  can,  in  an\nappeal from a conviction, with or without altering the\nfinding, alter the nature or the extent, or the nature and\nextent,  of the sentence  but not  so as to enhance  the\nsame. A plain reading of this would imply that in an\nappeal against conviction which is obviously filed by the\naccused, the challenge could be two-fold: firstly, it could\nbe against the conviction itself in which case there is a\nchallenge  to  the  sentence  also;  and  secondly, the\nchallenge could be only to the sentence while accepting\nthe conviction. In other words, the challenge would also\nbe only for reduction of the sentence. The question is,\nwhether,  in  an  appeal  challenging  the  conviction  and\nsentence, the appellate court could, while affirming the\nconviction  enhance  the  sentence  imposed  by  the  trial\ncourt by directing that the same had to be with reference\nto other statutory provisions.  There is no doubt that the\nappellate  court  while  maintaining  the  conviction  can\nreduce the sentence and grant partial relief to an accused\nbut in an appeal filed by the appellant-accused, can the\nappellate court not only affirm the conviction but go a\nstep further and seek to enhance the sentence than what\nhas been imposed by the  Trial Court. It cannot be lost\nsight  of  that  in  an  appeal  filed  by  the  accused,  the\nappellant-accused is, at best, seeking a reversal of the\nconviction as well as setting aside of the sentence and the\nleast that the appellant-accused can expect is even while\nthe  conviction  is  affirmed,  the  sentence  could  be\nmaintained, if not reduced.\n24.Thus, in an appeal filed by the appellant-accused\nagainst the judgment of the conviction and sentence, can\nthe  accused  be  left  worse-off  while  the  conviction  is\naffirmed  by  the  appellate  court  exercising  appellate\njurisdiction  by  enhancing  the  sentence?   In  such  an\nPage 7 of 19event, the appellant-accused would be better off, if he\neither withdraws his appeal or, not to file an appeal at all.\nBut an appeal is not only a valuable statutory right but\nalso a constitutional right in criminal cases.” \n10.That a right of appeal is an invaluable right, particularly for\nan accused who cannot be condemned eternally by a trial judge,\nwithout  having  a  right  to  seek  a  re-look  of  the  Trial  Court’s\njudgment by a superior or appellate court. The right to prefer an\nappeal is not only a statutory right but also a constitutional right\nin the case of an accused. This is because an accused has a right\nto  not  only  challenge  a  judgment  on  its  merits,  namely,  with\nrespect to the conviction and sentence being imposed on him, but\nalso  on  the  procedural  aspects  of  the  trial.  An  accused  can\nquestion procedural flaws, impropriety and lapses that may have\nbeen committed by the Trial Court in arriving at the judgment of\nconviction and imposition of sentence in an appeal filed against\nthe same. It then becomes the duty of the appellate court to\nconsider the appeal from the perspective of the accused-appellant\ntherein to see if he has a good case on merits, and to set aside the\njudgment of the Trial Court and acquit the accused, or to remand\nthe matter for a re-trial in accordance with law, or to reduce the\nPage 8 of 19sentence while maintaining the conviction or, in the alternative, to\ndismiss the appeal. In our considered view, the appellate court in\nan  appeal  filed  by  the  accused  cannot  while  maintaining  the\nconviction enhance the sentence. While exercising its appellate\njurisdiction,  the  High  Court  cannot  act  as  a  revisional  court,\nparticularly, when no appeal or revision has been filed either by\nthe  State,  victim  or  complainant  for  seeking  enhancement  of\nsentence against accused. In the aforesaid judgement, we have\nanalysed Section 386 of CrPC which deals with the right of a\nparty  including  an  accused  to  file an  appeal, we  may  peruse\nSection 401 of CrPC which deals with the revisional powers of the\nHigh Court and which is extracted as under:\n“401. High Court's powers of revision.— (1) In the case\nof any proceeding the record of which has been called for\nby itself or which otherwise comes to its knowledge, the\nHigh Court may, in its discretion,  exercise any of the\npowers conferred on a Court of Appeal by sections 386,\n389, 390 and 391 or on a Court of Session by section\n307,  and,  when  the  Judges  composing  the  Court  of\nRevision are equally divided in opinion, the case shall be\ndisposed of in the manner provided by section 392. \n(2) No order under this section  shall be made to  the\nprejudice of the accused or other person unless he has\nhad an opportunity of being heard either personally or by\npleader in his own defence. \nPage 9 of 19(3) Nothing in this section shall be deemed to authorise a\nHigh  Court  to  convert  a  finding  of  acquittal  into  one\nconviction. \n(4) Where under this Code an appeal lies and no appeal is\nbrought,  no  proceeding  by  way  of  revision  shall  be\nentertained at the instance of the party who could have\nappealed. \n(5)  Where  under  this  Code  an  appeal  lies  but  an\napplication for revision has been made to the High Court\nby any person and the High Court is satisfied that such\napplication was made under the erroneous belief that no\nappeal  lies  thereto  and  that  it  is  necessary  in  the\ninterests of Justice so to do, the High Court may treat the\napplication for revision as a petition of appeal and deal\nwith the same accordingly.”\n11.Sub-section (4) of Section 401 of CrPC states that where\nunder the CrPC an appeal could have been filed and has not been\nfiled, then no proceeding by way of revision could be entertained\nat the instance of the party who could have appealed. This means\nif a State, complainant or the victim who have the right to file an\nappeal do not opt to do so, then the High Court cannot entertain a\nrevision at its behest. Also, if an appeal lies under the CrPC but\nan application for revision has been made to the High Court by\nany person under an erroneous belief, then the High Court can\ntreat the application for revision as petition of appeal and deal\nwith  the  same  accordingly.  What  is  pertinent  is  that  under\nPage 10 of 19Section 401 of CrPC, the High Court is not authorised to convert\nthe  findings  of  acquittal  into  one  of  conviction  by  exercise  of\nrevisional jurisdiction. This salutary principle can be extended to\nalso  mean  that  the  High  Court  cannot  enhance  the  sentence\nimposed by a Trial Court on conviction in an appeal filed by the\naccused/convict. Thus, in sum and substance, it can be observed\nthat in an appeal filed by the accused seeking setting aside of the\nconviction  of  sentence,  the  High  Court  cannot  exercise  its\nrevisional powers and while affirming the conviction direct for\nenhancement of sentence, when actually appeal could have been\nfiled by the State, complainant or the victim and has not been\nfiled. Therefore, where an appeal has been filed by the accused\nchallenging  the  conviction  and  the  sentence,  the  revisional\njurisdiction  cannot  be  exercised  by  the  High  Court  so  as  to\nremand  the  matter  to  the  Trial  Court  for  the  purpose  of\nenhancement of the sentence. However, in this case, our focus of\nattention is whether, in the absence of any appeal or revision filed\nby the State, a complainant or a victim in a particular case and\nwhen the appeal has been filed only by the accused/ convict\nassailing the judgment of conviction and sentence, the High Court\nPage 11 of 19can exercise its revisional jurisdiction to enhance the sentence. In\nother  words,  when  an  accused  is  seeking  setting-aside  of  a\njudgment of conviction and sentence, can the High Court, in the\nabsence of there being any challenge to the same from any other\nquarter,  suo  motu exercise  its  revisional  power  and  thereby\ncondemn  the  accused  by  awarding  an  enhancement  in  his\nsentence.  Even if an opportunity of hearing is given to such an\naccused/convict, we do not think that the High Court can exercise\nits  revisional  jurisdiction  under  Section  401  of  CrPC  while\nexercising  its  appellate  jurisdiction  in  an  appeal  filed  by  the\naccused/convict in the High Court.  All that the High Court can\ndo is to set-aside the judgment of conviction and sentence and\nacquit the accused, or while doing so, order for a retrial, or in the\nalternative, while maintaining the conviction, reduce the sentence.\nIn other words, in an appeal filed only by the accused/convict, the\nHigh Court cannot  suo motu exercise its revisional jurisdiction\nand enhance the sentence against the accused while maintaining\nthe conviction.   In this regard, we find that the expression “but\nnot so as to enhance the same”  in sub-clause (iii) of clause (b) of\nPage 12 of 19Section 386 of CrPC throws some light on the view we have taken,\nwhich reads as under:\n“386. Powers of the Appellate Court. — \nxxx\n(b)in an appeal from a conviction— \nxxx\n(iii) with or without altering the finding, alter the nature\nor the extent, or the nature and extent, of the sentence,\nbut not so as to enhance the same” \nAlthough the said expression “but not so as to enhance the\nsame” is in the context of sub-clause (iii) of clause (b) of Section\n386 of CrPC, the spirit of the said provision must be understood,\ninasmuch as while maintaining the finding of conviction, the High\nCourt cannot exercise its revisional jurisdiction under Section 401\nof CrPC and enhance sentence awarded to the accused/appellant.\n12.In this context, we also observe that the Trial Court should\nalso be very careful while passing an order of sentence inasmuch\nas the sentence imposed must be concomitant with the charge(s)\nframed and the findings arrived at while arriving at a judgment of\nconviction. If the charges are proved beyond reasonable doubt\nagainst an accused, then the sentence following a finding and\nPage 13 of 19judgment of conviction must be appropriate to the nature of the\ncharge(s) which are proved by the prosecution. \n13.In this regard, it must be noted that for exercise of powers of\nthe appellate court for enhancement of sentence in an appeal filed\neither by the State or the complainant or the victim, the CrPC\nprovides  that  the  appellate  court  can  reverse  the  finding  and\nsentence and acquit or discharge the accused, or order him to be\nre-tried  by  a  court  competent  to  try  the  offence,  or  alter  the\nfinding by maintaining the sentence, or with or without altering\nthe finding, alter the nature or the extent, of the sentence so as to\nenhance or reduce the same. Thus, the power to enhance the\nsentence can be exercised by the appellate court only in an appeal\nfiled by the State, victim or complainant, provided the accused\nhas  had  an  opportunity  of  showing  cause  against  such\nenhancement.  It is further provided that the appellate court shall\nnot inflict greater punishment for the offence which in its opinion\nthe accused has committed, than might have been inflicted for\nthat offence by the court passing the order of sentence under\nappeal. Therefore, in an appeal for enhancement of sentence filed\nby the State etc., unless the conditions prescribed in the form of\nPage 14 of 19provisos to Section 386 of CrPC are complied with by the appellate\ncourt, there cannot be an enhancement of sentence.  Obviously in\nsuch an appeal for enhancement of sentence, the convict or the\naccused  is  the  respondent  and  therefore  there  cannot  be\nenhancement of sentence unless the accused or convict has been\nheard.  However, under the scheme of Section 386 of CrPC vis-à-\nvis in an appeal for enhancement of sentence, there can also be\nan acquittal of the accused as per sub-clause (i) of clause (c) of\nSection 386 of CrPC. But, on the other hand, in an appeal from a\nconviction,  it  has  been  expressly  stated  that  there  cannot  be\nenhancement of the sentence. Therefore, while in an appeal for\nenhancement of sentence filed by the State, the accused can make\nout a case for acquittal or discharge or retrial, in the case of an\nappeal from conviction, the respondent in such an appeal, namely\nthe  State  or  the  victim  or  the  complainant,  cannot  seek\nenhancement of the sentence than what has been awarded by the\nTrial Court in the absence of filing any appeal or revision .  The\nabove distinction can be explained by way of a latin maxim which\nhas been discussed by Ujjal Bhuyan, J., while in Bombay High\nPage 15 of 19Court, in Jyoti Plastic Works Pvt. Ltd. vs. Union of India and\nOrs., 2020 OnLine Bom 2276 , in the following words:\n“40.  In  this  connection  we  may  refer  to  the  maxim\nreformatio in peius .  It is a latin phrase meaning a change\ntowards the worse i.e., a change for the worse. As a legal\nexpression  it  means  that  a  lower  court  judgment  is\namended by a higher court into a worse one for those\nappealing  it.  In  many  jurisdictions,  this  practice  is\nforbidden ensuring that an appellant cannot be placed in\na worse position as a result of filing an appeal. When the\nabove phrase is prefixed by the words ‘no’ or ‘prohibition’,\nwhich would render the maxim as no reformatio in peius\nor prohibition of  reformatio in peius ,  it would denote a\nprinciple  of  procedure  as  per  which  using  a  remedy\navailable in law should not aggravate the situation of the\nperson who avails the remedy. In other words, a person\nshould not be placed in a worse position as a result of\nfiling an appeal.  No reformatio in peius or prohibition of\nreformatio in peius is a part of fair procedure and thus by\nextension  can  also  be  construed  as  part  of  natural\njustice. It is not only a procedural guarantee but is also a\nprinciple of equity.”\n(underlining by us)\n14.The  rationale  of  the  above  can  be  explained  in  simple\nlanguage by stating that no appellant by filing an appeal can be\nworse-off than what he was.  That is exactly what we are seeking\nto reiterate in our judgment having regard to the facts of the\npresent case.\n15.In  the  instant  case,  we  find  that  the  appellant/accused\nherein had filed the appeal against the conviction and sentence\nPage 16 of 19imposed by the  Trial Court for the offences punishable under\nSections 354 and 448 of IPC. Insofar as Section 306 of IPC is\nconcerned, the  Trial Court  had acquitted the appellant. Being\naggrieved by the said conviction under Sections 354 and 448 of\nIPC, the appellant had filed the appeal before the High Court.\nNeither the State, nor the victim or complainant had sought for\nenhancement of sentence, or sought for conviction and sentence\nunder  Section  306  of  IPC  before  the  High  Court  when  the\nappellant  had  filed  his  appeal  seeking  setting  aside  of  his\nconviction and sentence. The High Court, instead of considering\nthe  said  appeal  filed  by  the  appellant  on  merits,  sought  to\nexercise  suo motu revisional powers for convicting the appellant\nunder  Section  306  of  IPC  also  and  thereby  sentencing  the\naccused to undergo rigorous imprisonment for five years and to\npay  a  fine  of  Rs.  5,000/-  and  in  default,  to  undergo  simple\nimprisonment  for  three  months.  The  sentences  were  to  run\nconcurrently.  Thus,  a  conviction  awarded  for  offences  under\nSections 354 and 448 of IPC has also resulted in a conviction\nunder Section 306 of IPC and an enhanced sentence, that too, in\nan appeal filed by none other than the appellant. \nPage 17 of 1916.We  are  of  the  view  that  in  an  appeal  filed  by  the\naccused/convict and in the absence of any appeal filed by the\nvictim, complainant or the State, the High Court cannot exercise\nsuo motu revision either to enhance the sentence or to convict the\nappellant on any other charge. The reasons for coming to such a\nconclusion have been discussed above. \n17.In  the  circumstances,  we  set-aside  the  conviction  and\nsentence of the appellant under Section 306 of IPC and confirm\nthe judgment of the Sessions Court as affirmed by the High Court\nqua the offences punishable under Sections 354 and 448 IPC.\nConsequently, the appellant is directed to undergo the sentence\nand to pay the fine as imposed by the Sessions Court. \n In the event the accused has not yet completed the sentence\nimposed by the Trial Court, he is directed to surrender before the\njurisdictional Chief Judicial Magistrate or before the concerned\nPolice Station for being lodged in the jail to suffer the remainder\nof the sentence. In case of failure on the part of the accused to\nsurrender, appropriate action shall be taken up by the concerned\nPolice Station to arrest the accused for being lodged in the jail.\nPage 18 of 19 The appeals are allowed in part in the aforesaid terms. \n……………………………………….J.\n                              (B.V. NAGARATHNA)\n……………………………………….J.\n                                            (SATISH CHANDRA SHARMA)\nNEW DELHI;\nJUNE 04, 2025.\nPage 19 of 19"
}