{
  "filename": "PINTU_THAKUR_@_RAVI_VS._STATE_OF_CHHATTISGARH.pdf",
  "page_count": 5,
  "content": "2025 INSC 797\nNON-REPORTABLE\nIN THE SUPREME COURT OF INDIA\nCRIMINAL APPELLATE JURISDICTION\nCRIMINAL APPEAL NO(S).           /2025\n(Arising out of SLP(Crl.) Nos. 16689-16690/2024)\nPINTU THAKUR @ RAVI ETC.                         APPELLANT(s)\n                           VERSUS\nSTATE OF CHHATTISGARH                           RESPONDENT(s)\n    O R D E R\nLeave granted.\n2.Being aggrieved by the judgment dated 26.04.2024 passed\nin  Criminal  Appeal  No.1686/2023  and  Criminal  Appeal\nNo.2130/2023 passed by the High Court of Chhattisgarh, the\nappellants are before this Court. By the said judgment, the\nappellants were convicted as under:\nConviction Under\nSectionJail Sentence Rigorous Fine In Default of \nPayment of Fine\n363 of the Indian \nPenal Code (for \nshort, the IPC)5 years Rs.500/- 1 month\n366 of the IPC5 years Rs.500/- 1 month\n342 of the IPC1 year\nSection 6 of the \nPOCSO Act, 2012Imprisonment for  life \nwhich shall mean \nimprisonment for the \nremainder of natural \nlifeRs.15,000/- 2 months\nAll the sentences have been directed to run concurrently.\n3.Learned  counsel  for  the  appellants  made  a  two-fold\nsubmission: firstly, he contended that the very conviction of\nthe appellants by the Additional Sessions Judge Fast Track\n1Special Court (POSCO Act) Ramanujganj, District Balrampur in\nSpecial Sessions (POCSO) Case No.36/2020 was erroneous. \n4.Secondly, it was submitted that if this Court is not\ninclined to interfere with the conviction of the appellants\nthen  at  least  the  appeals  could  be  considered  vis-a-vis\nreduction in their sentence having regard to Section 6 of the\nProtection of Children from Sexual Offences Act, 2012 (for\nshort, “POCSO Act”). He contended that the minimum sentence\nunder Section 6 of the POCSO Act is twenty years whereas the\nTrial Court has imposed life imprisonment for the remainder of\nthe natural life which is a harsh punishment. It was submitted\nthat the appellants at the time of the incident were in their\nearly twenties and have completed a little over five years of\nincarceration.  In the circumstances, the appeals filed by the\nappellants may be allowed.\n5.Per contra, learned standing counsel for the respondent-\nState vehemently objected to any of the contentions raised by\nthe appellants herein being accepted. He submitted that the\nHigh Court has rightly affirmed the judgment of conviction\nwhich has been rendered by the Trial Court. Further the\nsentence of life imprisonment which shall be imprisonment for\nthe remainder of natural life is in accordance with Section 6\nof the POCSO Act. Therefore, there is no merit in this appeal.\n6.We have given our anxious consideration to the arguments\nadvanced at the Bar. We are not inclined to interfere with the\n2judgment of conviction passed by the Special Court and which\nhas been affirmed by the impugned order. However, we have\nconsidered the second submission made by the learned counsel\nfor the appellants which is in light of Section 6 of the POCSO\nAct. Section 6 of the said Act reads as under:\n“6. Punishment for aggravated penetrative sexual \nassault.—\nWhoever,  commits  aggravated  penetrative  sexual\nassault, shall be punished with rigorous imprisonment\nfor a term which shall not be less than ten years but\nwhich may extend to imprisonment for life and shall\nalso be liable to fine.”\n7.On a reading of the same, we find that the minimum\npunishment delineated under the said Section is twenty years\nbut which may extend to imprisonment for life which shall mean\nimprisonment for remainder of natural life of the accused and\nshall be liable to fine or with death. The Special Court has\nnot ordered death penalty but has not considered any mitigating\ncircumstance in the instant case, instead the higher punishment\nof life imprisonment for the remainder of natural life of the\nperson has been imposed which has been affirmed by the High\nCourt.\n8.However, the minimum sentence under Section 6 of the\nPOCSO Act is twenty years. Bearing in mind the fact that the\nappellants  herein  were  in  their  early  twenties  when  the\nincident took place and the fact that now they have completed\nonly five years of incarceration and even for completion of the\n3minimum sentence it would mean another fifteen years, we find\nthat the appellants are now in their mid-twenties and even if\nthe minimum sentence is to be completed they would be in their\nearly forties. \n9.We find that the interest of justice would be served in\nthe instant case, if we reduce the sentence imposed on them\nfrom imprisonment for life which shall mean imprisonment for\nthe remainder of natural life to twenty years.\n10.Consequently, we allow the appeals in part by reducing\nthe sentence to twenty years.  \nThe appeals are allowed in part in the aforesaid terms.\nPending application(s), if any, shall stand disposed of.\n  ………………………………………………………, J.\n( B.V. NAGARATHNA )\n    …………………………………………………………, J.\n( SATISH CHANDRA SHARMA )\nNEW DELHI;\nMAY 27, 2025\n4ITEM NO.25                 COURT NO.5                 SECTION II-C\n               S U P R E M E  C O U R T  O F  I N D I A\n                       RECORD OF PROCEEDINGS\nPetition(s) for Special Leave to Appeal (Crl.)Nos.16689-16690/2024\n[Arising out of impugned final judgment and order dated  26-04-2024\nin CRA No. 1686/2023 26-04-2024 in CRA No. 2130/2023 passed by the\nHigh Court of Chhatisgarh at Bilaspur]\nPINTU THAKUR @ RAVI  ETC.                          Petitioner(s)\n                                VERSUS\nSTATE OF CHHATTISGARH                              Respondent(s)\n(IA No. 264176/2024 - EXEMPTION FROM FILING C/C OF THE IMPUGNED \nJUDGMENT\nIA No. 264178/2024 - EXEMPTION FROM FILING O.T.)\n \nDate : 27-05-2025 This matter was called on for hearing today.\nCORAM : \n         HON'BLE MRS. JUSTICE B.V. NAGARATHNA\n         HON'BLE MR. JUSTICE SATISH CHANDRA SHARMA\n(PARTIAL COURT WORKING DAYS BENCH)\nFor Petitioner(s)  Mr. Md. Farman, AOR\n                   Mr. Salman Khan, Adv.\n                   Mr. Aditya Tanwar, Adv.\n                   \nFor Respondent(s)   Mr. Apoorv Shukla, AOR\nMr. Prabhleen A. Shukla, Adv.\n                  \n          UPON hearing the counsel the Court made the following\n                             O R D E R\nLeave granted.\nThe appeals are allowed in part in terms of the\nsigned non-reportable order which is placed on the file.\nPending application(s), if any, shall stand disposed\nof.\n(RADHA SHARMA)                                  (DIVYA BABBAR)\nASTT. REGISTRAR-cum-PS                        COURT MASTER (NSH)\n5"
}