{
  "filename": "UNION_OF_INDIA_VS._M_S_KAMAKHYA_TRANSPORT_PVT._LTD..pdf",
  "page_count": 11,
  "content": "2025 INSC 805\nREPORTABLE\nIN THE SUPREME COURT OF INDIA\nCIVIL APPELLATE JURISDICTION\nCIVIL APPEAL NOS.7376-7379 OF 2025\n(Arising out of SLP(C) Nos.11566-11569/2022)\nUNION OF INDIA   … APPELLANT(S)\nVersus\nM/S KAMAKHYA TRANSPORT\n PVT. LTD. ETC.ETC.                … RESPONDENT(S)\nJ U D G M E N T\nSANJAY KAROL J.\n      Leave granted.\n2.The present appeals arise from the final judgment and\norder dated 20th December 2021 passed by the Gauhati High\nCourt in MFA Nos.80 of 2016, 57 of 2016, 29 of 2017 and 28 of\nC.A. @ SLP (C) No. 11566 – 569 of 2022 Page 1 of 112017 respectively, whereby the order dated 19th January 2016 of\nthe  Railway  Claims  Tribunal,  Guwahati  Bench  in  OA\nNos.229/12, 184/12, 228/12 and 185/2012 respectively came to\nbe affirmed. \nBrief facts\n3.The  brief  facts  giving  rise  to  this  appeal  are  that  the\nAppellant raised demand notices of varied amounts dated 13th\nOctober 2011, 7th April 2012, 29th October 2011, as also 7th April\n2012  respectively  against  the  respondents,  alleging  mis-\ndeclaration of goods; for consignments sent through the Indian\nRailways.  The  respondents  paid  the  demands  raised  and\nthereafter, preferred separate claim petitions under Section 16 of\nthe  Railway  Claims Tribunal  Act, 1987, before  the  Railway\nClaims  Tribunal1,  Guwahati  Bench,  seeking  a  refund  of  the\namount paid.  It was stated therein that the demand notices\nbeing issued after the delivery of the goods were illegal in view\nof Sections 73 and 74 of the Railways Act, 19892. \n4.The Tribunal, allowed the claim petitions vide a common\norder dated 19th January 2016, and directed for refund of the\namount paid in the following manner, along with interest @ 6%\nper annum :\n1 Hereafter “the Tribunal”\n2 Hereafter “the Act”\nC.A. @ SLP (C) No. 11566 – 569 of 2022 Page 2 of 11Claimant (Respondent\nherein)O.A. number Amount refunded\nC.M. Traders 184/12 Rs. 4,47,965/-\nVinayak Logistics 185/12 Rs. 4,97,342/-\nKamakhya Transport Pvt.\nLtd.228/12 Rs. 3,07,902/-\n229/12 Rs. 15,12,959/-\n5. The  Tribunal  placed  reliance  on  the  judgment  of  the\nGauhati High Court in Union of India v. Megha Technical &\nEngineers Pvt. Limited3, whereby the Court had held that a\ndemand under Section 83 of the Act has to be raised before\ndelivery of the goods, to conclude that the Appellant could not\nhave imposed punitive charges, after delivery of goods to the\nconsigner and if such action was required, then the principles of\nnatural justice have to be followed.\n6. Aggrieved  thereof,  the  appellant,  preferred  an  appeal\nbefore  the  High  Court  of  Gauhati,  stating  therein  that  the\nTribunal failed to consider that the consignments were booked\nby declaring the items to be one category, however, the loaded\nitems were found to be different from the category declared. \n7. The High Court, vide its impugned judgment and order,\ndismissed  the appeals of the appellant.  The Court made the\nfollowing observations :\n3 W.A. Nos. 71 – 74 of 2013, Gauhati High Court.\nC.A. @ SLP (C) No. 11566 – 569 of 2022 Page 3 of 11(a)   Both Section 74 of the Act and Rule 1820 of the\nRailway Commercial Manual II, 1991, permit recovery of\ndues before the delivery of goods.\n(b)The scope of Section 83 of the Act has been dealt\nby  this  Court  in  Jagjit  Cotton  Textile  Mills  v.  Chief\nCommercial Superintendent N.R. and Ors.4, wherein it\nwas held that punitive charges are required to be raised by\nthe Railway authorities before delivery is caused. \n(c)From a perusal of Sections 73 and 78 of the Act, it\nis revealed that penal charges can be claimed prior to the\ndelivery of goods, but not thereafter.\n8.Dissatisfied,  the  appellant-Railway  authorities are  now\nbefore  us.   We  have  heard  the  learned  Additional  Solicitor\nGeneral  for  the  appellant  and  the  learned  counsel  for  the\nrespondents. \nCase of the Appellant - Railway Authorities\n9.The significant point raised by the appellant is that the\nCourts below have erroneously treated the dispute at hand, as\none dealing with overloading of the wagon which is governed\nby Section 73 of the Act.  Meanwhile, the case of the appellant\nis that the consignments were found to be different, from what\n4 (1998) 5 SCC 126.\nC.A. @ SLP (C) No. 11566 – 569 of 2022 Page 4 of 11had been declared, and, consequently, the appellant imposed a\npenalty under Section 66 of the Act.\n10.  Furthermore, the High Court’s reliance on  Jagjit Cotton\nTextile (supra), is erroneous, since the factual matrix of that\ncase pertained to overloading of the wagon and right to lien.\nMoreover, the High Court has failed to take into consideration,\nthe plain language of Section 83, which permits detainment of\ngoods after delivery. \nCase of the Respondents\n11.We have perused the written submissions filed by the\nrespondents.  The significant point raised by the respondents is\nthat since the demand notices were raised after the delivery of\ngoods, Section 66 of the Act would not be applicable, and the\nCourts below have rightly held in favor of the Respondents. \nIssue for consideration\n12.In  the  attending  facts  and  circumstances,  the  question\nwhich arises for consideration before this Court is whether the\nCourts  below  have  rightly  held  that  the  Railway  authorities\ncould not have raised the demand notice after the delivery of\ngoods. \nC.A. @ SLP (C) No. 11566 – 569 of 2022 Page 5 of 11Our view\n13.As per the appellant - the Railway authorities, Section 66\nis applicable which is found in Chapter IX of the Act, which\nseeks to regulate the carriage of goods. Section 66 reads as\nfollows:\n“66.  Power  to  require  statement  relating  to  the\ndescription of goods. — \n(1) The owner or a person having charge of any goods\nwhich are brought upon a railway for the purposes of\ncarriage by railway, and the consignee or the endorsee\nof any consignment shall, on the request of any railway\nservant authorised in this behalf, deliver to such railway\nservant a statement in writing signed by such owner or\nperson or by such consignee or endorsee, as the case\nmay be, containing such description of the goods as\nwould enable the railway servant to determine the rate\nfor such carriage. \n(2) If such owner or person refuses or neglects to give\nthe  statement  as  required  under  sub-section  (1)  and\nrefuses to open the package containing the goods, if so\nrequired by the railway servant, it shall be open to the\nrailway administration to refuse to accept such goods\nfor carriage unless such owner or person pays for such\ncarriage the highest rate for any class of goods. \n(3) If the consignee or endorsee refuses or neglects to\ngive the statement as required under sub-section (1) and\nrefuses to open the package containing the goods, if so\nrequired by the railway servant, it shall be open to the\nrailway  administration  to  charge  in  respect  of  the\ncarriage of the goods the highest rate for any class of\ngoods. \nC.A. @ SLP (C) No. 11566 – 569 of 2022 Page 6 of 11(4)  If the statement delivered under sub-section (1) is\nmaterially false with respect to the description of any\ngoods  to  which  it  purports  to  relate,  the  railway\nadministration may charge in respect of the carriage of\nsuch goods such rate, not exceeding double the highest\nrate for any class of goods as may be specified by the\nCentral Government . \n(5) If any difference arises between a railway servant\nand  such  owner  or  person,  the  consignee  or  the\nendorsee,  as  the  case  may  be,  in  respect  of  the\ndescription of the goods for which a statement has been\ndelivered  under  sub-section  (1),  the  railway  servant\nmay detain and examine the goods. \n(6) Where any goods have been detained under sub-\nsection (5) for examination and upon such examination\nit is found that the description of the goods is different\nfrom that given in the statement delivered under sub-\nsection (1), the cost of such detention and examination\nshall be borne by such owner or person, the consignee\nor the endorsee, as the case may be, and the railway\nadministration shall not be liable for any loss, damage\nor deterioration which may be caused by such detention\nor examination.” \n(Emphasis supplied)\n14.It  is borne  from  the  above  that  a  consignee/owner  of\ngoods/person having charge of goods who has brought goods\nfor the purpose of carriage has to give the Railway authorities a\nwritten  statement  regarding  the  description  of  the  goods,  to\nenable them to charge the appropriate rate of carriage.  Under\nsub-section (4), if the statement is found to be materially false,\nthe Railway authority is empowered to charge the goods at the\nC.A. @ SLP (C) No. 11566 – 569 of 2022 Page 7 of 11required rate.  No reference is made to the stage at which such a\ncharge  can  be  made,  i.e.,  either  before  or  after  delivery.\nConsequently, it can be seen that the legislative intent had to be,\nto permit levy of charge under this Section, at either stage and\nnot at a specific one. \n15.Meanwhile, the High Court has considered Sections 73\nand 78 of the Act, relating to the overloading of the wagon.\nThey read as follows :\n“73. Punitive charge for overloading a wagon.—Where\na person loads goods in a wagon beyond its permissible\ncarrying capacity as exhibited under sub-section (2) or\nsub-section (3), or notified under  sub-section (4), of\nsection 72, a railway administration may, in addition to\nthe  freight  and  other  charges,  recover  from  the\nconsignor, the consignee or the endorsee, as the case\nmay be, charges by way of penalty at such rates, as may\nbe prescribed, before the delivery of the goods : \nProvided  that  it  shall  be  lawful  for  the  railway\nadministration to unload the goods loaded beyond the\ncapacity of the wagon, if detected at the forwarding\nstation or at any place before the destination station and\nto recover the cost of such unloading and any charge\nfor the detention of any wagon on this account.\n.....\n78. Power to measure, weigh, etc.—Notwithstanding\nanything contained in the railway receipt, the railway\nadministration  may,  before  the  delivery  of  the\nconsignment,  have  the  right  to—  (i) re-measure,  re-\nweigh or re-classify any consignment; (ii) re-calculate\nthe freight and other charges; and (iii) correct any other\nerror or collect any amount that may have been omitted\nto be charged.”  \nC.A. @ SLP (C) No. 11566 – 569 of 2022 Page 8 of 11(Emphasis supplied)\n16.We  have  perused  the  demand  notices  annexed  as\nAnnexure P-1 dated 13th October, 2011, Annexure P-2 dated 29th\nOctober,  2011,  Annexure  P-3  dated  7th April,  2012  and\nAnnexure P-4 dated 7th April, 2012.  It is evident from the\ncontents thereof that the demand was raised for misdeclaration\nby  the  respondents.   No  reference  has  been  made  to  the\noverloading of wagon, to which Section 73 applies. More so,\neven the claim petitions do not propose that the demand notices\nhave been for the overloading of  wagon. T herefore, in our\nview, Section 66 applies to the present lis. \n17.Furthermore, we are not inclined to accept the submission\nof  the  respondents  that  the  demand  notices  annexed  to  the\npetition are not genuine in nature.  No evidence has been led to\nthat effect and, more over, the claim petitions are silent on such\naverments.   Therefore,  in  the  absence  of  evidence  to  the\ncontrary,  we  are  inclined  to  find  the  demand  notices  to  be\ngenuine.  \n18.Before parting with the appeals at hand, we notice that\nthe High Court has held that penal charges can only be applied\nprior to the delivery of goods on the basis of the exposition in\nJagjit Cotton Textile  (supra). The respondents have also placed\nreliance on the same judgment to submit that penal charges can\nC.A. @ SLP (C) No. 11566 – 569 of 2022 Page 9 of 11be imposed only prior to the delivery of goods. We find such an\napproach  to  be  erroneous  and  not  in  furtherance  of  the\nexposition  in  Jagjit  Cotton  Textile  (supra).   The  relevant\nparagraph, as relied upon by the respondents, is as follows :\n“22.  Again  Section  54(1)  states  that  the  Railway\nAdministration may impose conditions not inconsistent\nwith the Act or with any general rules made thereunder,\n“with respect to the receiving, forwarding or delivery of\nany animal or goods”. In our view one such “condition”\ncould  be  by  directing  that  penal  charges  could  be\ncollected before delivering the goods.”\n19.From a perusal of the above, it is clear that when this\nCourt observed “ one such ‘condition’ could be by directing that\npenal charges could be collected before delivering the goods ”,\nit was a suggestion, to explain the conditions that could be\nimposed by the Railway Administration under Section 54(1).\nMoreover, the above exposition in Jagjit Cotton Textile  (supra),\nwas made in the context of Section 54 only, while the facts of\nthis case pertain to Section 66 of the Act.\n20. In view of the above, the impugned order dated 20th\nDecember, 2021 passed by the Gauhati High Court in MFA\nNos.80 of 2016, 57 of 2016, 29 of 2017 and 28 of 2017, is\nhereby set aside.  In the attending facts and circumstances of\nthis case, the civil appeals are allowed. \nC.A. @ SLP (C) No. 11566 – 569 of 2022 Page 10 of 11Pending applications, if any, shall stand disposed of. \n                                      ……………………………………J.\n(SANJAY KAROL)\n……………….…………………..J.\n(PRASHANT KUMAR MISHRA)\nNew Delhi;\n5th June, 2025\nC.A. @ SLP (C) No. 11566 – 569 of 2022 Page 11 of 11"
}