{
  "filename": "AMLESH_KUMAR_VS._THE_STATE_OF_BIHAR.pdf",
  "page_count": 17,
  "content": "2025 INSC 810\nCrl.A.@ SLP (Crl.) No.5392 /2024    Page 1 of 17 REPORTABLE  \n \nIN THE SUPREME COURT OF INDIA  \nCRIMINAL APPELLATE JURISDICTION  \n \nCRIMINAL APPEAL NO. __   __ OF 2025  \n(Arising out of SLP(Crl.) No.5392  of 2024)  \n \nAMLESH KUMAR        …   APPELLANT(S)  \n \nVersus  \n \nTHE STATE OF  BIHAR                        … RESPONDENT(S)  \n \n \nJ U D G M E N T  \n \n \nSanjay Karol, J.  \n \n           Leave Granted.  \n2. The present Appeal arises from the impugned Order dated 9th \nNovember 2023 passed in Criminal Miscellaneous No.71293 of \n2023 by the High Court of Judicature at Patna , whereby the Court Crl.A.@ SLP (Crl.) No.5392 /2024    Page 2 of 17 accepted the submission of the Sub -Divisional Police Officer, \nMahua, that she would conduct narco -analysis test of all the accused \npersons ( including the Appellant herein ) and other witnesses, during \nthe investigation.  \n3. Aggrieved thereof, the Appellant is before us. The significant \nground of challenge taken is that the acceptance of such a \nsubmission by the High Court is in direct contravention of the \nexposition of law laid down by this Court in Selvi and Ors. v. State \nof Karnataka1, wherein it was observed that forceful subjection of \nan individual to techniques, such as the narco -analysis test, violates \npersonal liberty enshrined under Article 21 of the Constitution  of \nIndia . \n4. The brief facts giving rise to the Appeal at hand are as \nfollows:  \n4.1. On 24th August 2022, FIR No.545 of 2022 was registered \nat P.S. Mahua under Sections 341, 342, 323, 363, 364, \n498(A), 504 , 506 and 34  of the Indian Penal Code, 18602, \nagainst the Appellant (husband) and his family. It was \nstated by the complainant therein that her sister got \nmarried to the Appellant on 11th December 2020, and \n \n1 (2010) 7 SCC 263.  \n2 Hereinafter ‘IPC’ . Crl.A.@ SLP (Crl.) No.5392 /2024    Page 3 of 17 thereafter, the accused persons had been making repeated \ndemands for dowry and beating her. On 22nd August 2022, \nshe received a call from the Appellant, informing  that her \nsister had run away from the matrimonial home. Despite \nsearching, she is unable to locate her sister and suspects \nfoul play by the accused persons  (including the \nAppellant) . \n4.2. The case of the Appellant is that on 21st August 2022, \nwhile en route to Ayodhya, his wife got off the bus at \nBaabali Chaw k for nature’s call but never returned. He \nfiled a complaint before P.S. Jahangir Ganj, recorded as \nGD No. 038 , on 28th August 2022 .  \n4.3. The admitted position is that the missing person (wife) has \nnot been found to date. The mother, father and brothers of \nthe Appellant have been granted bail by the High Court of \nJudicature at Patna.  \n4.4. The Appellant's prayer for regular bail came to be rejected \nvide Order dated 1st August 2023 passed by the Sessions \nJudge, Vaishali at Hajipur in B.P.No .1141 of 2023. The \nCourt was not inclined to grant bail on the basis of the \nallegations made in the FIR, as well as the confessional Crl.A.@ SLP (Crl.) No.5392 /2024    Page 4 of 17 statements of the co -accused, who stated that they had \nthrown the missing person in the river Saryu on the \nintervening night of the 21st and 22nd August 2022.  \n4.5. Dissatisfied with the Order of the Sessions Judge, the \nAppellant approached the High Court of Judicature at \nPatna for grant of a regular bail vide Crl. Misc. No.71293 \nof 2023. Vide the impugned interim Order, the High Court \naccepted the submission of the Sub -Divisional Police \nOfficer, Mahua, that she will conduct a narco -analysis test \nof all the accused persons and posted the case for hearing \non 12th July 2024. The relevant portion thereof is extracted  \nbelow , for ready reference  : \n“2. Pursuant to the order dated 07.11.2023, the \nSubDivisional Police Officer, Mahua and the \nS.H.O. Mahua are present in the court.  \n \n3. The S.D.P.O. Mahua, assures this court that she \nwill take further steps in the investigation to find \nout details about the missing woman and for that \nshe has further submitted that she will get narco \ntest of all the accused persons and other witnesses , \nif required in the investigation.  \n \n4. List this case on 12.07.2024.  \n \n5. On the next date of hearing, the investigation \nreport shall be produced by the learned APP .” \n(Emphasis supplied)  \n Crl.A.@ SLP (Crl.) No.5392 /2024    Page 5 of 17 4.6. Aggrieved thereof, the Appellant has preferred the present \nAppeal before this Court.  \n \n5. We have heard the learned counsel for the Appellant and the \nlearned Addl. Standing Counsel on behalf of the Respondent State. \nAfter hearing the parties in part, v ide Order dated 22nd April 2025, \nthis Court appointed Mr. Gaurav Agrawal, Senior Advocate, as  an \nAmicus Curiae  to assist the Court , given the issues involved . We \nhave heard the learned Amicus  Curiae  and the learned counsel for \nthe parties as also  perused the written submission s filed.  \n6. Consequently, the issues which arise for consideration of this \nCourt are  : \ni. Firstly, whether in the attending facts and circumstances, \nthe High Court could have accepted such a submission.  \nii. Secondly, whether a report of a voluntary  narco -analysis \ntest can form the sole basis of conviction in the absence of \nother evidence on record.  \niii. Lastly, whether an accused can volunta rily seek a narco -\nanalysis test, as a matter of an indefeasible right . \n7. For the purposes of clarity, a narco -analysis test is an \ninterrogation method whereby a suspect of a crime is injected with Crl.A.@ SLP (Crl.) No.5392 /2024    Page 6 of 17 a psychoactive drug under controlled conditions to suppress their \nreasoning power or the ability to determine what is good/bad for \nthemselves.3  As submitted by the learned Amicus  Curiae , the drug \nused for this test is sodium pentothal, which is also used in higher \ndosages for inducing general anesthesia  in surgeries.   \n8. However, conducting such tests on persons accused of \ncommitting a crime raises serious questions , vis-à-vis, the \nconstitutional protection granted from compulsion to become a \nwitness against oneself under Article 20(3). The constitutional \nvalidity of this test , along with similar tests like the polygraph test , \ncame to be challenged before this Court in Selvi  (supra) . After an \nelaborate discussion, this Court (three -Judge Bench) held \ninvoluntary administration of this test to be hit by Articles 20(3)  and \n21 of the Constitution . The following principles came to be \nexpounded:  \n8.1. Articles 20 and 21 of the Constitution are non -derogable  \nand sacrosanct  rights to which the judiciary cannot carve \nout exceptions ;  \n8.2. Involuntary administration of narco -analysis and similar \ntests is in contravention of the protection given by Article \n \n3 B R Sharma, Forensic Science in Criminal Investigation & Trials, Sixth Edition, 2020 – \nParagraph 32.1.1.  Crl.A.@ SLP (Crl.) No.5392 /2024    Page 7 of 17 20(3) of the Constitution, i.e. the right against self -\nincrimination ; \n8.3. The results of such involuntary tests cannot be considered \nas ‘material evidence’ in the eyes of the law ; \n8.4. Conducting such tests in the absence of consent violates \n‘substantive due process’ – which is an essential element \nrequired for restraining one’s personal liberty.  Permitting \nsuch tests may lead to a disproportionate exercise of police \npowers ;   \n8.5. The boundaries of privacy of a person are also breached \nwhen these tests are conducted without consent ; and \n8.6. For voluntary tests, it must be ensured that appropriate \nsafeguards are in place. Moreover, the results of the same \ncannot be admitted directly as evidence. Pertinently, any \nfact or information  that is discovered subsequent thereto , \nwith the help of the information supplied in the result, can \nbe admitted into evidence with the aid of Section 27 of the \nIndian Evidence Act 1872.  \n9. From the above exposition of law, it is clear that under no \ncircumstances , is an involuntary or forced narco -analysis test \npermissible under law. Consequently, a report of such involuntary Crl.A.@ SLP (Crl.) No.5392 /2024    Page 8 of 17 test or information that is discovered subsequently is also not per se  \nadmissible as evidence in criminal or other proceedings.  \n10. Adverting to the facts at hand, we cannot find a reason in the \nHigh Court accepting a submission by the Investigating Officer, \nstating that they will conduct a narco -analysis test of all the accused \npersons. Such a submission and its acceptance , is in direct \ncontravention to the judgment of this Court in Selvi (supra),  being \nhit by the protections under Articles 20(3) and 21 of the \nConstitution.  \n11. Moreover, we fail to understand how such an endeavour was \naccepted by the High Court when adjudicating an application for \nregular bail under Section 439 of the Code of Criminal Procedure, \n1973 . It is settled law that while entertaining an application for grant \nof bail, the Court has to take into consideration the allegations \nagainst the accused; period of custody undergone; nature of \nevidence and the crime in question; likelihood of influencing \nwitnesses an d other such relevant grounds. It does not involve \nentering into a roving enquiry or accepting the use of involuntary \ninvestigative techniques. In similar circumstances, where the High \nCourt had ordered lie detector, brain mapping and narco -analysis Crl.A.@ SLP (Crl.) No.5392 /2024    Page 9 of 17 tests, this Court in Sangitaben Shaileshbhai Datana v. State of \nGujarat4, observed  : \n“6. Having heard the counsel for the parties, it is \nsurprising to note the present approach adopted by the \nHigh Court while considering the bail application. The \nHigh Court ordering the abovementioned tests is not \nonly in contravention to the first principle s of criminal \nlaw jurisprudence but also violates statutory \nrequirements. While adjudicating a bail application, \nSection 439 of the Code of Criminal Procedure, 1973 is \nthe guiding principle wherein the court takes into \nconsideration, inter alia, the gravit y of the crime, the \ncharacter of the evidence, position and status of the \naccused with reference to the victim and witnesses, the \nlikelihood of the accused fleeing from justice and \nrepeating the offence, the possibility of his tampering \nwith the witnesses and obstructing the course of justice \nand such other grounds. Each criminal case presents its \nown peculiar factual matrix, and therefore, certain \ngrounds peculiar to a particular case may have to be \ntaken into account by the court. However, the court has \nto only opine as to whether there is a prima facie case \nagainst the accused . The court must not undertake \nmeticulous examination of the evidence collected by the \npolice, or rather order specific tests as done in the present \ncase. \n \n7. In the instant case, by ordering the abovementioned \ntests and venturing into the reports of the same with \nmeticulous details, the High Court has converted the \nadjudication of a bail matter to that of a mini trial indeed. \nThis assumption of function of a trial court by the High \nCourt is deprecated. ” \n(Emphasis supplied)  \n \n4 (2019) 14 SCC 522.  Crl.A.@ SLP (Crl.) No.5392 /2024    Page 10 of 17  \n12. We are not inclined to accept the submission of the \nRespondent - State that since modern investigative techniques are \nthe need of the hour , the High Court was correct in accepting the \nsubmission that narco -analysis test of all accused persons will be \nconducted. While the need for modern investigative techniques  may \nbe true, such investigative techniques cannot be conducted at the \ncost of constitutional guarantees under Articles 20(3) and 21.   \n13. Therefore, the first question framed is answered in the \nnegative. The High Court has erred in accepting a submission to \ncarry out a narco -analysis test of all accused persons by the \nInvestigating Officer.   \n14. In the course of proceedings, the issue of undergoing a narco -\nanalysis test voluntarily came to be raised, which brings us to the \nsecond question framed. As discussed above, this Court in Selvi \n(supra)  had considered voluntary narco -analysis tests and opined \nthat the reports thereof cannot be admitted directly into evidence. \nInformation that is discovered, as a consequence thereof, can be \nadmitted with the aid of Section 27 of the Indian Evidence Act, \n1872.  Crl.A.@ SLP (Crl.) No.5392 /2024    Page 11 of 17 15. The evidentiary value of information received through the aid \nof Section 27 is no longer res integra . This Court in Vinobhai v. \nState of Kerela5, while placing reliance on Manoj Kumar Soni v. \nState of M.P.6 held that in the absence of supporting evidence, a \nconviction cannot be based solely on such information. It was \nobserved:  \n“8.  ….. The law relating to the evidentiary value of \nrecovery made under Section  27 of the  Indian Evidence \nAct, 1872  is settled by this Court in the case of  Manoj \nKumar Soni  v. State of M.P. . Paragraph 22 of the said \ndecision reads thus: — \n \n“22. A doubt looms :  can disclosure \nstatements  per se , unaccompanied by any \nsupporting evidence, be deemed adequate to \nsecure a conviction? We find it \nimplausible.  Although disclosure statements \nhold significance as a contributing factor in \nunriddling a case, in our opinion, they are \nnot so strong a piece of evidence sufficient on \nits own and without anything more to bring \nhome the charges beyond reasonable \ndoubt.”  \nTherefore, in our view, the appellant's guilt was not \nproved beyond a reasonable doubt.”  \n16. Consequently, in our view, a report of a voluntary narco -\nanalysis test with adequate safeguards as well in place, or \n \n5 2025 SCC Online SC 178.  \n6 2023 SCC OnLine SC 984.  Crl.A.@ SLP (Crl.) No.5392 /2024    Page 12 of 17 information found as a result thereof, cannot form the sole basis of \nconviction of an accused person. The second question is, therefore, \nanswered in the negative.  \n17. Adverting to the last question framed, the learned Amicus \nCuriae has pointed out that there has been a divergence of views \ntaken by High Courts on the issue as to whether a narco -analysis test \ncan be claimed by an accused as a matter of right. Given the suspect \nnature of a report of narco -analysis, the  Amicus  Curiae submitted \nthat this position must be clarified.  \n18. On the one hand, there is High Court of Judicature at \nAllahabad  in Rajesh Talwar v. CBI7; High Court of Bombay  in \nDominic Luis v. State8 and Mohd. Samir v. State9; High Court of \nDelhi  in Ashwini Kumar Upadhyay v. Union of India10; High Court \nof Kerala  in Louis v. State of Kerala11; High Court of Gujarat in \nState of Gujarat v. Sanjay Kumar Kanchanlal Desai12 and High \nCourt of Punjab & Haryana  in Navjeet Kaur v. State of Punjab13, \nhave held that an involuntary narco -analysis test cannot be relied on \n \n7 2013 SCC Online All 5533 .  \n8 2014 SCC Online Bom 452 . \n9 2017 SCC Online Bom 19 . \n10 2023 SCC Online Del 3816 . \n11 2021 SCC Online Ker 4519 . \n12  2014 SCC Online Guj 6150 . \n13 2015 SCC Online P&H 15351 . Crl.A.@ SLP (Crl.) No.5392 /2024    Page 13 of 17 and have taken an overall view of the circumstances when an \naccused has sought a narco -analysis test himself.  \n19. On the other hand, there is Rajasthan High Court , which  in \nSunil Bhatt v. State14, held that the accused can seek a narco -\nanalysis test at a relevant stage in view of the statutory right to lead \nevidence in defence under Section 233 of the Criminal Procedure \nCode.  \n20. In our view, as rightly submitted by the learned Amicus , the \nabove view of the Rajasthan High Court cannot be sustained. It \ncannot be said that undergoing a narco -analysis test is part of the \nindefeasible right to lead evidence , given its suspect nature, and \nmoreover, we find the same  to be in the teeth of the judgment of  this \nCourt in Selvi  (supra) . It had been categorically observed:  \n“240. We must also contemplate situations where a \nthreat given by the investigators to conduct any of the \nimpugned tests could prompt a person to make \nincriminatory statements or to undergo some mental \ntrauma. Especially in cases of individuals from weaker \nsections of society who are unaware of their fundamental \nrights and unable to afford legal advice, the mere \napprehension of undergoing scientific tests that \nsupposedly reveal the truth could push them to make \nconfessional statements. Hence, the act of threaten ing to \nadminister the impugned tests could also elicit \ntestimony. It is also quite conceivable that an individual \nmay give his/her consent to undergo the said tests on \n \n14 2022 SCC Online Raj 1443 . Crl.A.@ SLP (Crl.) No.5392 /2024    Page 14 of 17 account of threats, false promises or deception by the \ninvestigators. For example, a person may be convinced \nto give his/her consent after being promised that this \nwould lead to an early release from custody or dropping \nof charges. However, after the admin istration of the \ntests, the investigators may renege on such promises. In \nsuch a case the relevant inquiry is not confined to the \napparent voluntariness of the act of undergoing the tests, \nbut also includes an examination of the totality of \ncircumstances.  \n \n253. . We are of the view that an untrammelled right of \nresorting to the techniques in question will lead to an \nunnecessary rise in the volume of frivolous litigation \nbefore our courts.  \n \n264. In light of these conclusions, we hold that no \nindividual should be forcibly subjected to any of the \ntechniques in question, whether in the context of \ninvestigation in criminal cases or otherwise. Doing so \nwould amount to an unwarranted intrusion into pe rsonal \nliberty. However, we do leave room for the voluntary \nadministration of the impugned techniques in the context \nof criminal justice, provided that certain safeguards are \nin place. Even when the subject has given consent to \nundergo any of these test s, the test results by themselves \ncannot be admitted as evidence because the subject does \nnot exercise conscious control over the responses during \nthe administration of the test . However, any information \nor material that is subsequently discovered with the help \nof voluntary administered test results can be admitted in \naccordance with Section 27 of the Evidence Act, 1872.”  \n \n(Emphasis supplied)  \n \n21. In view of the above exposition in Selvi  (Supra ), the third \nquestion is answered in the following terms :  Crl.A.@ SLP (Crl.) No.5392 /2024    Page 15 of 17           The accused has a right to voluntarily undergo a narco -\nanalysis test at an appropriate stage. We deem it appropriate to add, \nthat the appropriate stage for such a test to be conducted is when the \naccused is exercising his right to lead evidence in a trial.  However, \nthere is no indefeasible right with the accused to undergo a narco -\nanalysis test , for upon receipt of such an application the concerned \nCourt , must consider the totality of  circumstances surrounding t he \nmatter, such as free consent, app ropriate safeguards etc.,  authori zing \na person to undergo a voluntary  narco -analysis test. We deem it \nappropriate to reproduce and reiterate the guidelines issued in Selvi  \n(Supra ) in this regard  as follows :  \n“265. The National Human Rights Commission had  \npublished  Guidelines for the Administration of \nPolygraph Test (Lie Detector Test) on an Accused  in \n2000. These Guidelines should be strictly adhered to \nand similar safeguards should be adopted for \nconducting the “narcoanalysis technique” and the \n“Brain Electrical Activation Profile” test. The text of \nthese Guidelines has been reproduced below:   \n(i) No lie detector tests should be administered except \non the basis of consent of the accused. An option \nshould be given to the accused whether he wishes to \navail such test.  \n(ii) If the accused volunteers for a lie detector test, he \nshould be given access to a lawyer and the physical, \nemotional and legal implication of such a test should \nbe explained to him by the police and his lawyer.  \n(iii) The consent should be recorded before a Judicial \nMagistrate.  Crl.A.@ SLP (Crl.) No.5392 /2024    Page 16 of 17 (iv) During the hearing before the Magistrate, the \nperson alleged to have agreed should be duly \nrepresented by a lawyer.  \n(v) At the hearing, the person in question should also \nbe told in clear terms that the statement that is made \nshall not be a “confessional” statement to the \nMagistrate but will have the status of a statement made \nto the police.  \n(vi) The Magistrate shall consider all factors relating to \nthe detention including the length of detention and the \nnature of the interrogation.  \n(vii) The actual recording of the lie detector test shall \nbe done by an independent agency (such as a hospital) \nand conducted in the presence of a lawyer.  \n(viii) A full medical and factual narration of the manner \nof the information received must be taken on record. ” \n \n22. Before parting with this appeal, we place on record our \nappreciation for the learned Amicus  Curiae , Mr. Gaurav Agrawal, \nSenior Advocate , in extending his invaluable assistance  to the Court . \n23. Keeping in view  the above discussion, we have no doubt that \nthe impugned Order cannot be sustained. Consequently,  the \nimpugned Order dated 9th November 2023 passed in Criminal \nMiscellaneous No. 71293 of 2023 by the High Court of Judicature \nat Patna is  hereby  set aside.   \n24. The bail application of the Appellant, pending if any, to be \ndecided in accordance with law.  Crl.A.@ SLP (Crl.) No.5392 /2024    Page 17 of 17 25. In the attending facts and circumstances of this case, the \nAppeal is allowed.   \n           Pending application (s), if any, shall stand  disposed of.  \n \n \n………… ........... …………J.  \n(SANJAY KAROL)  \n \n \n \n…… ……… ………………J.  \n(PRASANNA B. VARALE)  \n \n9th June , 2025 ; \nNew Delhi ."
}