{
  "filename": "AMOL_BHAGWAN_NEHUL_VS._THE_STATE_OF_MAHARASHTRA.pdf",
  "page_count": 13,
  "content": "2025 INSC 782\nSLP (Crl.) No. 10044 of 2024   Page 1 of 13 \n REPORTABLE  \n \nIN THE SUPREME COURT OF INDIA  \nCRIMINAL APPELLATE JURISDICTION  \n \nCRIMINAL  APPEAL NO.                OF 2025  \n[Arising out of SLP (C rl.) No. 10044 of 2024]  \n \nAMOL BHAGWAN NEHUL                    …APPELLANT(S)  \n \nVERSUS  \n \nTHE STATE OF MAHARASHTRA  \n& ANR.           …RESPONDENT (S)  \n \nJ U D G M E N T  \n \nSATISH CHANDRA SHARMA, J.  \n \n1. Leave granted.  \n2. This Appeal by special leave is directed against the \nImpugned Order dt. 28.06.2024 passed by the High Court of \nJudicature at Bombay in Crl. W.P. No. 3181 of 2023  whereby the  \nPetition u/s 482 of the Code of Criminal Procedure, 1973  \n(‘CrPC’ ) seeking quashing  of the Criminal Case C.R. No. SLP (Crl.) No. 10044 of 2024   Page 2 of 13 \n 490/2023 dt. 31.07.2023 for offences punishable u/s 376, \n376(2)(n), 377, 504 & 506 of the Indian Penal Code (hereinafter \n“IPC”) registered at Karad  Taluka Police Station, Satara qua the \nAppellant was dismissed.  Vide an amendment to the Petition, the \nAppellant also challenged the chargesheet filed on 26.09.2023 \nand the proceedings in RCC no. 378/2023 pending before the \nAdditional Sessions Judge, Karad.  \n3. The Criminal Case C.R. No. 490/2023 dt. 31.07.2023 at \nPolice Station  Karad Taluka , Dist . Satara was registered at the \nbehest of a Complaint filed by the Complainant/Respondent        \nno. 2 alleging that during the period 08.06.2022 till 08.07.202 3, \nthe Appellant forcibly had  sexual intercourse with her on the false \nassurance of marriage. The Complainant/Respondent no.  2 who \nhad been previously married, had obtained Khulanama  from her \nex-husband and had been residing with her 4 -year-old son at her \nparental home in Kalegaon, Karkad Dist  since 2021 ; while t he \nAppellant , a 23-year-old student of Bachelor of Science \n(Agriculture) at Krishna College of Agric ulture, Re thre BK, \nTaluka Karad District, Satara  was residing as a tenant next door , \nwith three other men since 25.05.2022. The sequence of events as \nrecorded in the  FIR 490/2023 dt. 31.07.2023  are as under:  \n3.1 The parties became acquainted on 08.06.2022, \nwhich turned into a friendship and they  soon  began \ninteracting more frequently. The relationship blossomed into SLP (Crl.) No. 10044 of 2024   Page 3 of 13 \n love, but it is stated  that the Complainant/Respondent no.  2 \nrepeatedly denied to make physical relations with the \nAppellant .  \n3.2 It is alleged  the case of the Complainant that in July \n2022, the Appellant had entered the house  of the \nComplainant/Respondent no.  2 at night, and said that  once \nshe obtains divorce from her husband, the Appellant would \ninstantly marry her and on this pretext had sexual intercourse \nwith her, despite her denial . It is stated  that since then, the \nparties continued meeting outside and having meals \ntogether ; however later on 21.09.2022 on the occasion of the \nAppellant’s birthday, when the Complainant/Respondent \nhad visited the Rajyog L ounge , Varunji Phata, Airport \nKarad , the Appellant  again  had sexual intercourse with her \non the assurance of marriage. Thereafter,  the Appellant \nallegedly  borrowed money from the \nComplainant/Respondent no.2 on various  occasions  & used \nher car, Hyundai Verna No. MH -12-HZ-9559 for his \npersonal use.  \n3.3 In January 2023, the parties visited Pushkar Lodge, \nOgalewadi, Kar ad, where the Appellant told the \nComplainant that he had not informed his family about their \nrelationship , however , he would marry her once her divorce \nwas finalized. Allegedly, despite her objection, the Appellant SLP (Crl.) No. 10044 of 2024   Page 4 of 13 \n on this assurance of marriage, again had sexual intercourse \nwith the Complainant/Respondent no.  2 and there is a \nspecific allegation that he committed unnatural sex with her.  \nIt is alleged that soon thereafter, the Appellant had reduced \nhis interactions with the Complainant/Respondent no. 2, did \nnot answer her phone  calls and left for his hometown at \nAhmednagar .  \n3.4 On 08.07.2023, t he Complainant/Respondent no.  2 \nvisited his native village in Ahmednagar and met his parents  \nand other relatives, who refused to marry the Appellant with \nComplainant/Respondent no. 2  as they belonged to different \nreligions. Allegedly, when  the Complainant refused to leave, \nthe parents of the Appellant , his brother and his uncle pushed \nher aside by beating and abusing her . The Complaint dt. \n31.07.2023 was registered  after 23 days  of the alleged \nincident at PS Taluka Karad, Dist. Satara .   \n4. The Appellant  on the other hand,  has narrated the sequence \ndifferently,  stating that during the alleged period of incidence, \nwhen he  had been assigned a program at Village Kalegaon, Tq. \nKarad. Dist. Satara for five months , he became  acquainted with \nthe Complainant/Respondent no.  2 as his neighbor. The Appellant \nhas denied the allegations of  havin g forced sexual intercourse \nwith the Complainant/Respondent no.  2 on the assurance of \nmarriage, and stated that  it was in-fact the SLP (Crl.) No. 10044 of 2024   Page 5 of 13 \n Complainant/Respondent no.  2 who had approach ed him with \nproposals  and would regularly visit his college, which even led to \ngrievances raised with the college faculty.  Vide a written \nComplaint dt. 24.07.2023 with the Police Inspector, Karad Taluka \nPS Satara, the father of the Appellant has alleged that the \nComplainant/Respondent no. 2 had  been harassing his son & had \ntaken him to different lodges against his will and had threatened \nto implicate him in false rape cases, if he refused to marry her.  A \nNon-Cognizable Offence Information Report (NCR )1 dt. \n24.07.2023 had been registered  pursuant to a threatening phone \ncall received on 22.0 7.2023 at 10:30 pm in the night, on the \nAppellant’s mobile number from another mobile, allegedly \nthreatening  that she will beat him by entering his house and \ndestroy his family.  \n5. Pursuant thereto that the FIR had been maliciously \nregistered against him and that no prima -facie case u/s 376, \n376(2)(n), 377, 504 & 506 IPC could be made out against him, \nthe Appellant sought anticipatory bail from the Additional \nSessions Judge, Karad, which was granted vide Order dt. \n23.08.2023. The Additional Sessions Judge, while granting bail \nto the Appellant made the following remarks : \n“9. In this backdrop the point cannot be side lined \nthat the victim is matured to understand the \n \n1 Section 155 of the Code of Criminal Procedure, 19 73.  SLP (Crl.) No. 10044 of 2024   Page 6 of 13 \n significance and morality to which she is \nconsenting. The prosecutrix who is major lady gives \nconsent even on any of the aforesaid assumption \nand she had sexual intercourse with \napplicant/accused, she will be under all \ncircumstances and in all respect cons idered to be a \nconsenting party. This coupled with the fact that day \nafter day, week after week and month after month, \nthis arrangement continued until the day of \nreckoning when she complained that promise of \nmarriage is not fulfill or that all this while she was \nbeing fedup of this  false assurance. Whatever be the \nworth of promise or assurance , in law informant is \ndeemed to have give n consent on her own accord as \nfar as sexual intercourse is concerned. When two \nyoung male and female having attained the age of \ndiscretion get attracted to each other and due to \nemotional and passionate attachment succumbed to \ntemptation of sexual relation ship then such mental \nand voluntary participation does not come in the \nway of granting bail. Hence, accused is entitled for \npre-arrest bail. The apprehension shown by \nprosecution will be safeguarded by imposing \nconditions…….”  \n \n6. The Appellant  then preferred Crl. W.P. No. 3181 of 2023 \nseeking quashing of the C.R. No. 490/2023 dt. 31.07.2023 & the \nproceedings emanating therefrom before the High Court of \nJudicature at Bombay , and i n the meanwhile, t he investigation \nculminated into a charge -sheet 26.09.2023 before the Additional \nSessions Judge, Karad .  SLP (Crl.) No. 10044 of 2024   Page 7 of 13 \n 7. The learned counsel for the Appellant contends that the \nHigh Court has erred in dismissing the Petition u/s 482 CrPC \ninsofar as the criminal proceedings  in the present case constitute \nan abuse of process of law, and is well within the categories as \ncontemplated by this Court in State of Haryana Vs Bhajan Lal2. \nIt is argued that the allegations of forcible sexual assault and \nunnatural sex are highly improbable as there is no medical \nevidence to adduce that forcible sexual assault and unnatural sex \nhad been committed upon the Complainant/Respondent no. 2 and \nthat allegations of rape are unsustainable as the relationship \nbetween the parties  being  two mature adults  was purely \nconsensual in nature. It is argued that the captioned FIR is \nregistered after a delay  of 13 months from the date of the alleged \nincident , which is considerable to cast doubt on the veracity of the \nallegations made by the Complainant /Respondent no. 2, \nespecially when she sustained her relationship  with the Appellant \nsince the alleged incident.  \n8. Having  heard  both sides  in this case and after carefully \nconsider ing the material on record , the following attributes come \nto the fore:  \n(a) Even if the allegations in the FIR are taken as a true \nand correct depiction of circumstances, it does not appear \n \n2 1992 Supp (1) SCC 335 . SLP (Crl.) No. 10044 of 2024   Page 8 of 13 \n from the record that the consent of the \nComplainant/Respondent no.  2 was obtained against her will \nand merely on an assurance to marry. The Appellant and the \nComplainant/Respondent no.  2 were acquainted since \n08.06.2022, and she herself admits that they interacted \nfrequently and fell in love. The Complainant/Respondent      \nno. 2 engaged in a physical relationship alleging that the \nAppellant had done so without her consent , however she not \nonly sustained her relationship for over 12 months , but \ncontinued to visit him in lodges on two separate occasions . \nThe narrative of the Complainant/Respondent no. 2 does not \ncorroborate with her conduct.  \n(b) The consent of the Complainant/Respondent no. 2 as \ndefined under section 90 IPC also cannot be said to have been \nobtained under a misconception of fact . There is no material \nto substantiate  “inducement or misrepresentation ” on the part \nof the Appellant  to secure consent for sexual relations without \nhaving any intention of fulfilling said promise. Investigation \nhas also revealed that  the Khulanama , was executed on \n29.12.2022  which  the Complainant/Respondent no.  2 had \nobtained from her ex -husband. During this time, the parties \nwere already in a relationship and the alleged incident had \nalready taken place. It is inconceivable that the Complainant \nhad engaged in a physical relationship with the Appellant, on SLP (Crl.) No. 10044 of 2024   Page 9 of 13 \n the assurance of marriage, while she was already married to \nsomeone else . Even otherwise, such promise to begin with \nwas illegal and unenforceable qua the Appellant.  \n(c) There is no evidence of coercion or threat of injury \nto the Complainant/Respondent no.  2, to attract an offence \nunder section 506 IPC. It is improbable that there was any \nthreat caused to the Complainant/Respondent no.  2 by the \nAppellant when all along the relationship was cordial, and it \nwas only when the Appellant graduated and left for his \nhometown to Ahmednagar, the Complainant/Respondent     \nno. 2 became agitated. We also cannot ignore the conduct of \nthe Complainant/Respondent no.  2 in visiting the native \nvillage of the Appellant without any intimation, which is also \nunacceptable and reflects the agitated and unnerved state of \nmind of the Complainant/Respondent no. 2. For the same \nreason , the criminal prosecution against the Appellant herein \nis probably with an underlying motive and disgruntled state \nof mind.  \n(d) There is also no reasonable possibility that the \nComplainant /Respondent no. 2 or any woman being married \nbefore  and having a child  of four years , would continue to be \ndeceived by the Appellant or maintain a prolonged \nassociation or physical  relationship with an individual who \nhas sexually assaulted and exploited her.  SLP (Crl.) No. 10044 of 2024   Page 10 of 13 \n 9. In our considered view, this is also not a case where there \nwas a false promise to marry to begin with. A consensual  \nrelationship turning sour or partners becoming distant cannot be \na ground for invoking criminal machinery of the State. Such \nconduct not only burdens the Courts, but blots the identity of an \nindividual accused of such a heinous offence. This Court has time \nand again warned against the misuse of the provisions, and has \ntermed it a  folly3 to treat each breach of promise to marry as a \nfalse promise and prosecute a person for an offence under section \n376 IPC.  \n10. As demonstrated hereinabove, the  ingredients of the \noffence under Sections 376 (2)(n) or 506 IPC are not established . \nThe present case squarely falls under categories enumerated in \nPara 102(5) & 102(7) as identified by this Court in State of \nHaryana Vs Bhajan Lal (supra)  for the exercise of powers u/s \n482 CrPC by the High Court so as to  prevent the abuse of process \nof law. Para 102 reads as under:  \n“102. In the backdrop of the interpretation of the \nvarious relevant provisions of the Code under \nChapter XIV and of the principles of law enunciated \nby this Court in a series of decisions relating to the \nexercise of the extraordinary power under Article \n226 or the inherent powers under Section 482 of the \nCode which we have extracted and reproduced \nabove, we have given the following categories of \n \n3 Naim Ahmed Vs State (NCT) of Delhi (2023) SCC Online SC 89 .  SLP (Crl.) No. 10044 of 2024   Page 11 of 13 \n cases by way of illustration wherein such power \ncould be exercised either to prevent abuse of the \nprocess of any court or otherwise to secure the ends \nof justice, though it may not be possible to lay down \nany precise, clearly defined and sufficiently \nchann elised and inflexible guidelines or rigid \nformulae and to give an exhaustive list of myriad \nkinds of cases wherein such power should be \nexercised.  \n(1) Where the allegations made in the first \ninformation report or the complaint, even if they are \ntaken at their face value and accepted in their \nentirety do not prima facie constitute any offence or \nmake out a case against the accused.  \n(2) Where the allegations in the first information \nreport and other materials, if any, accompanying \nthe FIR do not disclose a cognizable offence, \njustifying an investigation by police officers under \nSection 156(1) of the Code except under an order of \na Mag istrate within the purview of Section 155(2) \nof the Code.  \n(3) Where the uncontroverted allegations made in \nthe FIR or complaint and the evidence collected in \nsupport of the same do not disclose the commission \nof any offence and make out a case against the \naccused.  \n(4) Where, the allegations in the FIR do not \nconstitute a cognizable offence but constitute only a \nnon-cognizable offence, no investigation is \npermitted by a police officer without an order of a \nMagistrate as contemplated under Section 155(2) of \nthe Code.  \n(5) Where the allegations made in the FIR or \ncomplaint are so absurd and inherently SLP (Crl.) No. 10044 of 2024   Page 12 of 13 \n improbable on the basis of which no prudent \nperson can ever reach a just conclusion that there \nis sufficient ground for proceeding against the \naccused.  \n(6) Where there is an express legal bar engrafted in \nany of the provisions of the Code or the concerned \nAct (under which a criminal proceeding is \ninstituted) to the institution and continuance of the \nproceedings and/or where there is a specific \nprovision i n the Code or the concerned Act, \nproviding efficacious redress for the grievance of \nthe aggrieved party.  \n(7) Where a criminal proceeding is manifestly \nattended with mala fide and/or where the \nproceeding is maliciously instituted with an \nulterior motive for wreaking vengeance on the \naccused and with a view to spite him due to private \nand personal grudge. ” \n \n11. Taking into consideration that the Appellant is just 2 5 years \nof age, and has a lifetime ahead of him, it would be in the interest \nof justice that he does not suffer a n impending  trial and , therefore,  \nthe proceedings emanating from C.R. No. 490/2023 dt. \n31.07.2023 are quashed at this stage itself.  \n12. Consequently, the Appeal is allowed and the Impugned \nOrder dt. 28.06.2024 passed by the High Court of Judicature at \nBombay in Crl. W.P. No. 3181 of 2023 is set aside. Accordingly, \nC.R. No. 490/2023 dt. 31.07.2023  registered at Karad Taluka \nPolice Station, Satara  and proceedings  emanating  therefrom in \nRCC no. 378/2023 pending before the Additional Sessions Judge, SLP (Crl.) No. 10044 of 2024   Page 13 of 13 \n Karad are  quashed, and Appellant is discharged . Bail bonds , if \nany, also stand cancelled.   \n13. Pending a pplications, if any , stand  disposed of.  \n \n \n……………………………………J.  \n                   [B.V . NAGARATHNA]  \n \n \n……………………………………J.  \n                                             [SATISH CHANDRA SHARMA]  \n \nNEW DELHI  \nMay 26, 2025"
}