{
  "filename": "ARIF_MD_YEASIN_JWADDER_VS._THE_STATE_OF_ASSAM.pdf",
  "page_count": 36,
  "content": "2025 INSC 785\n  \nPage 1 of 36   REPORTABLE  IN THE SUPREME COURT OF INDIA CRIMINAL APPELLATE JURISDICTION  CRIMINAL APPEAL No. __________ OF 2025 (Arising out of SLP (Crl.) No. 7929 OF 2023)  \n Arif Md. Yeasin Jwadder                                                         … Appellant Versus State of Assam and Ors.                                                      … Respondents  \n JUDGMENT  SURYA KANT, J. Leave granted. 2. The instant matter arises from a series of encounters reported in the State of Assam (Respondent No. 1), the authenticity of which has been called into question on various counts. At the heart of these proceedings lie concerns that straddle the delicate boundary between the imperatives of law enforcement and the inviolable guarantees of life and personal liberty enshrined in our Constitution.  3. This appeal is directed against the judgment dated 27.01.2023 (Impugned Judgment), whereby the High Court of Gauhati (High Court) dismissed PIL No. 86/2021, inter alia seeking: (i) records of   \nPage 2 of 36  all alleged fake encounters in the State of Assam, (ii) registration of FIR against the erring police officials and (iii) independent investigation against such officials in compliance with the guidelines laid down by this Court in People’s Union for Civil Liberties & Anr. v. State of Maharashtra & Ors.1 The petition was dismissed by the High Court, holding that the PIL was premature and the documents placed on record only made out vague assertions. Nevertheless, the High Court directed that the Appellant shall be provided all legally permissible documents in connection with all such cases, if so applied. 4. The Appellant is before us asserting that no meaningful or effective inquiry has been undertaken in respect of these cases and the guidelines laid down in PUCL (supra) has been flouted blatantly.  A. FACTUAL BACKGROUND 5. Before adverting to the issues and contentions raised by the parties, we deem it appropriate to narrate the factual background leading to the instant appeal briefly. 5.1. The Appellant in the Writ Petition filed before the High Court alleged that as many as 80 fake encounters took place in the State of Assam between May, 2021 and December, 2021. According to him,  1 People’s Union for Civil Liberties & Anr. v. State of Maharashtra & Ors, (2014) 10 SCC 635.   \nPage 3 of 36  28 persons were killed and 48 were left injured, during these encounters. It was further alleged that police authorities have justified these actions on the basis that escape attempts from the accused persons prompted them to open fire in purported self-defence, resulting in death or injury. 5.2. Alarmed by the growing incidence of police encounters, the Appellant firstly addressed a complaint on 10.07.2021 to the National Human Rights Commission (NHRC), Respondent No. 4 herein. The Appellant beseeched the NHRC about the multiple incidents of police encounters and requested to take cognizance of the matter. Shortly thereafter, on 12.07.2021, the Assam Human Rights Commission (AHRC), Respondent No. 5 herein, also sent a suo-moto notice to the Government of Assam and sought a report. It appears from the records that AHRC had already taken notice of the issue pertaining to increasing incidents of encounters on 07.07.2021, i.e., prior to the complaint addressed by the Appellant to the NHRC. 5.3. The NHRC on 29.11.2021, transferred the Appellant’s complaint to the AHRC on the premise that the latter had already taken note of the issue. Not long after, on 20.12.2021, the Appellant filed the aforestated PIL Petition before the High Court, raising the issue of the alleged fake encounters. It may be apposite to add here that   \nPage 4 of 36  during the pendency of the proceedings before the High Court, the full bench of the AHRC on 12.01.2022, disposed of the matter before it on the ground that the subject matter was pending adjudication before the High Court and Regulation 7(XII) of the AHRC (Procedure) Regulations, 2001 do not permit entertaining of complaints that are sub-judice before any other Court/Tribunal. 5.4. The Appellant moved an application in the PIL proceedings seeking copies of the FIRs registered pursuant to these police encounters. The High Court granted him liberty to apply to the Prosecuting Inspectors of each district in the State of Assam for accessing the same. He consequently applied to the concerned authorities. The Appellant appears to have maintained that there were 101 known incidents at that point of time. However, only the authorities of 12 districts (out of total of 30), supplied him copies of 41 FIRs. 5.5. In the meantime, the Respondent No. 1, filed several compliance affidavits before the High Court in the pending proceedings, candidly acknowledging that between May 2021 and August 2022, 171 instance of police encounters had taken place wherein 56 persons were killed including 4 custodial deaths, and 145 persons were injured. As such, the scope of the Petition was expanded, and all 171 alleged police encounters between May 2021 and August 2022 came to be scrutinised.   \nPage 5 of 36  5.6. The High Court, however, after considering the affidavits filed by the parties and other material on record, dismissed the petition holding that that “unless proper foundational facts are brought to the notice of the court, a Public Interest Litigation in such a matter cannot be maintained merely on the basis of some vague and unsubstantiated assertions”. The High Court returned a categorical finding that the Appellant has failed to point out any infirmity in the procedure adopted in any of the enquiry proceedings or any guideline laid down in PUCL (supra) based on the materials brought on record. Given the foregoing, the High Court also turned down the prayer to constitute a Special Investigation Team (SIT) or hand over the investigation of these encounters to the Central Bureau of Investigation (CBI). The High Court ofcourse directed that the Appellant shall be provided all legally permissible documents in connection with all such cases. B. CONTENTIONS ON BEHALF OF THE APPELLANT 6. Mr. Prashant Bhushan, learned counsel for the Appellant, strongly contended that the High Court has fell in error in overlooking the fact that 56 persons have lost their lives and 145 have been grievously injured in police encounters. According to him, the guidelines laid down in PUCL (supra) were not adhered to in any of these incidents.    \nPage 6 of 36  7. In support of his contentions, Mr. Bhushan has advanced the following submissions: a) At the outset, any imputation on the bona fides of the Appellant is unfounded. The Appellant is a permanent resident of the State of Assam and being a practicing advocate, espouses the cause of transparency and accountability of public institutions. The majority of the victims and/or their families are either unaware of their rights or are scared to approach the police officials seeking further investigation. b) The FIRs pertaining to the incidents of police encounters have been registered against the victims i.e., the persons killed or injured and not against the concerned police officials. The registration of FIRs is in violation of the guidelines laid down by this Court in Para 31.2 of the judgment in PUCL (supra) which prescribes that in the event of an encounter leading to death, an FIR shall be registered and forwarded to the jurisdictional court under Section 157 of the Code of Criminal Procedure (CrPC).  c) The investigation into these incidents of police encounters has not been conducted in an independent manner. In this regard, Para 31.3 of the judgment in PUCL (supra) mandates that an independent investigation into the incident shall be conducted   \nPage 7 of 36  by the Crime Investigation Department (CID) or police team of another police station under the supervision of a senior officer. However, the investigation into these police encounters was conducted by officers from the same police station.  d) Such so-called investigation was merely an eye wash and nothing more than a superficial exercise, intended to create an illusion of accountability. It was riddled with a glaring conflict of interest, and not only did it compromise the integrity of the process but also provided the officers involved with a convenient opportunity to shield themselves from scrutiny and evade any real consequences for their misconduct. e) A perusal of the 41 FIRs supplied to the Appellant, 12 of which were also placed on record before the High Court, clearly indicates a somewhat similar modus operandi adopted by the police officials who have justified the killings and injury caused to people on the pretext that they were trying to flee. This gives rise to the apprehension that the police officials have undertaken these encounters in a premeditated manner and not in self defence as proclaimed by them. f) The guidelines laid down by this Court in PUCL (supra) mandates that the concerned police official must surrender their weapon for forensic/ballistic analysis. In breach of the   \nPage 8 of 36  prescribed guidelines, the Magisterial inquiries in several incidents remain silent on this aspect, offering no indication as to whether any ballistic or forensic examinations were ever conducted. The Appellant has illustratively pointed out the inquiry reports in the cases of deaths of Dimasa National Liberation Army (DNLA) cadres, suspects of the United People’s Revolutionary Front, Kanwaldeep Singh Sindhu, Sorangi China, and Bubu Konwar which do not refer to the forensic analysis. g) Regardless of the clear mandate laid down in PUCL (supra), which expressly requires a Magisterial inquiry or an independent investigation even in cases involving grievous injuries, this crucial procedural safeguard has been disregarded. In the majority of such instances, no such inquiry or investigation has been initiated, reflecting a serious departure from the established legal framework intended to ensure transparency and accountability.  h) The State of Assam has failed to indicate the present status of investigation in all the 171 cases leading to death or grievous injury. The table tendered before this Court on 25.02.2025 indicates that charge sheet has been filed in 5 out of the 41 cases leading to death. However, the charge sheets have not   \nPage 9 of 36  been placed on record, and it is feared that they may be against the victims, not the concerned police personnel. C. CONTENTIONS ON BEHALF OF THE RESPONDENT(S) 8. Mr. Tushar Mehta, learned Solicitor General of India, along with Mr. Devajit Saikia, Advocate General and Mr. Nalin Kohli, Additional Advocate General for the State of Assam, appearing for Respondent Nos. 1-3 have vehemently asserted that the High Court has rightly dismissed the PIL as the Appellant failed to establish or point out any lacunae in the investigation conducted into the instances of police encounters.  9. Their submissions may be summarised as follows: a) The issues raised in the instant petition are vague, baseless and whimsical, and the High Court rightly dismissed the same as being premature. As per the reports submitted by the Superintendent of Police of all the districts, the guidelines issued by this Court in PUCL (supra) have been diligently observed in all death cases. b) In all instances where police encounters have resulted in death, separate FIRs have been lodged; independent investigations have been conducted; and Magisterial inquiries have also been ordered. In its affidavit dated 29.09.2022, the   \nPage 10 of 36  State of Assam has categorically stated that 171 cases have been registered and that investigations are currently underway. c) The reliance placed by the Appellant on Para 31.3 of the judgment in PUCL (supra) to suggest that ‘an independent investigation into the incident shall be conducted by the CID or police team of another police station’ in every incident, is completely misplaced and incorrect. The judgment does not contemplate the registration of FIR at a different police station. The Appellant’s contention in this regard is thoroughly untenable as the FIR has to be registered by the police station having jurisdiction over the matter. The Appellant’s claim in this regard would make the investigation unnecessarily onerous and time-consuming. Similarly, the need for constituting an independent investigating agency would arise only when a prima facie case has been made out that investigation is not being carried out in accordance with the due procedure prescribed by law. d) Fair and impartial magisterial inquiries have been conducted in all incidents where death has been caused in police encounters. More importantly, all these inquiries have been undertaken strictly per the guidelines in PUCL (supra). The   \nPage 11 of 36  particulars of the stage of investigation or conduct of magisterial inquiry in all 171 cases were placed before the High Court vide the affidavit dated 29.09.2022. e) Insofar as the reference to forensic/ballistic reports is concerned, the Appellant has sought to present unsubstantiaed claims without being supported by any cogent facts. He has selectively read the reports and deliberately concealed the fact that ballistic examination reports and forensic reports were yet to be received in some cases, and in others, were received later. Those reports were duly considered before filing of the charge sheet or final report. f) The Appellant’s contention that PUCL (supra) applies even in cases of grievous injury is totally erroneous. The judgment only provides that the guidelines will also apply to grievous injury cases in police encounters, as far as possible. The phrase ‘as far as possible’ shows that compliance and adherence to the guidelines need not be made in a strict sense. g) The allegation of the Appellant that the State of Assam has failed to indicate the present status of the investigation is also entirely misplaced. It is noteworthy that the State of Assam, in its counter-affidavit dated 29.04.2024, has stated that out of a total of 171 cases, charge sheets have been filed in 125 cases,   \nPage 12 of 36  forwarding reports were submitted in 23 cases, and that the remaining 23 cases were still pending investigation. The competent police officials have investigated all the cases under the supervision of the Superintendent of Police of the concerned districts. D. ISSUES FOR CONSIDERATION 10. Having regard to the rival submissions, we find that the following issues arise for our consideration: (a) Whether the allegations made by the Appellant prima facie establish violation of the guidelines laid down by this Court in PUCL (supra) ? (b) If so, what are the remedial measures? E. ANALYSIS E.1. Understanding the Context and Framework of the Guidelines laid down in PUCL (supra) 11. The instant controversy, in its core, revolves  around the alleged infraction of the PUCL (supra) guidelines. We therefore deem it appropriate to firstly advert to the context, intent, and purport of those guidelines.  12. The PUCL case arose against the backdrop of allegations of fake or staged police encounters in the State of Maharashtra and other   \nPage 13 of 36  parts of the country, where individuals purported to be criminals were killed by the police. The petitioner therein, PUCL, sought court-monitored guidelines to curb the misuse of power and ensure accountability and transparency in such encounters, in light of Article 21 of the Constitution of India. 13. This Court recognised the gravity of the issue, noting that fake encounters are extra-judicial killings and must be subject to strict legal scrutiny. While issuing sixteen (16) mandatory guidelines, this Court held that any encounter killing must be investigated fairly and independently, and cannot be treated as justified merely on the claim of self-defence by the Police.  14. To examine the contention at hand, we deem it appropriate to extract a few guidelines that have been contested before us: “31.1. Whenever the Police is in receipt of any intelligence or tip-off regarding criminal movements or activities pertaining to the Commission of grave criminal offence, it shall be reduced into writing in some form (preferably into case diary) or in some electronic form. Such recording need not reveal details of the suspect or the location to which the party is headed. If such intelligence or tip-off is received by a higher authority, the same may be noted in some form without revealing details of the suspect or the location. 31.2. If pursuant to the tip-off or receipt of any intelligence, as above, encounter takes place and firearm is used by the police party and as a result of that, death occurs, an FIR to that effect shall be registered and the same shall be forwarded to the court under Section 157 of the Code without any delay. While forwarding the report under Section 157 of   \nPage 14 of 36  the Code, the procedure prescribed under Section 158 of the Code shall be followed. 31.3. An independent investigation into the incident/encounter shall be conducted by the CID or police team of another police station under the supervision of a senior officer (at least a level above the head of the police party engaged in the encounter). The team conducting inquiry/investigation shall, at a minimum, seek... 31.4. A Magisterial inquiry under Section 176 of the Code must invariably be held in all cases of death which occur in the course of police firing and a report thereof must be sent to Judicial Magistrate having jurisdiction under Section 190 of the Code. 31.5. The involvement of NHRC is not necessary unless there is serious doubt about independent and impartial investigation. However, the information of the incident without any delay must be sent to NHRC or the State Human Rights Commission, as the case may be. ***** 31.7. It should be ensured that there is no delay in sending FIR, diary entries, panchnamas, sketch, etc., to the concerned Court. 31.8. After full investigation into the incident, the report should be sent to the competent court under Section 173 of the Code. The trial, pursuant to the chargesheet submitted by the Investigating Officer, must be concluded expeditiously. 31.9. In the event of death, the next of kin of the alleged criminal/victim must be informed at the earliest. ***** 31.13. The police officer(s) concerned must surrender his/her weapons for forensic and ballistic analysis, including any other material, as required by the investigating team, subject to the rights under Article 20 of the Constitution. *****  31.16. If the family of the victim finds that the above procedure has not been followed or there exists a pattern of abuse or lack of independent investigation or impartiality by any of the functionaries as above mentioned, it may make a complaint to the Sessions Judge having territorial jurisdiction over the place of incident. Upon such complaint being made, the concerned Sessions Judge   \nPage 15 of 36  shall look into the merits of the complaint and address the grievances raised therein. 32. The above guidelines will also be applicable to grievous injury cases in police encounter, as far as possible.” 15. It may be seen that the guidelines provide for the registration of FIR, independent investigation, Magisterial inquiry, involvement of forensic science, informing the next of kin, compensation and information to the NHRC and State Human Rights Commission (SHRC), among others. These guidelines, in a way, reaffirm the primacy of the Rule of Law as the bedrock of our constitutional democracy. This Court authoritatively held that no individual or institution, including the Police or law enforcement agencies, is above the law. It cautioned against the emerging culture of glorifying police encounters as indicators of effective policing or public heroism and observed that such glorification distorts the role of the Police in a constitutional democracy and fosters a climate of impunity, where extra-judicial methods are valorised over legal processes.  16. It needs no emphasis that, the use of excessive or unlawful force by public authorities, irrespective of the nature of the offence or the antecedents of the victim, cannot be condoned or legitimised on any pretext. Any derogation from the principles of due process, even in   \nPage 16 of 36  the name of expediency or public safety, erodes the foundation of a democratic and civilised society.  17. Having impressed upon the befitting relevance of the PUCL (supra) principles and having delineated the dictum governing the present controversy, the stage is now set to examine the rival contentions advanced by the parties. E.2.Whether the allegations made by the Appellant prima facie establish violation of the guidelines laid down by this Court in PUCL (supra) ? E.2.1. Locus Standi of the Appellant 18. At the very outset, we deem it appropriate to address the objection raised on behalf of the Respondent questioning the locus of the Appellant to maintain the present proceedings. The Appellant approached the High Court purportedly on the ground that the victims and their families are either unaware of their legal rights or too intimidated to approach the appropriate authorities. While such apprehensions may not be entirely unfounded, the question that arises is whether the Appellant, as a third party, can invoke the Writ Jurisdiction of the High Court in a matter that appears to impact specific individuals more directly than the public at large.   \nPage 17 of 36  19. It is trite law that since the evolution of the PIL jurisdiction, particularly post the landmark pronouncements beginning in 1984, the doctrine of locus standi has been considerably liberalised. The transformation of the traditional adversarial system into a more participatory model, has allowed conscientious citizens to knock at the doors of Constitutional Courts in matters involving gross violations of Fundamental Rights, environmental degradation, systemic corruption, or executive apathy affecting large segments of society. 20. However, with the widening of the gates to justice, comes an enhanced responsibility upon the court to ensure that this jurisdiction is not invoked in a manner that causes more harm  than good. Where the alleged cause espoused by a third party in the form of a PIL relates to a specific individual or a closed set of individuals — particularly where the implications of judicial intervention may directly alter or jeopardize the legal position of the victim or their kin — it becomes imperative for the courts to tread with utmost circumspection. 21. The danger of an unintended miscarriage of justice or irreversible prejudice being caused to an invisible and voiceless victim or their family, merely because a well-meaning but distanced individual has approached a Writ Court, cannot be discounted. In such   \nPage 18 of 36  situations, it is not sufficient for the court to proceed solely on the averments of the person advancing the cause before the court. Instead, it becomes obligatory for the court to independently explore mechanisms — institutional or otherwise — that can facilitate direct communication with the victim or their family, thereby enabling them to make an informed choice about participation or redressal through judicial means. 22. Adverting the facts of this case, we deem it appropriate to acknowledge the role played by the Appellant in bringing to the court’s attention a matter that raises grave and disquieting concerns. The assertion that several victims and their families are either helpless to seek legal recourse or too intimidated to approach the authorities need not be summarily disregarded. It is not uncommon in situations involving alleged abuse of power by State actors for the affected individuals to remain silent, either out of fear or lack of resources. The Appellant has, through sustained efforts, placed before this Court as many as 171 individual instances, each warranting objective scrutiny. 23. It must, however, be borne in mind that the mere compilation or aggregation of cases does not, by itself, call for omnibus judicial directions. The allegations that some of these incidents may involve fake encounters are indeed serious and, if proven, would amount   \nPage 19 of 36  to a grave violation of the right to life under Article 21 of the Constitution. It is however equally possible that upon a fair, impartial, and independent investigation, some of these cases may turn out to be necessary and legally justified. This distinction is critical. The issuance of broad-brush directives without individual scrutiny could result in a miscarriage of justice, either by shielding the guilty or by stigmatizing legitimate action by public servants discharging their duty under challenging circumstances. 24. It is in this delicate constitutional balance that the court must situate its response. The invocation of public interest jurisdiction, cannot become a substitute for procedural safeguards and the right of individual victims or their families to be heard. The risk of issuing general directions in the absence of independent assessment is not merely procedural — it strikes at the very heart of the principles of fairness and due process that underpin our judicial system. The jurisprudence developed by this Court over the decades reinforces the position that justice must be individualized where the consequences are personal and irreversible. 25. It therefore becomes incumbent upon this Court to devise a calibrated mechanism whereby each of the alleged incidents is examined independently, and where victims or their families are accorded a real and meaningful opportunity to participate in the   \nPage 20 of 36  process. Their voices must be heard not as a matter of courtesy, but as a matter of right. The function of a Constitutional Court in such circumstances is not merely adjudicatory, but protective — to safeguard the rule of law, and to ensure that the promise of justice does not remain illusory for those who are most vulnerable. E.2.2. Obligation of this Court to safeguard Constitutional obligations 26. In order to consider the veracity of the allegations regarding the violation of the guidelines enumerated in PUCL (supra), we have already set out in detail the contentions advanced by the parties in the preceding sections of this judgment. The contentions raised by the Appellant are rooted in constitutional concerns relating to the right to life and the accountability of law enforcement, particularly in light of the binding nature of the procedural safeguards mandated by this Court. 27. According to the Appellant, there has been a profound and systemic failure in adhering to the cited guidelines, in the aftermath of a series of police encounters in the State of Assam. The Appellant alleges that in several cases, no FIR has been registered against the concerned police officials, or the provisions invoked in the FIR are not appropriate for cases of police encounters. It was also argued that in some instances, the FIR has been registered against the   \nPage 21 of 36  victims of these police encounters and not the erring police officials. According to the Appellant, such inappropriate registration of FIRs directly contravenes this Court’s mandate, which unequivocally requires that every case of encounter resulting in death or grievous injury must be brought under the ambit of criminal law through the registration of a case. 28. In addition, the Appellant has pointed to the absence of an independent investigation by the CID or a police team from another police station, which is a sine qua non under the PUCL (supra) guidelines to ensure objectivity and prevent conflict of interest. The Appellant has further alleged non-compliance with the requirement of a magisterial inquiry in cases involving grievous injuries or deaths, as well as the absence of any reference to ballistic and forensic reports.  29. These allegations have however been vehemently refuted by the Respondents, who submitted that in all instances where police encounters have led to death, separate FIRs have been lodged, an independent investigation conducted and a Magisterial Inquiry has also been ordered. The State, in its counter-affidavit has stated that out of a total of 171 cases, a charge sheet has been filed in 125 cases, a forwarding report submitted in 23 cases, and the remaining 23 cases were still under investigation. The Respondents   \nPage 22 of 36  also maintain that the requirement of involving an independent agency, such as the CID or a team from another police station, must be assessed contextually, and not applied as a blanket directive. Such recourse becomes necessary only where credible allegations are raised suggesting bias, partiality, or procedural deviation on the part of the local investigating authorities.  30. In essence, the thrust of the argument is that the guidelines in PUCL (supra) are to be interpreted as laying down general procedural safeguards to ensure fairness and transparency, but not as creating a rigid or mechanical requirement that displaces the jurisdiction of the local Police in every encounter case, unless justified by the facts of the case. 31. Insofar as the allegation relating to the non-consideration of ballistic and forensic reports is concerned, the Respondents have submitted that the Appellant, in undue haste, has painted an incomplete and premature portrait of the investigative process. The Respondents claim that the concerned forensic and ballistic reports were received and duly taken into account by the investigating authorities, albeit at a later stage in the proceedings. Mere timing of such consideration does not ipso facto establish procedural impropriety, particularly when the reports form part of the final investigative record.   \nPage 23 of 36  32. Upon a comprehensive examination, it emerges that several instances cited by the Appellant to demonstrate procedural non-compliance of PUCL (supra) guidelines are factually incorrect or incomplete. The Appellant has failed to independently place on record any cogent or verifiable material to substantiate the allegations. He has merely relied upon the data furnished by the State itself to highlight purported lapses. After minutely scanning such data, prima facie it seems that barring a few cases, it is difficult to infer that there has been a procedural breakdown or the PUCL (supra) guidelines were flagrantly violated. Further, in the absence of independent corroboration or affidavits from affected persons, the assertions remain more or less speculative.  33. The record further suggests that FIRs have been registered in all the cases brought to our notice. The State of Assam has also submitted a status report detailing each FIR and the respective stage of investigation or prosecution. These documents prima facie belie the claim of inaction and do establish that, at least at the foundational level, the criminal process was duly initiated. 34. As regards the requirement of magisterial inquiry under the framework prescribed by PUCL (supra), the State has demonstrated that such inquiries were conducted in several cases. However, the record remains inconclusive as to whether this   \nPage 24 of 36  procedural safeguard was uniformly followed in all encounter-related incidents, as is mandatorily required in terms of the referenced judgment. While partial compliance is visible, the absence of a clear and consistent procedural trail in some cases calls for closer administrative scrutiny by an independent authority to ensure uniform adherence. 35. On the aspect of forensic and ballistic analysis, the State of Assam has acknowledged that relevant reports were obtained and considered in the course of the investigation. Nonetheless, it is also apparent that such consideration occurred belatedly. While delayed compliance cannot be equated with total omission, the procedural sanctity envisaged by this Court necessitates that such reports be requisitioned and evaluated at the earliest possible stage to ensure fairness and objectivity in the investigative process. 36. Be that as it may, the records furnished by the State themselves indicate that some instances may warrant further evaluation to ascertain whether the guidelines laid down in PUCL (supra) have been meticulously complied with, in both letter and spirit. The gravity of the issues involved, namely, implicating the Fundamental Rights under Article 21 requires that procedural safeguards are not merely observed in form, but are meaningfully enforced to inspire public confidence in the Rule of Law.   \nPage 25 of 36  37. We may hasten to clarify that the foregoing observation should not be construed as casting any aspersions on the investigation carried out by the State of Assam. No finding of mala fides or institutional bias can be returned through a summary procedure such as the instant proceedings. Given the constitutional importance of the procedural mandates enunciated by this Court, it is imperative, in the interest of justice, that an impartial and independent institution undertakes a careful verification of compliance in each case. Such scrutiny, if undertaken in good faith and within the administrative framework already available, will reinforce transparency and accountability in the criminal justice process. 38. Thus, even if the Appellant has not been able to conclusively demonstrate the allegations of illegality or procedural violation on the part of the Respondents, this Court cannot remain indifferent where the rights and dignity of individuals, particularly in the context of alleged extra-judicial actions, are at stake. To ensure justice to the victims and their families, and to uphold the sanctity of the procedure established by law, we hold that the issues raised in the instant petition merit a fair and impartial inquiry. The obligation of this Court to safeguard constitutional guarantees persists irrespective of the identity or capacity of the litigant, and where concerns arise regarding adherence to judicially mandated   \nPage 26 of 36  guidelines, the Constitutional Courts must act to preserve both legality and accountability. E.3. If so, what are the remedial measures? 39. Having held that the issue raised in the instant appeal requires fact finding inquiry, we now proceed to analyse what would constitute an appropriate response to these apprehensions. E.3.1. Role of the National and State Human Rights Commissions in the instant controversy 40. The domestic human rights architecture in India is supported by a robust statutory framework that complements the constitutional guarantees enshrined in Part III and the Directive Principles of State Policy. Over the years, the Legislature has enacted various laws to protect vulnerable groups, ensure accountability, and strengthen institutional mechanisms for enforcing human rights. At the centre of this framework stands the Protection of Human Rights Act, 1993 (PHR Act), which institutionalises the commitment of the Indian State to uphold and monitor human rights in a structured and independent manner. 41. The PHR Act serves as the primary statutory instrument for the promotion and protection of human rights in India. The Act defines ‘human rights’ under Section 2(d) as the ‘rights relating to life, liberty, equality, and dignity of the individual guaranteed by the   \nPage 27 of 36  Constitution or embodied in international covenants and enforceable by Indian courts’. The establishment of the NHRC and SHRC under the PHR Act reflects an attempt to create autonomous, quasi-judicial bodies capable of independent inquiry and intervention in matters concerning human rights violations. These institutions are vested with wide-ranging powers, including the ability to summon witnesses, requisition public records, and initiate investigations suo motu or on petitions filed by aggrieved individuals. In practice, they function as vital conduits for bringing instances of abuse or administrative apathy to the fore, particularly where traditional avenues of redress may be inaccessible or delayed. 42. The PHR Act institutionalises grievance redressal, oversight, and education mechanisms while linking domestic law with international human rights instruments. These multifaceted roles underscore the position that these Commissions not merely a reactive body responding to complaints, but a proactive institution seeking systemic reform and capacity-building across state institutions. Though challenges in implementation and enforcement persist, the PHR Act represents a formal legislative acknowledgement of the inalienable nature of human rights and India’s democratic obligation to protect them.    \nPage 28 of 36  43. This Court in the matter of Extra Judicial Execution Victim and Anr. vs. Union of India and Ors.,2 has rightly underscored the roles of the Human Rights Commission as ‘that of protector, advisor, monitor and educator of human rights’. In that spirit, it is imperative that their functioning is empowered, respected, and made responsive, so that they may discharge their duties not merely as passive observers but as active protectors of fundamental human freedoms. 44. Applying this understanding of the human rights framework to the instant controversy, we have no hesitation in holding that the role of Human Rights Commissions, both at the National and State levels, is paramount in a democratic polity governed by the Rule of Law. These institutions serve as independent watchdogs tasked with safeguarding the dignity, liberty, and rights of individuals, particularly the vulnerable and marginalised who may lack access to institutional redress. In a country as vast and diverse as India, marked by complex socio-political dynamics and systemic inequities, these Commissions provide an essential forum for accountability, transparency, and remedial action against human rights violations. Their mandate to investigate complaints, monitor  2 Extra Judicial Execution Victim and Anr. vs. Union of India and Ors, Writ Petition (Crl.) No. 129/2012.   \nPage 29 of 36  custodial institutions, and recommend reforms reinforces the constitutional vision of justice, liberty, and equality.  45. To that effect, we are pained to observe that, in this matter, the jurisdiction of AHRC was consciously ousted. It is a matter of record that AHRC had taken suo motu cognizance of the matter even before the Appellant filed a complaint before the NHRC. Despite the AHRC being seized of the matter and also being the appropriate forum vested with territorial and subject-matter jurisdiction, the Appellant chose to invoke the PIL jurisdiction of the High Court at a subsequent stage, as a result of which the AHRC disposed of the proceedings hastily. 46. We are certain that the Appellant did not approach the High Court with an intention to render statutory institutions redundant or to obstruct their independent functioning. Human Rights Commissions, particularly those functioning at the state level, are designed to act as swift, accessible, and credible bodies for investigating and redressing violations of human dignity and constitutional safeguards. We reiterate that the efficacy of such institutions is directly linked to public trust and procedural integrity. We also expect these Human Rights Commissions to be proactive in their approach and conduct proceedings with a sense   \nPage 30 of 36  of urgency and purpose that resonates with the gravity of the allegations. E.3.2. Striking the Constitutional Balance: The Path Ahead 47. Having considered the nature of the controversy, we are of the firm view that the instant case involves several questions of fact which cannot be effectively determined by this Court. Similarly, the instant dispute is neither amenable to adjudication through a conventional trial, nor can the investigation be fairly or effectively entrusted to the State Police, as the allegations pertain to the conduct of police officials themselves. The principle of fairness, which is the bedrock of all just legal processes, mandates that any inquiry into the alleged excesses must be independent and insulated from institutional bias. The risk of conflict of interest and the apprehension of a lack of real or perceived impartiality render it inappropriate to involve the State Police in further inquiry. 48. Having outlined the significance, jurisdiction, and institutional mandate of the Human Rights Commissions, it has come to our knowledge that the AHRC is now headed by an erudite jurist who is a retired Chief Justice of the High Court whose judicial acumen and integrity inspire confidence. This Court has every reason to believe that under his stewardship, the AHRC will discharge its duties with diligence, sensitivity, and an abiding commitment to   \nPage 31 of 36  constitutional values. Accordingly, we deem it appropriate to entrust the inquiry of this matter to the AHRC for advancing it to its logical conclusion. The order dated 12.01.2022 passed by the full bench of the AHRC, whereby it had disposed of this issue is thus, set aside. The matter is directed to be reinstated on the board of the AHRC for necessary inquiry into the allegations independently and expeditiously, in accordance with law. 49. In furtherance of the foregoing direction, we consider it essential to ensure that the victims of the alleged incidents, or their family members, are given a fair and meaningful opportunity to participate in the proceedings. To that end, we direct the AHRC to issue a public notice inviting all individuals who claim to be aggrieved (victims and their family members) by the alleged police encounters to come forward and furnish relevant information or evidence before AHRC. The notice shall be published in at least one national English daily and one prominent vernacular newspaper with wide circulation throughout the State of Assam. The publication of such a notice shall be carried out in a manner that is accessible and understandable to the general public, including those residing in remote and conflict-prone areas. The notice shall also include the contact details of the officers of the Taluka and District Legal Services Authorities, thereby enabling the victims   \nPage 32 of 36  and/or their families to access free legal aid in approaching the AHRC. 50. We further direct that the AHRC may ensure confidentiality with respect to the identity of the victims, their families, or any other individuals who approach it in connection with the inquiry. AHRC is expected to adopt robust measures akin to witness protection protocols to safeguard the privacy, safety and security of those participating in the process. We say so because the protection of such identities is imperative to create an atmosphere of trust and prevent any fear of reprisal or intimidation. We trust that the AHRC will proceed with the highest degree of sensitivity, impartiality, and diligence, thereby reinforcing public faith in the institutional mechanisms for protecting human rights. 51. Should the AHRC, in the course of its inquiry, form the opinion that a more detailed investigation is warranted to ascertain the facts and circumstances surrounding the alleged encounters, it shall be at liberty to initiate such an investigation through means it deems fit. For this purpose, the AHRC may engage the services of retired or serving police officers of impeccable integrity and unblemished record, provided that such officers are not in any way connected with or subordinate to the police personnel involved in the alleged   \nPage 33 of 36  incidents. The choice of personnel and the manner of conducting such an investigation shall remain within the discretion of AHRC. 52. We direct the State of Assam to extend full cooperation to the AHRC and ensure that all logistical, financial, and administrative requirements for such an investigation are promptly and adequately met. The State is also directed to provide access to records, facilitate the availability of forensic and expert resources, and remove any institutional barriers that may hinder the functioning of AHRC. 53. Furthermore, to ensure that victims and their families are not disadvantaged due to a lack of resources or awareness, we direct the Assam State Legal Services Authority (ASLSA) to make legal assistance available to any such individuals who may seek support in approaching or presenting their case before the AHRC. We direct the Member Secretary of the ASLSA to issue specific instructions to District and Taluk level officers in this regard.  54. In this vein, the Appellant in his capacity as an Advocate, shall be free to represent the victims or their families before the AHRC, if so engaged by them.     \nPage 34 of 36  F. CONCLUSION 55. Considering the totality of the circumstances and for the reasons assigned hereinabove, we deem it appropriate to dispose of the instant appeal with the following directions: a) The Impugned Judgment of the High Court dated 27.01.2023 is set aside; b) The order dated 12.01.2022 passed by the full bench of the AHRC disposing of this issue on the pretext that the subject matter was sub-judice before the High Court is also set aside. This matter is directed to be reinstated on the board of the AHRC for necessary inquiry into the allegations independently and expeditiously, in accordance with law; c) The AHRC is directed to issue a public notice inviting all individuals who claim to be aggrieved (victims and their family members) by the alleged police encounters to come forward and furnish relevant information or evidence before the AHRC. The notice shall be published in at least one national English daily and one prominent vernacular newspapers with wide circulation throughout the State of Assam. The notice shall also include the contact details of the officers of the Taluka and District Legal Services Authorities, thereby enabling the victims and/or their families to access free legal aid;   \nPage 35 of 36  d) AHRC may ensure that the identity of the victims, their families, or any other individuals who approach it in connection with the inquiry shall be strictly confidential. AHRC is expected to adopt robust measures akin to witness protection protocols; e) During the course of its inquiry, if the AHRC forms the opinion that a more detailed investigation is warranted, it shall be at liberty to initiate such an investigation through means it deems fit. For this purpose, the AHRC may engage the services of retired or serving police officers of impeccable integrity and unblemished record, provided that such officers are not in any way connected with the police personnel involved in the alleged incidents; f) The State of Assam is directed to extend full cooperation to the AHRC and ensure that all logistical, financial, and administrative requirements for such an investigation are promptly and adequately met; g) We direct the ASLSA to make legal assistance available to individuals seeking support in approaching or presenting their case before the AHRC for which its Member Secretary is directed to issue specific instructions to the District and Taluk level officers; and   \nPage 36 of 36  h) The appeal is allowed in the above terms. Pending interlocutory applications, if any, are also disposed of.  56. Ordered accordingly.   …..………………… J. [SURYA KANT]    ………..…………………….………………… J. [NONGMEIKAPAM KOTISWAR SINGH]   NEW DELHI DATED: 28.05.2025"
}