{
  "filename": "BATLANKI_KESHAV_(KESAVA)_KUMAR_ANURAG_VS._THE_STATE_OF_TELANGANA.pdf",
  "page_count": 17,
  "content": "2025 INSC 790\nREPORTABLE\nIN THE SUPREME COURT OF INDIA\nCRIMINAL APPELLATE JURISDICTION\nCRIMINAL APPEAL NO(S). 2879 OF 2025 \n(Arising out of SLP (Crl.) No(s). 3316 of 2023)\nBATLANKI KESHAV (KESAVA)\nKUMAR ANURAG                       ….APPELLANT(S)\nVERSUS\nSTATE OF TELANGANA\n& ANR.                                   ….RESPONDENT(S)\nJ U D G M E N T\nMehta, J.\n1.Heard.\n2.Leave granted.\n3.Despite service of notice, respondent No.2- de-\nfacto complainant1 has not put in appearance.\n4.The appellant herein seeks to assail the order\ndated  13th December,  2022,  passed  by  the  High\nCourt  for  the  State  of  Telangana  at  Hyderabad,2\nwhereby the petition3 filed by the appellant under\n1 Hereinafter, being referred to as the ‘de-facto complainant’.\n2 Hereinafter, being referred to as the ‘High Court’.\n3 Criminal Petition No. 1759 of 2022.\n1\nCrl. Appeal @ SLP (Crl.) No(s). 3316 of 2023Section  482  of  the  Code  of  Criminal  Procedure,\n19734 seeking quashing of the FIR bearing Crime\nNo.  103  of  2022  registered  at  the  Police  Station\nMadhapur, Cyberabad, for the offences punishable\nunder Section 376(2)(n) of the Indian Penal Code,\n18605 and Section 3(2)(v) of the Scheduled Castes\nand the Scheduled Tribes (Prevention of Atrocities)\nAct, 1989,6 was rejected.\n5.Succinctly  stated,  the  facts  essential  for\ndisposal of the appeal are noted hereinbelow.\n6.The de-facto complainant i.e., respondent No.2\nfiled  a  complaint  before  Police  Station  Madhapur\nalleging  inter  alia that  she  had  earlier  filed  a\ncomplaint against the accused i.e., appellant herein,\nand  during  the  course  of  enquiry  of  the  said\ncomplaint,  the  appellant  approached  the  police\nstation along with his mother J. Vijayalakshmi and\na resolution was arrived at, between the parties in\nthe presence of the Inspector of Police to the effect\nthat  the  appellant  would  marry  the  de-facto\ncomplainant and get the marriage registered at the\nregistration  office  or  the  Arya  Samaj  Mandir.  A\n4 Hereinafter, being referred to as the ‘CrPC’.\n5 Hereinafter, being referred to as the ‘IPC’.\n6 Hereinafter, being referred to as the ‘SC/ST(POA) Act’.\n2\nCrl. Appeal @   SLP (Crl.) No(s). 3316 of 2023written agreement to this effect was drawn up and\naffirmed  by  the  de-facto complainant  and  the\nappellant by affixing their signatures. However, the\naccused appellant and his mother started showing\nreluctance to the marriage on one pretext or the\nother.  They  made  up  an  excuse  that  the  next\nauspicious date for solemnizing the marriage was\nonly  on  26th August  and  stopped  communicating\nwith the  de-facto complainant or her family about\nwedding arrangements, etc. The accused appellant\nthen  started  mentally  harassing  the  complainant\nwith reference to the complaint she had filed at the\npolice  station.   When  she  expressed  a  desire  to\ndiscuss the wedding arrangements and resolve the\nissues  about  the  family’s  cold  behaviour,  the\naccused appellant went to the de-facto complainant’s\nhouse  on  24th June,  2021  and  compelled  her  to\nindulge in sexual intercourse without ever intending\nto go through with the marriage ceremonies. Being\nperturbed,  the  de-facto complainant  went  to  the\npolice station on 25th June, 2021 and reported that\nthe accused appellant was not keeping his word and\nwas showing reluctance in abiding by the terms of\n3\nCrl. Appeal @   SLP (Crl.) No(s). 3316 of 2023the  agreement.  On  the  same  night,  the  accused\nappellant’s mother called the de-facto complainant’s\nparents.  On 26th June, 2021, the accused appellant\nvisited the de-facto complainant and pressurized her\nto withdraw the complaint and inform the Inspector\nof  Police  that  all  the  allegations  levelled  by  her\nagainst him were false. This incident was reported\nby the de-facto complainant to the SHE Team Police.\nInspite thereof, the accused appellant did not mend\nhis ways and he along with his mother continued to\nharass  the  de-facto complainant  and  raised  new\ndemands about the wedding.\n7.Following  this,  the  de-facto complainant\nexpressed  her  apprehension  to  the  accused\nappellant that she had doubts about his intent to\nmarry her.  She shared the details of the Telangana\nState Government’s marriage registration procedure\nwith the accused appellant, but he refused to pay\nany heed to her. The de-facto complainant then told\nthe accused appellant that if he failed to apply for a\nslot  for  registration  of  their  marriage  as  per  the\nTelangana State Government’s marriage registration\nprocedure, she would be left with no option but to\n4\nCrl. Appeal @   SLP (Crl.) No(s). 3316 of 2023infer that the appellant had no intention of marrying\nher.  Subsequently,  the  accused  appellant  blocked\nthe  de-facto complainant’s calls and messages. On\n29th June, 2021 the mother of the accused appellant\ncalled the  de-facto complainant and gave her false\ninformation that the whereabouts of her son were\nunknown,  and  that  he  had  gone  missing.  Upon\nconfirming  from  reliable  sources,  the  de-facto\ncomplainant came to know that the said information\nwas  patently  false.  She  alleged  that  the  accused\nappellant had no intention of marrying her and he\nalong  with  his  mother  were  manipulating  and\ncheating her.\n8.On this complaint, FIR bearing Crime No. 751\nof 2021 came to be registered at the Police Station\nMadhapur (Guttala), Cyberabad on 29th June, 2021\nfor the offences punishable under Sections 417 and\n420 of IPC and investigation was commenced. The\nanticipatory  bail  application7 preferred  by  the\naccused appellant in connection with the aforesaid\nFIR  came  to  be  allowed  by  the  XV  Additional\nMetropolitan Sessions Judge, Ranga Reddy District\nat Kukatpally vide order dated 30th September, 2021.\n7 Crl. M.P. No. 946 of 2021.\n5\nCrl. Appeal @   SLP (Crl.) No(s). 3316 of 20239.The  de-facto complainant  filed  yet  another\ncomplaint before Police Station Vanitha,  Kozhikode\nCity,  Kerala  which  came  to  be  registered  as  FIR\nbearing Crime No. 13 of 2021 alleging therein that\nthe  complainant  had  come  into  contact  with  the\naccused  appellant  through  ‘Bharath  Matrimony’\nwebsite whilst the accused appellant was residing in\nthe United States of America. They agreed to marry\neach other, and the date of the marriage was fixed\non  6th January,  2021.  However,  the  accused\nappellant avoided the scheduled date and returned\nto the United States of America without marrying\nher.  Upon  coming  back  to  India,  he  established\nsexual  relations  with  the  de-facto complainant\nagainst  her  wishes  in  her  room  located  at\nSubhashini  Nilayam,  Cyberabad  on  multiple\noccasions. These incidents allegedly occurred on 4th\nMay, 2021; 11th May, 2021; 28th May, 2021 and 7th\nJune,  2021.  Thereafter,  the  accused  appellant\nrefused to marry her saying that she belonged to a\nlower  caste.  Since  the  Police  Station  Vanitha  at\nKozhikode  City,  did  not  have  jurisdiction  to\nentertain the said FIR, the same was forwarded to\n6\nCrl. Appeal @   SLP (Crl.) No(s). 3316 of 2023the  Police  Station  Madhapur,  District  Cyberabad\nwhere the impugned FIR bearing Crime No. 103 of\n2022 dated 1st February, 2022, came to be registered\nfor the offences punishable under Section 376(2)(n)\nof IPC and Section 3(2)(v) of SC/ST(POA) Act.\n10.Aggrieved,  the  accused  appellant  preferred\nquashing  petition8 under  Section  482  of  CrPC\nseeking quashment of the FIR bearing Crime No.\n103 of 2022 registered at Police Station Madhapur.\nThe said petition came to be disposed of by the High\nCourt  vide order dated 13th December, 2022, with\nthe following observations: -\n“5. It is not disputed that after registration of the\nCrime No.751 of 2021, the petitioner accused and\nthe  2nd  respondent  complainant  did  not  live\ntogether.  On  the  basis  of  allegations  made  in\nCrime  No.751  of  2021,  the  XV  Additional\nMetropolitan  Sessions  Judge,  Ranga  Reddy\nDistrict at Kukatpally vide Crl.M.P.No.946 of 2021\ngranted  the  relief  of  anticipatory  bail  to  this\npetitioner.\n6. Since the petitioner and de facto complainant\nnever stayed together after the complaint in FIR\nNo.751 of 2021 before Madhapur Police Station\non 29.06.2021, nor any transactions had taken\nplace  in  between  them,  this  Court  deems  it\nappropriate to direct the Investigating Officer in\nrespect of FIR No.103 of 2022 pending on the file\nof Station House Officer, Madhapur Police Station,\n8 CRLP No. 1759 of 2022.\n7\nCrl. Appeal @   SLP (Crl.) No(s). 3316 of 2023Cyberabad, to conclude the investigation without\ntaking any coercive steps against the petitioner-\naccused. Further, the petitioner-accused shall co-\noperate with the Investigating Officer as and when\nrequired for the purpose of investigation.”\n11.The  said  order  is  under  challenge  in  this\nappeal by special leave.\n12.Learned  counsel  appearing  for  the  accused\nappellant has placed on record certain photographs\nof  the  de-facto complainant  depicting  that  she  is\ntrying  to  indulge  in  self-harm.  The  translated\ntranscripts  of  the  call  recordings  purportedly\nexchanged between the accused appellant and the\nde-facto complainant  have  also  been  placed  on\nrecord to buttress the submission that the de-facto\ncomplainant  was  suffering  from  Obsessive\nCompulsive  Disorder  (OCD)  and  was  repeatedly\npressurizing  the  accused  appellant  to  indulge  in\nsexual  relations.  The  bona  fides of  the  accused\nappellant are clear since the very inception and the\nsame is evident from the fact that he had made all\nlogistic  arrangements  for  the  marriage,  including\nbooking of the venue/hotel, etc. However, it was only\nafter observing the aggressive sexual behaviour of\n8\nCrl. Appeal @   SLP (Crl.) No(s). 3316 of 2023the de-facto complainant that the accused appellant\npanicked and was compelled to back out from the\nunion with the de-facto complainant. \n13.Learned counsel further urged that the FIR No.\n751 of 2021 came to be registered by the  de-facto\ncomplainant against the accused appellant on 29th\nJune, 2021. In this FIR, a reference to merely one\nincident dated 24th June, 2021, is made, wherein\nthe  accused  appellant  had  indulged  in  sexual\nrelations  with  the  de-facto complainant.   In  the\nsubsequent  FIR  bearing  Crime  No.  103  of  2022,\nwhich was impugned before the High Court, the de-\nfacto complainant exaggerated and manipulated the\nfacts  and  alleged  that  the  accused  appellant\nindulged  in  forcible  sexual  relations  with  her  on\nmultiple occasions by deceiving her under a false\npromise  of  marriage.  The  incidents  of  sexual\nintercourse which are set out in the impugned FIR\nare dated 4th May, 2021; 11th May, 2021; 28th May,\n2021 and 7th June, 2021. Learned counsel urged\nthat if, at all, any such incident had occurred with\nthe complainant on these dates, she would not have\n9\nCrl. Appeal @   SLP (Crl.) No(s). 3316 of 2023omitted to mention about the same in her previous\nFIR i.e., Crime No. 751 of 2021.\n14.It  was  further  contended  that  the  de-facto\ncomplainant is an educated woman aged 30 years\nand if, at all, any physical relations were established\nbetween her and the appellant, the same were with\nher own free will and consent and there was no\nelement of force, coercion or deception on the part of\nthe appellant.\n15.Learned  counsel  has  also  placed  on  record\nreports  under  Section  173(2)  of  CrPC,  submitted\nafter investigation of FIR No. 751 of 2021 and FIR\nNo. 103 of 2022, by way of additional documents to\npoint out that the complainant is habitual of lodging\nsuch complaints. He thus urged that the High Court\nerred in rejecting the prayer made by the accused\nappellant  to  quash  the  impugned  FIR,  which  is\nnothing short of a gross abuse of the process of law.\n16.Per  contra,  learned  counsel  for  the  State\nopposed  the  submissions  made  on  behalf  of  the\nappellant’s counsel.\n17.Learned  counsel  urged  that  in  the  present\ncase, the accused appellant was acting with  mala\n10\nCrl. Appeal @   SLP (Crl.) No(s). 3316 of 2023fide intention  since  the  very  inception  as  he\ndeveloped  sexual  relations  with  the  de-facto\ncomplainant  on  the  false  promise  that  he  would\nmarry her and later, he resiled from the promise. It\nwas  further  urged  that  as  serious  allegations  of\nforceful  sexual  relations  are  levelled  against  the\naccused appellant, this Court should refrain from\nentertaining the prayer of quashing of the FIR made\non behalf of the accused appellant.\n18.We  have  heard  and  considered  the\nsubmissions advanced by learned counsel for the\naccused appellant and learned counsel representing\nthe respondent-State.\n19.At the outset, we may note that the police has\nalready submitted a closure report dated 6th June,\n2024,  in  FIR  No.  751  of  2021  whereas,  a\nchargesheet dated 30th August, 2024, has been filed\nin FIR No. 103 of 2022. The closure report in the\nFIR  No.  751  of  2021  which  has  been  placed  on\nrecord, indicates that previously also, i.e., on 23rd\nJanuary, 2019, the de-facto complainant had lodged\na similar complaint at the Police Station, Osmania\nUniversity, Hyderabad City accusing one ‘Dr. Ranjit\n11\nCrl. Appeal @   SLP (Crl.) No(s). 3316 of 2023Thankappan’,  who  at  the  time  was  working  as\nAssistant  Professor  in  the  Department  of\nCommunication at Osmania University, for identical\nallegations of cheating and sexual exploitation on\nthe pretext of a false promise of marriage.\n20.With reference to the aforesaid findings, it was\ncontended on behalf of the accused appellant that\nthe de-facto complainant is habitual of lodging such\ncomplaints and has falsely implicated the accused\nappellant in the present FIR for oblique motives.\n21.The  respondent-State  has  filed  a  counter\naffidavit  wherein  it  is  stated  that  the  police  has\nfound  the  offences  proved  against  the  accused\nappellant after thorough investigation of FIR No. 103\nof 2022. However, the pertinent assertions made in\nthe  petition  regarding  the  de-facto complainant\nsuffering from Obsessive Compulsive Disorder, her\nthreats  of  self-harm  and  the  genuineness  of  the\ntranscriptions of the chats which took place between\nthe accused appellant and the de-facto complainant\nhave not been disputed/denied.\n22.Upon appreciating the facts and circumstances\nnarrated  above  and  having  given  thoughtful\n12\nCrl. Appeal @   SLP (Crl.) No(s). 3316 of 2023consideration to the allegations as set out in the FIR\nand  the  chargesheet  placed  on  record  by  the\naccused appellant, we find that there is no material\nwhat  to  say of  prima  facie material  on record to\nsubstantiate the allegations of cheating or sexual\nintercourse  under  a  false  promise  of  marriage\nagainst  the  accused  appellant.  The  allegations\nlevelled in FIR No. 751 of 2021, dated 29th June,\n2021, and the impugned FIR No. 103 of 2022 are at\ngreat variance and the inherent contradictions in\nthe two reports over the same subject matter cannot\nbe reconciled.\n23.The de-facto complainant is a highly educated\nwoman aged 30 years. In FIR No. 751 of 2021, she\nhas only alleged about a single sexual encounter\ndated  24th June,  2021.  On  the  contrary,  in  the\nimpugned FIR No. 103 of 2022 which came to be\nlodged on 1st February, 2022, 4-5 such incidents\nhave been referenced each of which  ante-date the\nFIR  No.  751  of  2021.  It  is  thus  inherently\nimprobable  that  the  complainant  would  have\nforgotten or omitted to mention these incidents of\nsexual intercourse made under a false promise of\n13\nCrl. Appeal @   SLP (Crl.) No(s). 3316 of 2023marriage while filing the earlier FIR No. 751 of 2021\nbecause all the incidents had already taken place as\nper the version of the complainant up to 7th June,\n2021 whereas, the FIR No. 751 of 2021 came to be\nlodged on 29th June, 2021. \n24.A  very  interesting  fact  which  emerges  upon\nperusal of the closure report in FIR No. 751 of 2021\nis that the de-facto complainant had filed a similar\nFIR  against  an  Assistant  Professor  of  Osmania\nUniversity, where she was studying. \n25.In the chats which have been placed on record\nalong with the additional documents, the  de-facto\ncomplainant, who is referred to by the name ‘Muffin’,\nhas admitted that she was manipulative and was\ntrying to “get a green card holder”. At one point of\ntime, she also stated that it would not be difficult for\nher to trap the next one. In the very same breath,\nshe mentions that she would not waste time with\nthe accused appellant and needs to “invest on the\nnext  victim”.  She  also  mentions  that  she  would\nirritate her victims to the extent that they dump her,\nand she could happily start with the next one. She\n14\nCrl. Appeal @   SLP (Crl.) No(s). 3316 of 2023also  stated  that  she  was  using  the  accused\nappellant.\n26.These chats depict the stark reality about the\nbehavioral pattern of the  de-facto complainant who\nappears to be having manipulative and vindictive\ntendency.\n27.Thus, in our opinion, the accused appellant\nwas absolutely justified in panicking and backing\nout  from  the  proposed  marriage  upon  coming  to\nknow of the aggressive sexual behaviour and the\nobsessive nature of the de-facto complainant. \n28.Hence,  even  assuming  that  the  accused\nappellant retracted from his promise to marry the\ncomplainant, it cannot be said that he indulged in\nsexual  intercourse  with  the  de-facto complainant\nunder a false promise of marriage or that the offence\nwas  committed  by  him  with  the  de-facto\ncomplainant on the ground that she belonged to the\nScheduled Castes/Scheduled Tribes community.\n29.It is also relevant to mention here that in FIR\nNo. 751 of 2021, the  de-facto complainant has not\neven made a whisper about the accused appellant\ndumping  her  on  the  ground  of  her  caste.  Thus,\n15\nCrl. Appeal @   SLP (Crl.) No(s). 3316 of 2023apparently this allegation which has been set out in\nthe subsequent FIR No. 103 of 2022 lodged almost\nafter  seven  months  is  nothing  but  a  sheer\nexaggeration which must be discarded.\n30.Having  considered  the  entirety  of  facts  and\ncircumstances as available on record, we are of the\nfirm  opinion  that  allowing  prosecution  of  the\naccused appellant to continue in the impugned FIR\nNo. 103 of 2022 would be nothing short of a travesty\nof justice in addition to being a gross abuse of the\nprocess of Court. The impugned FIR No. 103 of 2022\nis nothing but a bundle of lies full of fabricated and\nmalicious  unsubstantiated  allegations  levelled  by\nthe  complainant.  The  facts  on  record  clearly\nestablish the vindictive and manipulative tendencies\nof the complainant and these aspects have a great\nbearing on the controversy. \n31.Resultantly, FIR bearing Crime No. 103 of 2022\ndated 1st February, 2022, FIR bearing Crime No. 751\nof 2021 dated 29th June, 2021, and all proceedings\nsought to be taken as a consequence thereof, are\nquashed in entirety.\n16\nCrl. Appeal @   SLP (Crl.) No(s). 3316 of 202332.The appeal is allowed accordingly.\n33.Pending  application(s),  if  any,  shall  stand\ndisposed of.\n….……………………J.\n                            (VIKRAM NATH)\n...…………………….J.\n                               (SANDEEP MEHTA)\nNEW DELHI;\nMAY 29, 2025.\n17\nCrl. Appeal @   SLP (Crl.) No(s). 3316 of 2023"
}