{
  "filename": "CHANDIGARH_ADMINISTRATION_VS._REGISTRAR_GENERAL,HIGH_COURT_OF_PUNJAB_AND_HARYANA.pdf",
  "page_count": 31,
  "content": "2025 INSC 786\n1 \n  \nREPORTABLE  \n \nIN THE SUPREME COURT OF INDIA  \nCIVIL  APPELLATE JURISDICTION  \n \nCIVIL APPEAL NO(S).            OF 2025   \n(Arising out of SLP (C ivil) No(s).  162-163 of 2025 ) \n \nCHANDIGARH ADMINISTRATIO N ..APPELLANT(S)  \n \nVERSUS  \n \nREGISTRAR GENERAL, HIGH  \nCOURT OF PUNJAB AND  \nHARYANA, CHANDIGARH  \nAND OTHERS          ….RESPONDENT(S)  \n \n \nWITH  \n \nCIVIL APPEAL NO(S).            OF 2025  \n(Arising out of SLP (C ivil) No(s).  9042 -9043  of 2025 ) \n \nJ U D G M E N T  \nMehta, J.  \n1. Heard.  \n2. Leave granted.  2 \nC.A. @ SLP ( C) No(s). 162 -163 of 2025  with connected matters  3. Chandigarh Administration1 is in appeal \nagainst the orders date d 29th November, 2024; 13th \nDecember, 2024; 7th February, 2025 ; and 21st \nFebruary, 2025  passed by the High Court of Punjab \nand Haryana at Chandigarh2 in a public interest \nlitigation3 whereby the High Court directed as below: - \n \n“Order dated 29th November, 2024  \nConstruction of Verandah in front of Court \nRoom No.1  \nSubmissions  \nLearned Senior Standing Counsel for UT \nAdministration informs that proposed map of the \nVerandah covering outside of Court Room No.1 has \nbeen sent to Archaeological Survey of India for \napproval: It is also informed that in the 24th \nmeeting of Chandigarh Heritage Conservation \nCommittee (CHCC) held on 19.09.2024 in -\nprinciple proposal was granted for construction of \nthe said Verandah in front of Court Room No.1 \nsubject to contacting Foundation Le Corbusier \nParis for sharing the require d drawings/data \nrelated to this project.  \nThis Court on 13.11.2024 had refrained from \nissuing any direction in the backdrop of assurance \nthat Chandigarh Heritage Conservation Committee \nare being consulted and the UT Administration \nafter due consultation shall revert back within 10 \ndays. This Court  had passed a preemptory order \nthat in case, the aforesaid assurance does not turn \n \n1 Hereinafter, referred to as the ‘CA’  or “appellant” . \n2 Hereinafter, referred to as the “High Court”.  \n3 Civil Writ Petition (Public Interest Litigation) No. 9 of 2023 (O&M).  3 \nC.A. @ SLP ( C) No(s). 162 -163 of 2025  with connected matters  out to be true by the next date of hearing, then this \nCourt will be compelled to issue a writ of \nmandamus to the UT Administration for \nconstruction of verandah in front of Court Room \nNo.1, which is dire need of the hour.  \nDirections  \nA writ of mandamus is issued to UT \nAdministration to start construction of \nverandah in front of Court Room No.1 in line \nwith and of the same type as already exists in \nfront of Court Rooms No. 2 to 9, within a period \nof two weeks and complete the process of  \nconstruction within four weeks thereafter.  \nOrder dated 13th December, 2024  \nConstruction of verandah in front of Court \nRoom No. 1  \nOn the last date of hearing, in this regard, a Writ \nof Mandamus was issued directing the U.T. \nAdministration to start construction of verandah \nin front of Court Room No. 1 in line with and of the \nsame type as already existing in front of Court \nRooms No. 2 to 9 within a period of two weeks and \ncomplete the process of construction within four \nweeks thereafter.  \nDespite lapse of two weeks from the last date of \nhearing, no effort has been taken by the U.T. \nAdministration to show that the process of \nconstruction has commenced.  \nAs such, this Court directs the Registry to \nimplead Shri C.B. Ojha, Chief Engineer, U.T. \nAdministration as party and on doing so \ncontempt notice be issued against Shri C.B. \nOjha to explain as to why contempt proceedings \nbe not commenced and he be not punis hed for 4 \nC.A. @ SLP ( C) No(s). 162 -163 of 2025  with connected matters  causing contempt of Writ of Mandamus issued \non 29.11.2024.  \nOrder dated 7th February, 2025  \n          (As regards Kutcha Parking)  \nIt is informed by learned counsel for the High \nCourt that on the suggestion made by this Court \nunder this head vide order dated 24.01.2025, the \nBuilding Committee was unsuccessful in \nconvincing the U.T. Administration to allow green \npavers to be laid in th e area of kutcha  parking with \nadequate number of trees to be planted so that the \ngreen cover can be restored and the vacant space \ncan be used for parking purposes.  \n \nThis Court is of the considered view that the \nsuggestion made by this Court on earlier occasion \nfor restoration of green cover and simultaneously \nlaying green pavers for parking was not only \nreasonable but a step towards sustained \ndevelopment.  \n \nThere is extreme shortage of parking space in the \nopen areas provided for parking behind the \nheritage building of Punjab and Haryana High \nCourt. On any given hour, during working session \nof the High Court, about 3000 -4000 four wheelers \ndaily visit the High  Court out of which at least \n2000; if not more, are permanently parked. The \nexisting underground multilevel parking which \nhas three tiers can accommodate only 600 four \nwheelers while the remaining vehicles are parked \nin the open parking areas which also fa ll short and \ntherefore, there is need to use the kutcha parking \narea which is opposite the three tiers multilevel \nunderground parking.  \n \nThe green pavers are meant to allow water to \npercolate down to replenish ground level water and \ntherefore, are much beneficial and eco - friendly as 5 \nC.A. @ SLP ( C) No(s). 162 -163 of 2025  with connected matters  compared to pavements or roads. In this manner, \nthe objection of U.T. Administration that the said \narea of kutcha parking is earmarked within the \ncapital complex as a green belt/forest, will also be \ntaken care of and the dire need for parking space \ncan be satisfied. More so, the plantation of at least \n200 or more trees in the said kutcha parking is \npossible to increase the green cover and facilitating \nthe four wheelers to be parked.  \n \nDespite the U.T. Administration having made \navailable the additional parking space of about \n200 four wheelers near the junction of Janmarg \nand Uttar Marg, the said facilitation does not \nresolve the problem of acute shortage of space \nfor parking within the High Court premises. As \nsuch, this Court is constrained to pass the \nfollowing directions as regards kutcha parking: -   \n \nWrit of mandamus is issued to the U.T. \nAdministration to lay green pa vers in the \nkutcha parking and plant sufficient number of \ntrees at reasonable intervals with tree guards \nproviding space for parking and allow this \nkutcha parking to be used for parking of four \nwheelers visiting the High Court  \nOrder dated 21st February, 2025  \n(Dismissing application seeking recall of order \ndated 7th February, 2025)  \n3. From a bare perusal of the aforesaid extract of \nthe order dated 07.02.2025 pertaining to kutcha \nparking, it is obvious that this Court had dwelt \nupon all the pros and cons and the acute problem \nof dire scarcity of space for parking in the High \nCourt pre mises before passing the said order. This \nCourt had also, taken note of the anxiety expressed \nby the U.T. Administration that the said area of \nkutcha parking is notified as a green belt while \ndirecting that the kutcha parking space, which is \npresently denu ded of trees, will not only be laid 6 \nC.A. @ SLP ( C) No(s). 162 -163 of 2025  with connected matters  with green pavers, but also plantation of 100 to \n200 trees will take place, so that the green belt is \npreserved and so also the need for parking is \ncatered to.  \n \n3.1 In the considered opinion of this Court, the \norder passed by this Court on 07.02.2025 \nfacilitates sustained development and, \ntherefore, is rather in the interest of the U.T. \nAdministration and would greatly help in \nresolving the crisis of acute shortage of parking \nspace in the High Court.  \n \n4. Consequently, no ground for recalling of the \norder dated 07.02.2025 is made out and, \ntherefore, CM -49-CWPIL -2025 in CWP -PIL-9-\n2023 stands dismissed. ” \n \n4. Addressing the first issue regarding \nconstruction of verandah in front of Court Room No. \n1 of the High Court, Shri Tushar Mehta, learned \nSolicitor General of India, appearing for the CA \nvehemently and fervently urged that the \nadministration does not have any quarrel in principle \nwith the proposed construction of the verandah in \ncompliance of the order dated 29th November, 2024 \npassed by the High Court. However, the \nadministration is concerned with imminent \npossibility of the loss of World Heritage status of  the \nChandigarh Capitol Complex,  which includes the \nAssembly, the High Court and the Secretariat , 7 \nC.A. @ SLP ( C) No(s). 162 -163 of 2025  with connected matters  designed by the celebrated architect,  Mons . Le \nCorbusier, who plan ned the entire city of \nChandigarh . It is a matter of grave concern to the CA \nthat the High Court building forms part of the \nUNESCO4 World Heritage Site, and it may loose its \nWorld Heritage status owing to unauthorized  \ndeviation/modification in its façade /structure .   \n5. He submitted  that the Chandigarh Capitol \nComplex which includes the High Court building, \nwas designated as a UNESCO World Heritage Site in \nthe year 2016 as a part of the Trans -Border Serial \nNomination for the Architectural Works of Mons . Le \nCorbusier,  which consists of 17 sites spread across 7 \ncountries. As per the applicable guidelines, any \nproposed changes in the World Heritage Site are to be \ncommunicated to the World Heritage Committee, \nUNESCO in advance and their concurrence is to be \nsought, failing which , there is a risk of the site losing \nits World Heritage status.  \n6. Shri Mehta  urged that CA has already \ncommunicated with the Foundation Le Corbusier, \n \n4 United Nations Educational, Scientific and Cultural Organization.  8 \nC.A. @ SLP ( C) No(s). 162 -163 of 2025  with connected matters  Paris  and the World Heritage Committee , UNESCO,  \nto forward  the original maps of the High Court \nbuilding so that the issue of constructing the \nverandah can be  proactively  examined and a \nconsidered decision can be taken without posing any \nthreat to the World Heritage status of the High Court \nbuilding . \n7. Shri Mehta submitted that the CA is also alive \nto the situation that the open area in front of Court \nRoom No. 1 of the High Court building is exposed to \nthe elements. CA does not  dispute the fact that \nlitigants and lawyers who use this area have no \nprotection from sun, wind s and rain. He urged that it \nwould not cause any harm if the matter could  be \ndeferred by a few weeks so as to give some breathing \nspace to the CA for procuring the requisite  \npermissions.  \n8. It was contended  that the authorities have been  \nable to procure  hand drawn maps prepared by Mons . \nLe Corbusier  wherein there is no provision for a \nverandah in front of Court  Room No. 1 of the High \nCourt building  which is an integral part of the World \nHeritage Site .  9 \nC.A. @ SLP ( C) No(s). 162 -163 of 2025  with connected matters  9. He thus, urged that the Division Bench of High \nCourt was not justified in exercising its extraordinary \nwrit jurisdiction so as to issue a writ of manda mus \ndirecting  change s in the façade of the building \nwithout waiting for the requisite permission s from \nthe World  Heritage  Committee, UNESCO . \n10. For finding a logical solution to th e problem  of \nexposure , the Department of Urban Planning , Indian \nInstitute of Technology  (IIT), Roorkee (Uttarakhand) \nhas been  requested to conduct Heritage Impact \nAssessment (HIA) of the proposed verandah and to \nprovide a suitable design which, in turn, would be \nforwarded to the World Heritage Committee , \nUNESCO  for approval and only thereafter, can the \nidea of constructing  a verandah over the said area \ncan be materialized  while protecting the World \nHeritage status  of the Chandigarh Capitol Complex  \nwhich includes the High Court building . \n11. Shri Mehta also drew the Court’s attention to \nthe mail forwarded by the Architect of C A to the \nArchitect at Foundation Le Corbusier , Paris, \nrequesting for the drawing plans of the original \nbuilding so that the alterations, if any, could be 10 \nC.A. @ SLP ( C) No(s). 162 -163 of 2025  with connected matters  undertaken by adhering to the protocols and \nguidelines as applicable to the World Heritage Sites \nand to ensure that the authenticity of  Outstanding \nUniversal Value5 of Chandigarh Capitol Complex of \nwhich the High Court building  is an integral part, can \nbe maintained.  \n12. Regarding the issue of the green paver blocks \nfor creation of parking space in the open area near \nthe High Court building as directed by the Division \nBench, it was the contention of Shri Mehta that this \nopen area is part of the green belt under the \nChandigarh Master Plan , 2031  and can be used for \nplanting trees only and n o deviation is permissible \nunder the Master Plan. Shri Mehta urged that the \nimportance of vertical greenery in the city of \nChandigarh cannot be understated and if the green \npaver blocks as proposed in the impugned order  \ndated 7th February, 2025  are affixed on this open \nspace , the very character of the green belt area will \nbe altered irreversibl y thereby eliminating any \npossibility of restoring vertical  green cover on the said \nland.  \n \n5 Hereinafter, referred to as “OUV”.  11 \nC.A. @ SLP ( C) No(s). 162 -163 of 2025  with connected matters  13. Shri Mehta  urged that the CA is taking proactive \nmeasures to sort out the issue of providing parking \nspaces  for the lawyers and other visitors to the Court \nComplex and it has proposed to plant sufficient \nnumber of trees with green guards on the subject  \nland area at regular  intervals thereby providing  green \ncover for the vehicles to be parked in that space.   \n14. Shri Mehta  further submitted that the writ \npetitioner had earlier sought a mandamus for the \nconstruction of multi -level parking on the aforesaid \nopen area . However, during the 45th Session of the \nWorld Heritage Committee , UNESCO  at Riyadh \nConference, a recommendation was made on 6th \nOctober, 2024  that the said project shall be \nsuspended in view of the  negative impacts resulting \nfrom the HIA reports , which recommended finding \nalternative solution s for ensuring that the OUV of the \nproperty is not impacted .  \n15. Shri P.S. Patwalia, learned senior counsel \nappearing as Amicus Curiae, also supported the \nsubmissions advanced by learned Solicitor General, \nShri Tushar Mehta. He submitted that  the very same \nproposal was put up in the year 1956 when the then 12 \nC.A. @ SLP ( C) No(s). 162 -163 of 2025  with connected matters  Chief Justice turned down the suggestion of the \nSuperintending Engineer of the Capitol Project, \nChandigarh to construct an additional verandah in \nfront of Court Room No. 1. He urged that the \nadministration retracted  the said proposal on the \ninstructions of the Chief Justice and thus, no \ndeviation  is permissible . The decision  once taken at \nthe appropriate level  cannot be reviewed in exercise \nof the writ jurisdiction.  \n16. Shri Nidhesh  Gupta , learned senior counsel \nappearing on behalf of the High Court \nadministration,  has supported the impugned orders. \nHe urged that as per paragraph 172 of the \nOperational Guidelines for the Implementation of the \nWorld Heritage Convention6, relied upon by the CA in \nits additional affidavit dated  5th May, 2025 , \nrestriction is placed  on major restorations or new \nconstructions  which may affect the OUV of the \nproperty. The convention requires that notice should \nbe given, as soon as possible, before drawing up  the \nbasic documents for specific projects and before \nmaking any decisions ‘that would be difficult to \n \n6 For short “Operational Guidelines” . 13 \nC.A. @ SLP ( C) No(s). 162 -163 of 2025  with connected matters  reverse ’, so that the Committee may ass ist in seeking \nappropriate solutions and ensure that the OUV of the \nproperty is fully preserved.   \n17. Shri Gupta submitted that the Court Room Nos. \n2 to 9, which  are in the same  alignment  as the Court \nRoom No. 1, already  have a pre-existing verandah \nwhich is  12 feet high and provides wholesome \nprotection from sun, wind s and rain, etc. to the \nstakeholders, i.e., the litigants , lawyers , etc. who \nfrequent  the High Court  premises . The proposal to \nconstruct a verandah in front of Court Room No. 1  \nwas approved by the Division Bench after extensive \ndeliberations and taking opinions from experts. The \nproposed verandah would be exactly in sync and \nalignment  with the pre-existing  verandah in front of \nCourt Room Nos. 2 to 9 and will not have any adverse \nimpact on the OUV of the World Heritage Site. He \nurged that  paragraph  172 of the Operational \nGuidelines only provide s that any major restorations \nor new constructions which may affect the  OUV of the \nproperty and are irreversible should be undertaken \nafter due approval from the World Heritage \nCommittee , UNESCO . 14 \nC.A. @ SLP ( C) No(s). 162 -163 of 2025  with connected matters  18. Shri Gupta submitted that the verandah \nproposed to be constructed cannot be said to be a \npermanent structure which cannot be removed. \nHence, the additional verandah cannot be termed to \nbe a structure which can never be removed and the \ndecision is not irreversible.  \n19. Shri Gupta further referred to the letter dated \n17th May, 1956 placed on record by the CA along with \nthe additional affidavit  dated  5th May, 2025  wherein \nit is clearly provided that the construction of the \nadditional verandah in front of Court Room No. 1 \nsimilar to the verandah in front of the small er Court \nRooms  i.e., Court Room Nos. 2 to 9  had been \nproposed  by Chandigarh Administration and refers to \na suggestion made by the Architect Mons . Le \nCorbusier. The proposal was forwarded to the High \nCourt and the then Chief Justice  acting  in his \npersonal capacity turned down the proposal on the \nground that it would cause disturbance in the Court  \nwork as p eople would collect in front of the main \nCourt Room i.e., Court Room No. 1 and chat.   \n20. Shri Gupta submitted that this observation as \nresonating  in the letter dated 17th May, 1956 was 15 \nC.A. @ SLP ( C) No(s). 162 -163 of 2025  with connected matters  based on the personal perception  of the Chief Justice  \nand was a decision taken after consultation in the full \nCourt . It is not such a decision which  cannot be \nreviewed  even on the administrative side . He \nsubmitted that the dynamics of Court functioning \nhave altered  significantly over the last 70 years,  and \nthe High Court administration felt a dire need to \nprovide a verandah for the stakeholders.  He further \nsubmitted that the verandah would be of immense \nhelp in preserving  the structure  and ambience of  \nCourt Room No. 1 as it would protect the same from \nthe elements.   Shri Gupta pointed out that there have \nbeen numerous instances when rainwater  seeped \ninto Court Room No. 1 owing to the lack of protective \ncovering  thereby damaging the interiors  and caused \nsevere inconvenience in the functioning  of the Court . \n21. Regarding the aspect of green paver blocks, Shri \nGupta urged that on any given working day, almost \n3000 to 4000 vehicles of advocates, litigants and \nofficials are being parked in the open area where the \nHigh Court has directed the laying of the green paver \nblocks. He urged that by their very design,  the green \npaver blocks merge with the natural surroundings  16 \nC.A. @ SLP ( C) No(s). 162 -163 of 2025  with connected matters  and they allow rainwater to percolate  into the ground. \nThe significant advantage s which would be gained by  \nlaying of such blocks are (i) eliminating the possibility \nof blowing of dust and sand because of frequent \nmovement of the vehicles on the open area; and (ii) \neliminating the possibility of formation of sludge and \nmuddy surface s during rainy season.  \n22. Shri Gupta urged that the submission  of \nlearned Solicitor General that a parking area can be \ncreated  by planting trees on the open land can still \nbe visualized  by ensuring  that same number of trees \nare planted at regular intervals between the green \npaver blocks.  \n23. Shri Gupta thus urged that no interference is \ncalled for in the impugned orders which were passed  \nafter objective  consideration  of all the prevailing \nfacts, after seeking scientific opinion and analyzing  \nthe ground realities.  \n24. We have given ou r thoughtful consideration  to \nthe submissions advanced at the bar  and have gone \nthrough the impugned orders passed by the High \nCourt .   17 \nC.A. @ SLP ( C) No(s). 162 -163 of 2025  with connected matters  25. In compliance with the order dated 9th May, \n2025  passed by this Court , Shri Nidhesh  Gupta, \nlearned senior counsel appearing on behalf of the \nHigh Court administration, has filed written \nsubmissions. However, d espite opportunity being \ngranted by this Court, the CA (appellant herein) has \nnot filed its written submissions.  \n26. We shall deal with the two issues arising from \nthe impugned orders separately.  \nA. Issue of construction of verandah in front of \nCourt Room No. 1  \n27. The most fervent submission of learned Solicitor \nGeneral appearing for the CA (appellant herein) , in \nassailing  the order s passed by the High Court was \nthat the same may lead to the structure of the High \nCourt and the Chandigarh Capitol Complex losing \nthe World Heritage status.  In support of this \ncontention, an additional affidavit has been filed \nannexing therewith  extract of paragraph 172 of the \nOperational Guidelines which is quoted \nhereinbelow: - \n“172- The Word Heritage Commi ttee invites the \nStates Parties to the Convention to inform the 18 \nC.A. @ SLP ( C) No(s). 162 -163 of 2025  with connected matters  Committee, through the Secretariat, of their \nintention to undertake or to authorize in an area \nprotected under the Convention major restorations \nor new constructions which may affect the \nOutstanding Universal Value of the property. \nNotice should be given a s soon as possible (for \ninstance, before drafting basic documents for \nspecific projects) and before making any decisions \nthat would be difficult to reverse, so that the \nCommittee may assist in seeking appropriate \nsolutions to ensure that the Outstanding Un iversal \nValue of the property is fully preserved.”  \n \n28. A careful and holistic perusal of the aforesaid \nguidelines would indicate that the OUV of the \nproperty is likely to be affected  if major restorations \nor new constructions are attempted on the structure  \nhaving World  Heritage status . The guidelines  give a \nclear indication  that the decision should not be such \n‘that it  would be difficult to reverse ’. \n       [Emphasis supplied]  \n29. At this stage, we may refer to  the letter dated \n17th May, 1956 placed on record by the appellant , i.e., \nthe CA along with an additional affidavit . The said \nletter was forwarded by the Senior Architect  of the \nGovernment of Punjab, Capitol Project to the \nSuperintend ing Engineer, Capitol Project, \nChandigarh , and is extracted below:  - 19 \nC.A. @ SLP ( C) No(s). 162 -163 of 2025  with connected matters  “                                     D.O. No. 168 -Arch 56/ \n2664  \nDated Chandigarh 17th May 56.  \nSubject: High Court Building - Additional \nVerandah in front of the Main Court Room.  \n                                         …………………..  \nMy dear Mr. Khanna,  \n       Kindly refer to our discussion on the above \nmentioned  subject.  \n2. You proposed that an additional verandah \nsimilar to the verandah in front of the small \ncourt room suggested by Mons : Le Corbusier, \nshould be constructed in front of the main court \nroom as well.  \n3. On 14th instant,  Mr. A.N. Bhandari, Chief Justice,  \ndesired me to send my assistant Mr. Malhotra to \nhim to explain some of the drawings which we had \nsent him. I am told by Mr. Malhotra that during the \nexplanation of the drawings, the Chief Justice \ndesired not to have any verandah in front of the \nmain court room as he thought that it would cau se \ndisturbance in his work because the people would \ncollect in front of the main court room and chat. He \nis of the opinion that the people who will be waiting \nfor the next hearing in his court could wait in the \nnew verandah which is to be built in front of  the \nsmall court.  \n      Keeping in view the desire of the Chief Justice, \nI think we should not change at this stage the \noriginal proposal made by Mons : Le Corbusier.  \nYours Sincerely,  \n                                                                   Sd/- \n(Pierre Jeanneret)  \nMr. G.C. Khanna,  \nSuperintending Engineer,  20 \nC.A. @ SLP ( C) No(s). 162 -163 of 2025  with connected matters  Capital Project, Chandigarh.  \n                      ……………………..  \nNo: 168 -Arch-56/2665           Dated the 17th May, \n1956.  \nA copy is forwarded to the Registrar, Punjab, High \nCourt of Judicature, Chandigarh, for the \ninformation of the Hon'ble the Chief Justice.  \nSd/- \n(Pierre Jeanneret)  \nSenior Architect to Govt. Punjab,  \nCapital Project.  \n ……………………… ..       ” \n[Emphasis supplied]  \n30. The letter makes clear reference to the fact that \nthe construction of an additional verandah  in front of \nmain Court Room, i.e., Court Room No. 1  similar to \nthe verandah in front of the small Court Rooms was \nin consideration of the Government authorities way \nback in 1956 . It is a different story that the then Chief \nJustice of the High Court proceeded to turn down the \nsaid proposal based on his personal perception  \nwithout any collective discussion . \n31. Hence, we have no doubt in our minds that the \nconstruction of the verandah in front of the main \nCourt Room i.e., Court Room No. 1 was being mooted \nby the Concerned Authority  way back in 1956  and 21 \nC.A. @ SLP ( C) No(s). 162 -163 of 2025  with connected matters  had the Chief Justice consented, the construction \nwould have happened long back . The only  contention \nof the appellant for  opposing the construction of the \nverandah is that the request to approve the proposal \nfor raising the verandah has already been forwarded \nto the Foundation Le Corbusier , Paris  but reply has \nnot been received till date. Learned Solicitor General, \nShri Mehta was very fair and candid in his \nsubmissions that the CA is not agitating this issue as \nan adversarial  litigation and the only concern of the \nauthorities is that the building may loose its O UV and \nconsequently the World Heritage status, if the \nverandah is constructed without procuring the \nrequisite permissions  from the World Heritage \nCommittee, UNESCO . \n32. On going through the record, we find that none \nof the documents  placed on record by the appellant \ngive any indication to the effect that till date any \ncommunication has  actually  been made either with \nthe Foundation Le Corbusier, Paris or the World \nHeritage Committee , UNESCO,  seeking permission to \nraise construction of the verandah  in front of the \nmain Court Room i.e., Court Room No. 1 . 22 \nC.A. @ SLP ( C) No(s). 162 -163 of 2025  with connected matters  33. The proposal given by Shri Patwalia, learned \nsenior counsel that till the approval is received from \nthe Foundation Le Corbusier, Paris and the World \nHeritage Committee,  UNESCO,  a temporary \ntin/metal  shed can be put up in front of Court  Room \nNo. 1 does not merit consideration.  Putting up any \nsuch contraption  in front of Court  Room  No. 1 would \ncompletely destroy the aesthetic value of the High \nCourt building.  \n34. We are satisfied with the submission of Shri \nGupta appearing for the High Court administration \nthat even as per paragraph 172 of the Operational \nGuideline s, construction of the verandah in front of \nCourt Room No. 1  in alignment with the pre-existing \nverandah s in front of the Court Room Nos. 2 to 9 , \nwould not violate the aforesaid guidelines because \nneither such verandah can be said to be a major \nrestoration nor a new construction within  the main \nstructure of the High Court  building.   \n35. Going by the pictures of the building placed on \nrecord, we find that the pre-existing  verandahs in \nfront of Court Room Nos. 2 to 9 are in the form  of \nprojections supported by steel /metal  pipes.  23 \nC.A. @ SLP ( C) No(s). 162 -163 of 2025  with connected matters  36. Needless to state, that the modern architectural \ntechniques have progressed by leaps and bounds. \nNew construction materials and techniques are \navailable in the market which can be employed to \nconstruct a verandah in front of Court  Room No. 1 \nexactly identical to the one which is existing in front \nof Court Room Nos. 2 to 9 without disturbing the \naesthetic value of the main structure  and without \nrequiring any kind of modification/alteration in the \nmain structure . The additional verandah  can even be \nin the form  of a collapsible /removable structure , if so \nrequired. This can be easily achieved  by using \nservices of experts from  IIT, Roorkee [It may be \nmentioned here that the administration itself, on the \nissue of green paver blocks, has taken the expert \nopinion  from IIT, Roorkee ]. Such an addition would \nunquestionably not violate the mandate of paragraph \n172 of the Operational Guidelines ( supra ) thereby \nposing a risk to the OUV of the High Court building.  \n37. The reasons for the construction of the \nverandah have been highlighted in the order of the \nHigh Court and we have no reason to take a different \nview. The High Court administration is best placed to 24 \nC.A. @ SLP ( C) No(s). 162 -163 of 2025  with connected matters  take a suitable decision as to what are the precise \nrequirements for preservation of the building and \nsimultaneously provide protection to the \nstakeholders from the elements. It cannot be gainsaid \nthat t he High Court administration is under an \nobligation to provide  appropriate facilities for the \nlawyers and the litigants  who throng the Courts . The \ncoloured photographs of the building taken during \nthe working hours of the Court demonstrate  that \nwhile Court Room Nos. 2 to 9, which have  the pre-\nexisting  verand ahs, provide  shelter to the lawyers \nand litigants  and at the same time  the area in front \nof the Court Room No. 1 is unprotected and exposes \nthe lawyers  and the litigants  to sun, wind s and rain . \n38. Shri Gupta pointed out that during heavy \nrainfall, rainwater  seeps into the  Court Room No. 1  \nbecause  the lack of the protective projection makes it \ndifficult to prevent the inflow of water into the Court \nroom .   \n39. In view of the above discussion , we are of the \nview that the decision of the High Court in directing \nconstruction of the verandah in front of Court Room \nNo. 1 in alignment with the design of the pre -existing 25 \nC.A. @ SLP ( C) No(s). 162 -163 of 2025  with connected matters  verandah s in front of Court Room Nos. 2 to 9 is \nabsolutely justified and would not violate the \nUNESCO guidelines. At the same time,  if so required,  \nthe administration would not be precluded from \nseeking ex-post facto  approval for this minimal \nprotective measure  which is considered necessary \nwithout admitting any exception . The impugned \norder s dated 29th November, 2024 and 13th \nDecember, 2024 do not warrant interference by this \nCourt in exercise of jurisdiction  under Article 136 of \nthe Constitution of India.  \nB. Laying of green p aver blocks  in open parking \narea \n40. Now, coming to the aspect of laying green paver \nblocks on the open land in front of the High Court \nbuilding as directed vide order date d 7th February, \n2025 .  \n41. It is not in dispute that the said area is already \nbeing used by the lawyers and litigants to park their \nvehicles during Court  hours. This Court was apprised \nthat almost 3000 to 4000 four -wheeler  vehicles  are \nparked in the area on any given  working day. This \npractice has been  prevalent since  last many years 26 \nC.A. @ SLP ( C) No(s). 162 -163 of 2025  with connected matters  because the pre -existing parking facility has fallen \nwoefully short with the efflux of time and increase of \nfootfall into the High Court campus.  True, it is that \nthe land in question is a part of the green belt under \nthe Chandigarh Master Plan , 2031 , however, this \nCourt has time and again addressed this issue and \nhas provided that for sustainable development, a \nbalanced  view is necessary.  \n42. In this regard, we may  gainfully refer to the \njudgment of this Court in the case of Rajeev Suri v. \nDelhi Development Authority7, wherein inter alia  a \nchallenge was laid to the change in the land use of \ncertain plots in  connection with the  Central Vista \nProject without taking prior permission/approval of \nthe Heritage Conservation Committee. The Central \nGovernment  defended the decision by urging that \nsuitable deviations including change in land use can \nbe allowed and the public trust doctrine does not \nprohibit the Government from utilizing the resources \nheld in public trust for the advance ment  of public \ninterest itself.  The said submission made on behalf of \nthe Government found favour with th is Court and it \n \n7 2021 SCC OnLine SC 7 . 27 \nC.A. @ SLP ( C) No(s). 162 -163 of 2025  with connected matters  was held  that legitimate development activity can be \ncarried on in harmony with the idea of environmental \nprotection and preservation including sustainable \ndevelopment . Relevant excerpts from the said \njudgment are extracted hereinbelow: - \n“374. Indubitably, environment and \ndevelopment are not sworn enemies of each \nother. It would be an anomalous approach to \nconsider environment as a hurdle in \ndevelopment and vice -versa. The entities like \nEAC and NGT are created to strike a just \nbalance between tw o competing interests and a \ntime-tested principle of striking this balance is \ntimely invocation of mitigating environmental \nmeasures amidst a development activity. True \nthat mere application of certain mitigating \nmeasures may not alleviate environmen tal \nconcerns in all matters and in some \ncircumstances, the project is simply \nincomprehensible with the environment. But as \nlong as a legitimate development activity can \nbe carried on in harmony with the idea of \nenvironmental protection and preservation \nincluding sustainable development, the Courts \nas well as expert bodies should make their best \nendeavour to ensure that harmony is upheld \nand hurdles are minimized by resorting to \nactive mitigating measures.   \n \n379. The proper balance of judicial review in \nenvironmental matters in a constantly \ndeveloping society is a matter of great debate \nacross all jurisdictions. In Ethyl Corporation v. \nEPA377, the observations of Judge Wright \npresent a just balance. He observed thus:  \n \n“There is no inconsistency between the \ndeferential standard of review and the 28 \nC.A. @ SLP ( C) No(s). 162 -163 of 2025  with connected matters  requirement that the reviewing court \ninvolve itself in even the most complex \nevidentiary matters; rather, the two indicia \nof arbitrary and capricious review stand in \ncareful balance. The close scrutiny of the \nevidence is intended to educate the court. \nIt m ust understand enough about the \nproblem confronting the agency to \ncomprehend the meaning of the evidence \nrelied upon and the evidence discarded; the \nquestions addressed by the agency and \nthose bypassed; the choices open to the \nagency and those made. The mo re technical \nthe case, the more intensive the court’s \neffort to understand the evidence, for \nwithout an appropriate understanding of \nthe case before it the court cannot properly \nperform its appellate function. …”  \n \nHe then notes the need for realising the \nlimits of judicial function thus:  \n \n“But the function must be performed with \nconscientious awareness of its limited \nnature. The enforced education into the \nintricacies of the problem before the agency \nis not designed to enable the court to \nbecome a superagency that can supplant \nthe agency’s expert decision -maker. To the \ncontrary, the court must give due deference \nto the agency’s ability to rely on its own \ndeveloped expertise. The immersion in the \nevidence is designed solely to enable the \ncourt to determine whether the agency \ndecision was rati onal and based on \nconsideration of the relevant factors. It is \nsettled that we must affirm decisions with \nwhich we disagree so long as this test is \nmet…”  \n 29 \nC.A. @ SLP ( C) No(s). 162 -163 of 2025  with connected matters  380. They must always look for a careful \nbalance when two equally relevant interests \ncompete with each other. The task may not be \neasy, but is the only reasonable recourse. For \nthe proper application of these principles, the \nfirst and foremost thing to be kept in mind is \nthe nature of the project ……………”  \n[Emphasis supplied]  \n \n43. It cannot be gainsaid that the requirement of a \nproper parking space for the lawyers and the litigants \nis imperative because the pre -existing facility in the \nHigh Court has fallen woefully short. It was meant to \ncater to 600 four-wheeler  vehicles  but reported ly, \n3000 t o 4000 four-wheeler  vehicles  access the High \nCourt campus on any given working day, and the \nnumber is bound to rise  with the passage of time.  \nUndeniably, when the vehicular movement takes \nplace on the open land, dust would be blown up \nthereby  polluting the atmosphere and causing the \nrisk o f allergies,  etc. In addition,  thereto, the particles  \nwhich blow up may precipitate on the High Court \nbuilding thereby creating  a layer of dust and \npollutants  on its exterior and disrupting  its aesthetic \nfaçade.    30 \nC.A. @ SLP ( C) No(s). 162 -163 of 2025  with connected matters  44. The green paver blocks are scientifically known \neco-friendly alternative s for regular paver blocks \nbecause in the mid dle of each paver block, there is an \nempty space for planting grass , etc. The suggestion \ngiven by learned Solicitor General to plant trees on \nthis open area can still be visualized  by planting \nsuitable  number of  trees at regular intervals in \nbetween the green paver blocks. This would \nsimultaneously creat e a green cover on the ground \nand so also vertical green cover , thereby enhancing  \nthe overall ecological balance of the area.  \n45. In view of the above, we hereby uphold the \norders dated 7th February, 2025 and 21st February, \n2025 passed by the High Court for placing green \npaver blocks in the open area being used for parking. \nHowever, while  proceeding to place such green paver \nblocks, the High Court administration may consult \nwith the landscaping experts and ensure plantation \nof a suitable number of trees at appropriate intervals \nso as to facilitate parking of maximum number of \nvehicles and creating shade as well as shelter for the \nsaid vehicles and in addition thereto, increasing the  \ngreen  cover in the area.  This exercise shall be 31 \nC.A. @ SLP ( C) No(s). 162 -163 of 2025  with connected matters  monitored by the concerned Committee of the High \nCourt.  \n46. In order to give a breathing space to the CA \n(appellant herein), it is provided that the contempt \nproceedings initiated vide order dated 13th December, \n2024 shall be kept in abeyance for a period of twelve \nweeks so as to enable the CA (appellant herein) to \ncomply with the order dated 29th November, 2024 \npassed by the High Court.  \n47. With these observations, the appeals are \ndisposed of.  \n48. Pending application(s), if any, shall stand \ndisposed of.  \n \n \n….……………………J.  \n                            (VIKRAM NATH ) \n \n \n \n...…………………….J.  \n                               (SANDEEP MEHTA)  \nNEW DELHI;  \nMay 28, 2025."
}