{
  "filename": "DHANYA_M_VS._THE_STATE_OF_KERALA.pdf",
  "page_count": 12,
  "content": "2025 INSC 809\nREPORTABLE\nIN THE SUPREME COURT OF INDIA\nCRIMINAL APPELLATE JURISDICTION\nCRIMINAL APPEAL NO.2897 OF 2025\n(Arising out of SLP (Crl.) No.14740 of 2024)\n \nDHANYA M                          … APPELLANT(S)\nVersus\nSTATE OF KERALA & ORS.             … RESPONDENT(S)\nJ U D G M E N T\nSanjay Karol, J.\nLeave Granted.\n2.The present appeal arises from the final judgment and\norder dated 4th September, 2024 passed by the High Court of\nSLP (Crl.) No. 14740 of 2024                                    Page 1 of 12Kerala at Ernakulam in WP(CRL)No.874/2024, whereby  the\norder dated 20th June, 2024 passed by the District Magistrate,\nPalakkad, directing the husband of the appellant, Rajesh1 to be\nkept under preventive detention in prison in terms of Section 3\nof Kerala Anti-Social Activities (Prevention) Act, 20072 was\naffirmed. \n3.The brief facts giving rise to the present appeal are that\nthe detenu is running a registered lending firm in the name of\n‘Rithika Finance’.  On 20th June, 2024, the District Magistrate,\nPalakkad, issued an order of detention under Section 3(1) of the\nAct, in furtherance of Recommendation No.54/Camp/2024-P-\nKAA(P)A dated 29th May, 2024 by the Palakkad District Police\nHead.  It  was  stated  therein  that  the  detenu  is  a  ‘notorious\ngoonda’ of the district and is a threat to the society at large.  The\nfollowing cases were considered for such declaration:\ni.Crime No.17/2020 under Section 17 of Kerala\nMoney Lenders Act, 1958, and Section 3, 9(1)(a)\nof  Kerala  Prohibition  of  Charging  Exorbitant\nInterest Act, 2012, at the Kasaba Police Station.\nii.Crime No.220/2022 under Section 3 read with\nSection 17 of Kerala Money Lenders Act, 1958,\nand Section 9(a)(b) read with Section 3 of Kerala\n1 Hereinafter “detenue”\n2 Hereinafter “the Act”\nSLP (Crl.) No. 14740 of 2024                                    Page 2 of 12Prohibition of Charging Exorbitant Interest Act,\n2012, at the Town South Police Station.\niii.Crime No.221/2022 under Section 294(b), 506\n(I) of the Indian Penal Code, 1860, and Section 3\nread with Section 17 of Kerala Money Lenders\nAct, 1958, and Section 9 (a)(b) read with Section\n3 of Kerala Prohibition of Charging Exorbitant\nInterest Act, 2012. \niv.Crime  No.401/2024  under  Sections  341,  323,\n324, 326 of the Indian Penal Code, 1860; Section\n17 of Kerala Money Lenders Act, 1958; Section\n4 of Kerala Prohibition of Charging Exorbitant\nInterest Act, 2012, and Section 3(2), (va), 3(1)\n(r), 3(1)(s) of the SC/ST Prevention of Atrocities\nAct, 1989.\n4.Consequently,  the  detenu  was  taken  into  custody.\nAggrieved by the order of detention dated 20th June, 2024, the\nappellant filed a writ petition before the High Court of Kerala\nassailing the order of detention and praying for a writ of Habeas\nCorpus to Respondent No.1 - the State of Kerala, against the\nillegal detention of her husband, Rajesh. \nSLP (Crl.) No. 14740 of 2024                                    Page 3 of 125.Vide the impugned Judgment and Order, the High Court\nof Kerala dismissed the challenge laid to the order of detention\nwith the following findings:\na.Whether the cases against the detenu will result\nin an acquittal, is not an exercise that can be\ncarried  out  by  the  detaining  authority  while\npassing the order of preventive detention.\nb.In  writ  jurisdiction  under  Article  226  of  the\nConstitution, the Court does not sit in an appeal\nagainst decisions taken by the authorities on the\nbasis of the materials placed before it. \nc.Procedural safeguards have been complied with\nin the impugned action.\n6.Aggrieved thereof, the appellant has preferred an appeal\nbefore this Court. The significant point of challenge taken by\nthe appellant is that in all cases against the detenu, he is on bail\nand is complying with the conditions laid down by the Court. \n7.We have heard the learned counsel for the parties and\nperused  the  written  submissions  filed.  Vide order  dated  10th\nDecember 2024, the detenu was released by this Court, since\nthe maximum period of detention under the Act was completed. \n8.The  question  that  arises  for  consideration  before  this\nCourt is - whether the preventive detention of the detenu is in\naccordance with law.\nSLP (Crl.) No. 14740 of 2024                                    Page 4 of 129.It  is  well  settled  that  the  provision  for  preventive\ndetention is an extraordinary power in the hands of the State\nthat  must  be  used  sparingly.  It  curtails  the  liberty  of  an\nindividual  in  anticipation  of  the  commission  of  further\noffence(s),  and  therefore,  must  not  be  used  in  the  ordinary\ncourse  of  nature.   The  power  of  preventive  detention  finds\nrecognition in the Constitution itself, under Article  22(3)(b).\nHowever, this Court has emphasized in Rekha v. State of Tamil\nNadu3 that the power of preventive detention is an exception to\nArticle  21  and,  therefore,  must  be  applied  as  such,  as  an\nexception to the main rule and only in rare cases. \n10.The above position was succinctly summarized by this\nCourt, recently  in  Mortuza  Hussain  Choudhary  v.  State  of\nNagaland and Ors.4, as follows :\n“2. Preventive     detention     is  a  draconian  measure\nwhereby a person who has not been tried and convicted\nunder a penal law can be detained and confined for a\ndeterminate period of time so as to curtail that person's\nanticipated criminal activities. This extreme mechanism\nis,  however,  sanctioned  by  Article  22(3)(b) of\nthe Constitution of India. Significantly, Article 22 also\nprovides  stringent  norms  to  be  adhered  to  while\neffecting preventive detention.  Further,  Article  22\nspeaks of the Parliament making law prescribing the\nconditions  and  modalities  relating\nto preventive detention. The Act of 1988 is one such\nlaw  which  was  promulgated  by  the  Parliament\nauthorizing preventive detention so  as  to  curb  illicit\n3 (2011) 5 SCC 244.\n4 2025 SCC Online SC 502.\nSLP (Crl.) No. 14740 of 2024                                    Page 5 of 12trafficking  of  narcotic  drugs  and  psychotropic\nsubstances. Needless to state,  as preventive deprives a\nperson  of  his/her  individual  liberties  by  detaining\nhim/her for a length of time without being tried and\nconvicted  of  a  criminal  offence,  the  prescribed\nsafeguards  must  be  strictly  observed  to  ensure  due\ncompliance with constitutional and statutory norms and\nrequirements.”\n(Emphasis supplied)\n11.Furthermore, given the extraordinary nature of the power\nof preventive detention, this Court in  Icchhu Devi v. Union of\nIndia5, placed the burden on the detaining authority to prove\nthat  such  actions  are  in  conformity  with  the  procedure\nestablished by law, in consonance with Article 21.   Similarly, in\nBanka  Sneha  Sheela  v.  State  of  Telengana6, this  Court\nreiterated  that  an  action  of  preventive  detention  has  to  be\nchecked with Article 21 of the Constitution and the statute in\nquestion. \n12.At this stage, we must advert to the scheme and object of\nthe Act, under which the impugned detention order has been\npassed.  The  object  of  the  Act  is  to  provide  for  effective\nprevention of certain anti-social activities in the State of Kerala.\nSection  2(j)  defines  ‘goonda’ as  a  person  who  indulges  in\nactivities that are harmful to the maintenance of public order,\neither  directly  or  indirectly.  It  includes  persons  who  are\nbootleggers,  counterfeiters,  drug  offenders,  and  loan  sharks,\n5 (1980) 4 SCC 531.\n6 (2021) 9 SCC 415.\nSLP (Crl.) No. 14740 of 2024                                    Page 6 of 12amongst others.  Section 2(o) lays down the classification for a\n‘known goonda’, which is a goonda who has been -\ni.Found guilty of an offence which falls under the\ncategories mentioned in Section 2(j); or\nii.Found in any investigation or competent Court on\ncomplaints initiated by persons in two separate\ninstances not forming part of the same transaction,\nto have committed any act within the meaning of\nthe term ‘goonda’ as defined in Section 2(j).\n13.Under Section 3 of the Act, the District Magistrate so\nauthorized or the Government, may make an order directing\ndetention of a ‘known goonda’, to prevent commission of anti-\nsocial activities within the State of Kerala. \n14.Section 7 mandates disclosure of the grounds of detention\nto the detenu along with relevant documents within five days of\nthe preventive detention. \n15.Section  12  of  the  Act  specifies  that  the  period  of\ndetention for any person shall not exceed six months.\n \n16. Coming to the attending facts and circumstances, we are\nof the considered view that the exercise of power under Section\n3 of the Act, was not justified in law. \n17.From perusal of Section 2(j), it is evident that a person\nwho indulges in activities “harmful to maintenance of public\norder” is sought to be covered by the Act.  This Court in SK.\nSLP (Crl.) No. 14740 of 2024                                    Page 7 of 12Nazneen  v.  State  of  Telangana7 had  emphasized  on  the\ndistinction between public order as also law and order situations\n: \n“18. In  two  recent  decisions  [ Banka  Sneha\nSheela v. State  of  Telangana ,  (2021)  9  SCC  415  :\n(2021) 3 SCC (Cri) 446;  Mallada K. Sri Ram  v. State of\nTelangana, (2023) 13 SCC 537 : 2022 SCC OnLine SC\n424] , this  Court  had  set aside  the  detention  orders\nwhich were passed, under the same Act i.e. the present\nTelangana  Act,  primarily  relying  upon  the  decision\nin Ram Manohar Lohia  [Ram Manohar Lohia  v. State\nof Bihar, 1965 SCC OnLine SC 9] and holding that the\ndetention orders were not justified as it was dealing\nwith a law and order situation and not a public order\nsituation.”\n(Emphasis supplied)\n18. Similarly, in Nenavath Bujji etc. v. State of Telangana\n& Ors.8, this Court observed :\n“32. The crucial issue is whether the activities of the\ndetenu  were  prejudicial  to  public  order.  While  the\nexpression ‘law and order’ is wider in scope inasmuch\nas contravention of law always affects order, ‘Public\norder’ has a narrower ambit, and could be affected by\nonly such contravention, which affects the community\nor the public at large. Public order is the even tempo of\nlife of the community taking the country as a whole or\neven a specified locality . The distinction between the\nareas of ‘law and order’ and ‘public order’ is one of\ndegree and extent of the reach, of the act in question on\nsociety. It is the potentiality of the act to disturb the\neven tempo of life of the community which makes it\nprejudicial to the maintenance of the public order. If a\ncontravention in its effect is confined only to a few\n7 (2023) 9 SCC 633.\n8 2024 SCC OnLine SC 367.\nSLP (Crl.) No. 14740 of 2024                                    Page 8 of 12individuals directly involved as distinct from a wide\nspectrum of public, it could raise problem of law and\norder only. In other words, the true distinction between\nthe areas of law and order and public order lies not\nmerely in the nature or quality of the act, but in the\ndegree and extent of its reach upon society.  Acts similar\nin  nature,  but  committed  in  different  contexts  and\ncircumstances, might cause different reactions. In one\ncase  it  might  affect  specific  individuals  only,  and\ntherefore touches the problem of law and order only,\nwhile in another it might affect public order. The act by\nitself, therefore, is not determinant of its own gravity. In\nits quality it may not differ from other similar acts, but\nin its potentiality, that is, in its impact on society, it may\nbe very different.”\n(Emphasis supplied)\n19. In consonance with the above expositions of law, in our\nview, the attending facts and circumstances do not fall under the\ncategory of a public order situation.  The observations made in\nthe detention order do not ascribe any reason as to how the\nactions of the detenu are against the public order of the State.\nAs discussed above, given the extraordinary nature of the power\nof  preventive  detention,  no  reasons  are  assigned  by  the\ndetaining authority, as to why and how the actions of the detenu\nwarrant the exercise of such an exceptional power. \n20. Moreover, it has been stated therein by the authority that\nthe detenu is violating the conditions of bail imposed upon him\nin the cases that have been considered for passing the order of\ndetention.  However, pertinently, no application has been filed\nby  the  respondent-State  in  any  of  the  four  cases,  alleging\nSLP (Crl.) No. 14740 of 2024                                    Page 9 of 12violation of such conditions, if any, and moreover, have not\neven been spelt out here. \n21.This Court in SK. Nazneen (supra), had observed that the\nState should move for cancellation of bail of the detenu, instead\nof placing him under the law of preventive detention, which is\nnot the appropriate remedy. Similarly, in  Ameena Begum v.\nState of Telengana9, this Court observed : \n“59. … It is pertinent to note that in the three criminal\nproceedings  where  the  detenu  had  been  released  on\nbail, no applications for cancellation of bail had been\nmoved  by  the  State.  In  the  light  of  the  same,  the\nprovisions of the Act, which is an extraordinary statute,\nshould  not  have  been  resorted  to  when  ordinary\ncriminal law provided sufficient means to address the\napprehensions leading to the impugned detention order.\nThere may have existed sufficient grounds to appeal\nagainst the bail orders, but the circumstances did not\nwarrant  the  circumvention  of  ordinary  criminal\nprocedure to resort to an extraordinary measure of the\nlaw of preventive detention. ”\n60.  In Vijay Narain Singh v. State of Bihar [Vijay\nNarain Singh v. State of Bihar, (1984) 3 SCC 14 : 1984\nSCC (Cri) 361] , Hon'ble E.S. Venkataramiah, J. (as the\nChief Justice then was) observed : (SCC  pp. 35-36,\npara 32)\n32.  …  It  is  well  settled  that  the  law  of\npreventive  detention  is  a  hard  law  and\ntherefore  it  should  be  strictly  construed.\nCare should be taken that the liberty of a\nperson  is  not  jeopardised  unless  his  case\nfalls squarely within the four corners of the\nrelevant  law.  The  law  of  preventive\ndetention should not be used merely to clip\n9 (2023) 9 SCC 587.\nSLP (Crl.) No. 14740 of 2024                                    Page 10 of 12the wings of an accused who is involved in\na criminal prosecution. It is not intended for\nthe  purpose  of  keeping  a  man  under\ndetention when under ordinary criminal law\nit may not be possible to resist the issue of\norders of bail, unless the material available\nis such as would satisfy the requirements of\nthe  legal  provisions  authorising  such\ndetention.  When  a  person  is  enlarged  on\nbail by a competent criminal court, great\ncaution should be exercised in scrutinising\nthe  validity  of  an  order  of  preventive\ndetention which is based on the very same\ncharge which is to be tried by the criminal\ncourt.”\n(Emphasis supplied)\n22. Keeping in view the above expositions of law, we have\nno doubt that the order of detention cannot be sustained. The\ncircumstances  pointed  out  in  the  order  by  the  detaining\nauthority may be ground enough for the State to approach the\ncompetent Courts for cancellation of bail, but it cannot be said\nthat the same warranted his preventive detention. We clarify that\nif such an application for cancellation of the detenu’s bail is\nmade  by  the  respondent-State,  the  same  must  be  decided\nuninfluenced by the observations made hereinabove. \n23. Therefore, the order of detention dated 20th June, 2024\nand the impugned judgment dated 4th September, 2024 passed\nby  the  High  Court  of  Kerala  at  Ernakulam  in  WP(CRL.)\nNo.874/2024 are hereby set aside.  In the attending facts and\ncircumstances of this case, the appeal is allowed. \nSLP (Crl.) No. 14740 of 2024                                    Page 11 of 12Pending application(s), if any, shall stand disposed of.\n……………………J.\n(SANJAY KAROL)\n……………………J.\n(MANMOHAN)\n6th June, 2025;\nNew Delhi.\nSLP (Crl.) No. 14740 of 2024                                    Page 12 of 12"
}