{
  "filename": "GHANSHYAM_SONI_VS._STATE_(GOVT._OF_NCT_OF_DELHI).pdf",
  "page_count": 20,
  "content": "2025 INSC 803\nCORRECTED\nREPORTABLE\nIN THE SUPREME COURT OF INDIA\nCRIMINAL APPELLATE JURISDICTION\nCRIMINAL APPEAL NO. 2894      OF 2025\n[Arising out of SLP (Crl.) No. 9709 of 2024]\nGHANSHYAM SONI                    …APPELLANT(S)\nVERSUS\nSTATE (GOVT. OF NCT OF DELHI) \n& ANR.      …RESPONDENT(S)\nWITH\nCRIMINAL APPEAL NO.  2895      OF 2025\n[Arising out of SLP (Crl.) No. 17951 of 2024]\n  \nJ U D G M E N T\nSATISH CHANDRA SHARMA, J.\n1.Leave granted.\nSLP (Crl.) No. 9709/2024 & Anr.  Page 1 of 202.The  captioned  Appeal  is  filed  assailing  the  Impugned\nJudgment/Final Order dt. 01.04.2024 passed by the High Court\nof  Delhi  in  Crl.  MC  No.  1227/2009  whereby  the\nOrder/Judgment dt. 04.10.2008 passed by Additional Sessions\nJudge Delhi (“Sessions Court”) in CR No. 87/2008 discharging\nthe Appellant for the offence u/s 498A Indian Penal Code, 1860\nin FIR                     No. 1098/2002 dt. 19.12.2002 registered\nwith PS Malviya Nagar, was set aside. \n3.The  criminal  machinery  was  set  in  motion  with  the\nComplaint  dt.  03.07.2002  filed  by  the  Complainant\nwife/Respondent no.2 culminating into the FIR No. 1098/2002\ndt. 19.12.2002 registered with PS Malviya Nagar, against the\nAppellant husband and her in-laws for commission of offences\nunder sections 498A, 406 & 34 IPC. The factual conspectus is\nbriefly stated as under:\n3.1As per the FIR, the marriage between the Appellant\nhusband  and  the  Complainant  wife,  Respondent  no.  2\nherein  was  solemnized  on  28.02.1998  according  to\nBuddhist rites and ceremonies. It is averred that the entire\ncost  of  the  ceremonies  had  been  arranged  by  the\nComplainant,  according  to  the  best  of  their  financial\nabilities. At the time, both the parties were serving as Sub-\nInspectors with the Delhi Police. \nSLP (Crl.) No. 9709/2024 & Anr.  Page 2 of 203.2It  is  alleged  that  soon  after  her  marriage,  the\nComplainant learnt about the greedy and abusive nature\nof the Appellant and his family members, who constantly\ntaunted  her  and  ridiculed  her  for  bringing  insufficient\ndowry.  Purportedly,  the  mother-in-law,  Smt.  Bhagwati\nand five of her sisters-in law, namely Geeta, Lata, Misiya,\nHemlata  and  Gayatri  constantly  fueled  conflict,  and\ninstigated  the  Appellant  against  the  Complainant.  The\nfather-in-law hurled abuses at the Complainant and her\nfamily,  allegedly  saying  that  their  family  had  adopted\nBuddhism to simply evade the traditions of dowry.\n3.3The Appellant and his family consistently raised\ndemands for more dowry and allegedly  made a specific\ndemand for Rs. 1.5 Lakhs in cash, a Car and a separate\nhouse for the Appellant amongst other petty things. The\nComplainant averred that despite serious effort, her father\nwas unable to meet the said demands which led to her\nbeing subjected to serious physical & mental atrocities at\nthe hands of her husband and in-laws. \n3.4It  is  alleged  that  on  27.04.1999,  the  Appellant\nhusband  and  her  mother-in-law,  Smt.  Bhagwati  had\nbeaten  up  the  Complainant  with  fists,  blows  for  not\nfulfilling their needs. The Complainant who hurt her wrist\nin the incident, had to put on a bandage for a month, and\nSLP (Crl.) No. 9709/2024 & Anr.  Page 3 of 20her parents took her to their house, where she remained\non medical rest for twenty days. However, even after her\nreturn from her parental home with Rs. 50,000/- in cash,\nher late father-in-law and her sisters in law (except one)\nberated her for her inability to fulfill their demands and\nbeing a burden on the family. \n3.5On 04.09.1999, the Appellant allegedly took out a\ndagger and threatened the Complainant that he would kill\nher if she failed to fulfill the demands, particularly that of\nhis sister. It is alleged that on 05.09.1999, the sister-in-\nlaw, Ms. Lata had allegedly threatened the Complainant in\nfront of the father-in-law and the Appellant husband that\nsince she is to return to her house in Jaipur in 2-3 days,\nher demand of a “ mangalsutra” be fulfilled within 2 days,\nor  else  the  3rd day  would  be  the  last  day  for  the\nComplainant  in that  house.  Since she  was not able  to\nfulfill the demands, the Complainant was allegedly beaten\nup  and  thrown  out  of  the  matrimonial  house  on\n08.09.1999. The Complainant was not allowed  to take\nwith  her  any  of  her  belongings  including  her  own\nmotorcycle, jewelery or clothes and was left to fend for\nherself. Aggrieved, she reported the incidents of cruelty\nand filed a Complaint on the same day with PS Prasad\nNagar, Delhi vide DD No. 31 dt. 08.09.1999. It is the case\nSLP (Crl.) No. 9709/2024 & Anr.  Page 4 of 20of the Complainant that since the incident, she had been\nliving with her parents. \n3.6It  is  further  alleged  that  on  06.12.1999,  the\nComplainant while returning from her shift at the Palam\nAirport was allegedly beaten up by the Appellant, who\nthreatened her to withdraw the earlier Complaint alleging\ndomestic  violence  against  him  and  his  family.  The\nComplainant, who was pregnant at the time, had allegedly\nhit the railing and purportedly sustained an injury on the\nright side of the ear. She reported the incident by filing a\nComplaint at PS Palam Airport vide DD No. 35 dated\n06.12.1999. \n3.7The  Complainant  gave  birth  to  a  daughter  on\n27.04.2000. It is alleged that neither the Appellant nor any\nof his family members came to visit her or their new-born\ndaughter at the hospital or at her parents’ house. Even at\nthat stage, when the Complainant was in dire need, the\nAppellant or his family did not return her belongings. The\nComplainant  alleges  that  the  Appellant,  who  did  not\nbother  to  visit  her  own  daughter,  assaulted  the\nComplainant wife during the advanced stage of pregnancy\nand did not incur any expenditure towards the birth of the\nchild, and yet enjoyed paternity leave for more than 15\ndays from the Department. \nSLP (Crl.) No. 9709/2024 & Anr.  Page 5 of 203.8On  03.07.2002,  the  Complainant  filed  a  formal\nComplaint  with  the  Deputy  Commissioner  of  Police,\nCAW Cell, New Delhi through proper channels, wherein\nshe gave elaborate details of the alleged incidents and the\ntorture meted out to her since her marriage on 28.02.1998.\nPursuant to the said Complaint, FIR No. 1098/2002 dt.\n19.12.2002 was registered at PS Malviya Nagar, under\nsections  498A,  406  &  34  IPC  against  the  Appellant\nhusband and her in-laws. \n3.9The Charge-sheet in the captioned case was filed on\n27.07.2004 under sections 498A, 406 & 34 IPC and the\nMetropolitan  Magistrate,  Delhi  (“ Magistrate”)  took\ncognizance  on  the  very  same  day.  Vide  Order  dt.\n04.06.2008, the Magistrate framed charges under section\n498A read with Section 34 IPC and dropped the charge\nunder section 406 IPC.  \n3.10Aggrieved by the Order dt. 04.06.2008 passed by\nthe  Magistrate,  the  Appellant  filed  Criminal  Revision\nPetition No. 87/2008 before the Sessions Court, Delhi.\nApart from the submissions that the allegations against\nhim and his family are false, it was the assertion of the\nAppellant that the alleged incidents of cruelty pertain to\nthe  year  1999,  whereas  she  lodged  a  Complaint  on\n03.07.2002 after an inordinate delay of 3 years. It was\nSLP (Crl.) No. 9709/2024 & Anr.  Page 6 of 20averred that the cognizance on the Complaint was only\ntaken  on  27.07.2004,  which  is  beyond  the  limitation\nperiod  as  provided  under  section  468  of  the  Code  of\nCriminal Procedure, 1973 (“ CrPC”). \n3.11The  Sessions  Court  vide  Order  dt.  04.10.2008\nwithin its powers of revision, discharged the Appellant,\nhis mother  and  her  five  sisters for  the  offences under\nsection  498A  &  34  IPC.  It  was  observed  that  the\nMagistrate had taken cognizance of a time-barred case as\ncognizance  was  taken  on  27.07.2004  of  the  alleged\nincidents of cruelty pertaining to the year 1999 i.e. after\nfive (05) years of the commission of the alleged offence,\nwhereas the limitation period for an offence punishable\nunder Section 498A is three (03) years.1 The Sessions\nCourt held that the Magistrate did not have the inherent\npowers to condone delay under section 473 CrPC at the\ntime of framing of charges, and even if it was authorized\nto condone such delay, it could not have done so in the\npresent case where the chances of false implication of the\nAppellants were apparent.  \n3.12The  Sessions  Court  further  remarked  that  the\npossibility of false implication cannot be ruled out since\nthe  Complainant  wife  was  a  police  officer  trained  to\n1 Section 468(2)(c) of the Code of Criminal Procedure 1973.\nSLP (Crl.) No. 9709/2024 & Anr.  Page 7 of 20tackle  tough  and  high-pressure  situations  and  such  an\noffence  in  question  could  not  have  been  committed\nagainst her. The said remarks are reproduced as under:\n“In  the  present  case  unlike  the  Ramesh's\ncase (supra) relied upon by the learned trial\ncourt  in  the  impugned  order  the\ncomplainant  is  a  police  officer  and  is\nsupposed to be a tough person used to deal\nwith  hard  situations,  by  virtue  of  her job\nwhich includes her handling the criminals\nbesides tough and hard job of police officer.\nSuch a strong-and tough person is not only\nalmost immune to be pressurized but also\ncan be harsh and strong in reaction to other\npersons going against her-wishes. A woman\npolice  officer  knowing  the  law  and  rules\npertaining  to  crime  detection  and\ninvestigation  and  trial  before  court,\ntherefore,  cannot  be  equated  to  an\n.oppressed housed wife who is subjected to\ncruelty by her husband and in laws and the\naforesaid  observation  in Arun  Vyas’ s case\nseems to apply to such a wife and not to a\nstrong  woman  police  officer  wife  dealing\nwith hardened criminals daily in discharge\nof  her  official  duties.  However,  it  cannot\nalways be a case that a woman wife working\nin police is an aggressor and not subject to\ncruelty. She can also be subjected to cruelty\nby her husband and in laws. But when she\nbeing  conversant  with  law  on  the  subject\nhas roped in the five sisters which include\nfour married sisters of her husband besides\naged mother in law and father in law (since\nSLP (Crl.) No. 9709/2024 & Anr.  Page 8 of 20deceased) of the complainant, the possibility\nof  false  implication  of  accused  persons\ncannot  be  ruled  out  particularly  when  as\nper the statement u/s 161 CrPC of mother of\ncomplainant, the complainant wife came to\nher  parents  in  September  199  due  to\nmarriage of her sister but accused husband\ndid not take her back to matrimonial home.\nWhen the Complainant wife is in full know\nof investigation procedure and law and by\nliving  separate  from  the  revisionists since\nSeptember 1999 has lodged FIR/Complaint\nin 2002, there certainly is unexplained delay\nin lodging the FIR.”\n3.13Aggrieved  thereby,  the  Complainant  filed  the\nPetition under section 482 CrPC assailing the Judgement\ndt. 04.10.2008 before the High Court of Delhi. The High\nCourt  vide  Impugned  Judgment  and  final  Order  dt.\n01.04.2024 allowed the Petition, and set aside the Order\ndt. 04.10.2008 passed by the Sessions Court, observing\nthat the findings of the Sessions Court were perverse.\n3.14The  captioned  Appeal  is  against  the  Impugned\nJudgment and final Order dt. 01.04.2024 passed by the\nHigh Court of Delhi. During the course of the proceedings\nbefore  this  Court,  the  Appellant  has  also  filed  an\nApplication under Article 142 of the Constitution of India\nseeking  quashing  of  the  FIR  No.  1098/2002  dt.\n19.12.2002. \nSLP (Crl.) No. 9709/2024 & Anr.  Page 9 of 204.It has been argued on behalf of the Appellants that the\nHigh Court had erred in setting aside the Order dt. 04.10.2008\npassed  by the  Sessions Court, which  was well-reasoned  and\npassed after due consideration of the material on record. It was\nvehemently argued that the present case was time-barred and the\nMagistrate could not have taken cognizance in light of the bar\nunder  Section  468  CrPC.  Also,  the  Magistrate  after  taking\ncognizance  on  27.07.2004  could  not  have  reviewed  its  own\norder, subsequently at the stage of framing of charges. \n5.Even otherwise, it was contended that the Magistrate can\nonly  condone  the  said  delay  only  at  the  time  of  taking\ncognizance  and  in  terms  of  section  473  CrPC,  only  after  a\nproper explanation of delay. It is borne from the record that the\nfirst complaint by the Complainant was lodged on 08.09.1999\nand undisputedly, the Complainant has been residing separately\nsince  then.  The  second  Complaint  was  filed  on  06.12.1999\nwhich was withdrawn by the Complainant on 12.12.1999, and it\nwas only on a Complaint filed on 03.07.2002 that the captioned\nFIR No. 1098/2002 dt. 19.12.2002 was registered. It was argued\nthat since all the three Complaints mention the same incidents of\ncruelty in the year 1999, there is no explanation with regard to\nthe inordinate delay in filing the FIR dt. 19.12.2002, more than\nthree years after the alleged incidents and the delay could not\nhave  been  condoned  for any  reason  whatsoever.  It has been\nSLP (Crl.) No. 9709/2024 & Anr.  Page 10 of 20urged by the learned counsel that the allegations in the FIR are\nfalse, and no  prima facie case can be made  out against the\nAppellant or his family, even after the perusal of the material on\nrecord. \n6.Per contra, it is argued by the learned counsel for the\nComplainant/Respondent no. 2 that it cannot be assumed at this\nstage when the trial is yet to commence that the Complaints\nfiled by her are false, simply because she is a police officer.\nSince there were specific allegations against the Appellant of\nphysically  and  mentally  harassing  the  complainant,  it  was\nargued that the Sessions Court could not have discharged him\nwithout the Appellant standing the test of trial . \n7.It was further argued that the last alleged offence was\ncommitted on 06.12.1999, and complaints were filed both on\n06.12.1999 and 03.07.2002 which is well-within the three year\nlimitation period in terms of section 468 CrPC. The relevant\ndate to compute the limitation period under the said provision is\nthe date of filing of the Complainant or date of institution of\nproceedings, and even otherwise, an offence under section 498A\nis a continuing offence, and there are serious allegations made\nagainst the Appellant and his family, even after September or\nDecember 1999. \n8.Learned counsel for the State also supports the case of the\nprosecution and has prayed for the dismissal of the Appeal. \nSLP (Crl.) No. 9709/2024 & Anr.  Page 11 of 209.We have heard Learned counsel for the parties and have\ncarefully perused the material on record. \n10.      A perusal of the FIR shows that the allegations made by\nthe complainant are that in the year 1999, the Appellant inflicted\nmental and physical cruelty upon her for bringing insufficient\ndowry.  The  Complainant  refers  to  few  instances  of  such\natrocities,  however  the  allegations  are  generic,  and  rather\nambiguous. The allegations against the family members, who\nhave been unfortunately roped in, is that they used to instigate\nthe  Appellant  husband  to  harass  the  Complainant  wife,  and\ntaunted  the  Complainant  for  not  bringing  enough  dowry;\nhowever,  there  is  no  specific  incident  of  harassment  or  any\nevidence to that effect. Similarly, the allegations against the five\nout of six sisters that they used to insult the Complainant and\ndemanded dowry articles from her, and upon failure beat her up,\nbut there  is not even a cursory mention of the incident. An\nallegation has also been made against a tailor named Bhagwat\nthat he being a friend of the Appellant instigated him against the\nComplainant,  and  was  allegedly  instrumental  in  blowing  his\ngreed. Such allegations are merely accusatory and contentious in\nnature, and do not elaborate a concrete picture of what may have\ntranspired. For this reason alone, and that the evidence on record\nis clearly inconsistent with the accusations, the version of the\nComplainant seems implausible and unreliable. The following\nSLP (Crl.) No. 9709/2024 & Anr.  Page 12 of 20observation  in  K.  Subba  Rao  v.  State  of  Telangana\nRepresented by Its Secretary, Department of Home & Ors.2,\nfits perfectly to the present scenario:\n“6.  The  Courts  should  be  careful  in\nproceeding against the distant relatives in\ncrimes  pertaining  to  matrimonial  disputes\nand  dowry  deaths.  The  relatives  of\nthe husband should not be roped in on the\nbasis of omnibus allegations unless specific\ninstances of their involvement in the crime\nare made out.\"\n11.As  regards  the  Appellant,  the  purportedly  specific\nallegations levelled against him are also obscure in nature. Even\nif the allegations and the case of the prosecution is taken at its\nface value, apart from the bald allegations without any specifics\nof time, date or place, there is no incriminating material found\nby the prosecution or rather produced by the complainant to\nsubstantiate  the  ingredients  of  “cruelty”  under  section  498A\nIPC,  as  recently  observed  in  the  case  of  Jaydedeepsinh\nPravinsinh Chavda & Ors. v. State of Gujarat3 and Rajesh\nChaddha v. State of Uttar Pradesh .4 The Complainant has\nadmittedly  failed  to  produce  any  medical  records  or  injury\nreports,  x-ray  reports,  or  any  witnesses  to  substantiate  her\nallegations.  We cannot ignore the fact that the Complainant\n2 (2018) 14 SCC 452.\n3 2024 INSC 960\n4 2025 INSC 671.\nSLP (Crl.) No. 9709/2024 & Anr.  Page 13 of 20even withdrew her second Complaint dt. 06.12.1999 six days\nlater on 12.12.1999. There is also no evidence to substantiate the\npurported demand for dowry allegedly made by the Appellant or\nhis family and the investigative agencies in their own prudence\nhave not added sections 3 & 4 of the Dowry Prohibition Act,\n1961 to the chargesheet. \n12.In this respect, the Sessions Court has applied its judicial\nmind to the allegations in the FIR & the material on record, and\nhas  rightly  discharged  the  Appellants  of  the  offences  under\nsection 498A & 34 IPC. No twithstanding the said observation\nby the Sessions Court that the possibility of false implication\ncannot  be  ruled  out,  the  discharge  of  the  Appellant  merely\nbecause the Complainant is a police officer is erroneous and\nreflects poorly on the judicial decision making, which must be\nstrictly based on application of judicial principles to the merits\nof  the  case.  On  the  other  hand,  the  High  Court  vide  the\nImpugned  Order  has  traversed  one  step  further  and  overtly\nemphasised that simply because  the  Complainant is a  police\nofficer, it cannot be assumed that she could not have been a\nvictim of cruelty at the hands of her husband and in-laws. We\nagree with the sensitive approach adopted by the High Court in\nadjudicating the present case, however a judicial decision cannot\nbe blurred to the actual facts and circumstances of a case. In this\ndebate, it is only reasonable to re-iterate that the Sessions Court\nSLP (Crl.) No. 9709/2024 & Anr.  Page 14 of 20in exercise of its revisionary jurisdiction and the High Court in\nexercise of its inherent jurisdiction under section 482 CrPC,\nmust  delve  into  the  material  on  record  to  assess  what  the\nComplainant has alleged and whether any offence is made out\neven if the allegations are accepted in toto. In the present case,\nsuch scrutiny of the allegations in the FIR and the material on\nrecord  reveals  that  no  prima  facie is  made  out  against  the\nAppellant or his family.  It is also borne from the record that the\ndivorce decree of their marriage, has already been passed, and\nthe same has never been challenged by the Complainant wife,\nand  hence  has  attained  finality.  Upon  consideration  of  the\nrelevant circumstances and that the alleged incidents pertain to\nthe year 1999 and since then the parties have moved on with\ntheir  respective  lives,  it  would  be  unjust  and  unfair  if  the\nAppellants are forced to go through the tribulations of a trial.\n13.It  is  rather  unfortunate  that  the  Complainant  being  an\nofficer of the State has initiated criminal machinery in such a\nmanner,  where  the  aged  parents-in-law,  five  sisters  and  one\ntailor have been arrayed as an accused.  Notwithstanding  the\npossibility  of  truth  behind  the  allegations  of  cruelty,  this\ngrowing tendency to misuse legal provisions has time and again\nbeen  condemned  by  this  Court.  The  observations  in  Dara\nLakshmi Narayana & Ors. v. State of Telangana & Anr.5,\n5 2024 INSC 953.\nSLP (Crl.) No. 9709/2024 & Anr.  Page 15 of 20Preeti Gupta & Anr. v. State of Jharkhand & Anr.6 aptly\ncaptures this concern. \n14.In addition, we are also of the considered view that the\nComplaint dt. 03.07.2002 filed by the Complainant was not time\nbarred and was filed within the ascribed period of three years\nfrom the date of the commission of the offence.  In arguendo,\neven if the assertion of the Appellants is considered to be true\nthat the allegations pertain to the year 1999, and there is no\nmaterial change from the first Complaint dt. 08.09.1999 and the\nfinal Complaint dt. 03.07.2002, it cannot be construed that the\nsame was not within the time frame of limitation simply because\ncognizance was taken by the Magistrate two years later vide\nOrder dt. 27.07.2004.\n15.It is a settled position of law that for the computation of\nthe limitation period under Section 468 CrPC the relevant date is\nthe date of filing of the complaint or the date of institution of\nprosecution  and  not  the  date  on  which  the  Magistrate  takes\ncognizance.7 The  dicta  laid  down  in  the  case  of  Bharat\nDamodar Kale & Anr. v. State of Andhra Pradesh8 makes it\nunequivocally clear that the Magistrate is well within his powers\nto take cognizance of a complaint filed within a period of three\n6 [2010] 7 SCC 667.\n7 Sarah Mathew Vs Institute Cardio Vascular Diseases by Its Director DR \nK. M. Cherian & Ors. [2014] 2 SCC 62.\n8 [2003] 8 SCC 559.\nSLP (Crl.) No. 9709/2024 & Anr.  Page 16 of 20years from the date of the commission of offence as mandated\nunder section 468 CrPC. The relevant portion is reproduced as\nunder:\n“50. The Code imposes an obligation on the\naggrieved  party  to  take  recourse  to\nappropriate  forum  within  the  period\nprovided  by  law  and  once  he  takes  such\naction, it would be wholly unreasonable and\ninequitable if he is told that his grievance\nwould not be ventilated as the court had not\ntaken  an  action  within  the  period  of\nlimitation.  Such  interpretation  of  law,\ninstead of promoting justice would lead to\nperpetuate injustice and defeat the primary\nobject of procedural law.\n 51. The  matter  can  be  looked  at  from\ndifferent angle also. Once it is accepted (and\nthere is no dispute about it) that it is not\nwithin  the  domain  of  the  complainant  or\nprosecuting agency to take cognizance of an\noffence or to issue process and the only thing\nthe former can do is to file a complaint or\ninitiate proceedings in accordance with law,\nif that action of initiation of proceedings has\nbeen taken within the period of limitation,\nthe complainant is not responsible for any\ndelay on the part of the court or Magistrate\nin issuing process or taking cognizance of an\noffence. Now, if he is sought to be penalized\nbecause of the omission, default or inaction\non the part of the court or Magistrate, the\nprovision of law may have to be tested on the\ntouchstone of Article 14 of the Constitution.\nIt can possibly be urged that such a provision\nSLP (Crl.) No. 9709/2024 & Anr.  Page 17 of 20is  totally  arbitrary,  irrational  and\nunreasonable. It is settled law that a court of\nlaw would interpret a provision which would\nhelp  sustaining  the  validity  of  law  by\napplying  the  doctrine  of  reasonable\nconstruction  rather  than  making  it\nvulnerable and unconstitutional by adopting\nrule of litera legis. Connecting the provision\nof limitation in Section 468 of the Code with\nissuing of process or taking of cognizance by\nthe  court  may  make  it  unsustainable  and\nultra vires Article 14 of the Constitution. \n52. In view of the above, we hold that for the\npurpose  of  computing  the  period  of\nlimitation,  the  relevant  date  must  be\nconsidered as the date of filing of complaint\nor  initiating  criminal  proceedings  and  not\nthe  date  of  taking  cognizance  by  a\nMagistrate or issuance of process by a court.\nWe, therefore, overrule all decisions in which\nit  has  been  held  that  the  crucial  date  for\ncomputing the period of limitation is taking\nof cognizance by the Magistrate/court  and\nnot  of  filing  of  complaint  or  initiation  of\ncriminal proceedings. \n53. In the instant case, the complaint was\nfiled within a period of three days from the\ndate  of  alleged  offence.  The  complaint,\ntherefore, must be held to be filed within the\nperiod of limitation even though cognizance\nwas taken by the learned Magistrate after a\nperiod  of  one  year.  Since  the  criminal\nproceedings have been quashed by the High\nCourt, the order deserves to be set aside and\nis  accordingly  set  aside  by  directing  the\nMagistrate to proceed with the case and pass\nSLP (Crl.) No. 9709/2024 & Anr.  Page 18 of 20an appropriate order in accordance with law,\nas expeditiously as possible.”\n16.The  following  observation  in  Kamatchi  v.  Lakshmi\nNarayanan9 also re-iterates the said position, and further holds\nthat simply because the cognizance is taken at a later stage, but\nthe Complaint was filed within the specified period from the\ncommission of the offence, the Complainant cannot be put to\nprejudice and her Complaint cannot be discarded as time-barred.\n“It is, thus, clear that though Section 468 of the\nCode mandates that ‘cognizance’ ought to be\ntaken  within  the  specified  period  from  the\ncommission  of  offence,  by  invoking  the\nprinciples of purposive construction, this Court\nruled that a complainant should not be put to\nprejudice, if for reasons beyond the control of\nthe prosecuting agency or the complainant, the\ncognizance  was  taken  after  the  period  of\nlimitation. It was observed by the Constitution\nBench  that  if  the  filing  of  the  complaint  or\ninitiation  of  proceedings  was  within  the\nprescribed period from the date of commission\nof an offence, the Court would be entitled to\ntake  cognizance  even  after  the  prescribed\nperiod was over.”\n17.The observations made by the High Court in respect of\ncomputation of the limitation period is the correct appreciation\nof facts, and it is right in holding that “ considering the date of\ncommission of offence as 08.09.1999 and the dale of filing of\ncomplaint as 03.07.2002, this Court finds that the Complaint\n9 [2022] 15 SCC 50.\nSLP (Crl.) No. 9709/2024 & Anr.  Page 19 of 20was lodged by the Petitioner within a period of two years and\nten months from the date of commission of alleged offence,\nwhich is within. the period of limitation of three years as per\nSection 468 of CrPC .”\n18.     Therefore, this is certainly not a case where the Complaint\nor the issuance of process is ex-facie barred by limitation, that\nthe question of condonation of delay would arise. It is therefore\nclarified that the Magistrate had rightly taken cognizance of the\noffence under section 498A and the question of applicability or\nexercise  of  powers  under  section  473  CrPC  as  erroneously\nobserved by the Sessions Court, does not even arise and need\nnot be delved into at this stage. \n19.    In the interest of justice, and in exercise of our powers\nunder Article 142 of the Constitution of India, we deem it fit and\nappropriate to quash and set aside the FIR No. 1098/2002 dt.\n19.12.2002  registered  with  PS  Malviya  Nagar  and  the\nChargesheet dt. 27.07.2004. \n20.Both the Criminal Appeals are accordingly allowed.  \n……………………………………J.\n                [B.V . NAGARATHNA]\n……………………………………J.\n                                            [SATISH CHANDRA SHARMA]\nNEW DELHI\nJune 04, 2025.  \nSLP (Crl.) No. 9709/2024 & Anr.  Page 20 of 20"
}