{
  "filename": "KAMLA_NEHRU_MEMORIAL_TRUST_VS._U.P._STATE_INDUSTRIAL_DEVELOPMENT_CORPORATION_LIMITED.pdf",
  "page_count": 29,
  "content": "2025 INSC 791\nPage 1 of 29 \n  \nREPORTABLE  \n \n \nIN THE SUPREME COURT OF INDIA  \nCIVIL APPELLATE JURISDICTION  \n \nCivil Appeal No s. ________ / 2025  \n (Arising out of SLP (C) Nos. 31887 -88/2017)  \n \nKamla Nehru Memorial Trust & Anr.                   …Appellants  \n \nVersus  \n \nU.P. State Industrial Development  \nCorporation Limited & Ors.  \n… Respondents                                       \n \n \n \n \nJUDG EMENT  \n \n \nSURYA KANT , J. \n       Leave Granted.     \n2. These appeals  have been preferred by the Kamla Nehru Memorial \nTrust (KNMT ) against the final  common judgment and  order dated \n29.05.2017 passed by the High Court of Allahabad  at Lucknow Bench  \n(Impugned Order), whereby it upheld the cancellation of allotment of \nland admeasuring 125 acres situated in the Utelwa Industrial Area, Page 2 of 29 \n Jagdishpur, District Sultanpur, U ttar Pradesh  (Subject Land) by the \nUttar Pradesh  State Industrial Development Corporation  (UPSIDC ).  \n3. The crux of the dispute pending before us relates to  the legality of the  \ndecision of cancellation of allotment of the Subject Land by UPSIDC . \nHowever, it would be apropos  to discuss the factual matrix before \ndelving into the analysis pertaining to the alleged procedural \nirregularities in  the cancellation of allotment of the Subject Land.  \nA. FACTS  \n4. In this vein, the sequence of events ha s been briefly adduced as \nfollows:  \n4.1. KNMT  is stated to be a charitable trust  incorporated  in the year 1975. \nIt resolved in March,  2003  to purchase land for the purpose of \nfloriculture. Accordingly , on 10.07.2003, KNMT  submitted an \napplication and deposited earnest money amounting to INR 62,600 /- \nfor allotment of the Subject Land for the aforesaid purpose.  \n4.2. UPSIDC , in an uncharacteristically  swift manner , accepted the \napplication  of KNMT  and allotted the Subject Land  vide allotment \nletter dated 18.09.2003 ( Allotment Letter ). The allotment was made \nconditional upon compliance with certain terms, the relevant \nprovisions of which are reproduced below : Page 3 of 29 \n “xxx xxx xxx  \n3.You shall deposit at this office an amount of Rs. \n12,02,187.50. (Earnest Money of Rs. 62,500.00 has been \nadjusted) towards reservation money in respect of the \nabove plot latest by 18 -10-2003. This amount (together with \nEarnest money) is approximately equal to 10 percent of the \ntotal premium of the plot at  the provisional rate of Rs. 25.00 \nper sq. mtr. and locational charges @ Rs. Nil per sq.  mtr. for \nfirst five acres and is subject to adjustment according to \nactual measurement of the plot. If the above amount falls \nshort of the amount equal to 10 percentag e of the total \npremium according to actual measurement, the balance will \nbe deposited by you within seven days of the receipt of \ndemand from us.  \nIf the payments are not made as stipulated above this \nallotment will stand automatically cancelled/and the whole \namount of the Earnest Money deposited by you will stand \nforfeited to this corporation, even if the area of the plot either \nexceeds or is less t han the area of 20% or less of the area \napplied for. However, if the area of the land allotted either \nexceeds the area applied for or falls short of the applied for \nby an area more than 20% of it, the Earnest Money will not \nbe forfeited if this allotment i s not accepted, provided \nintimation is sent to us in this respect by the date stipulated \nabove.  \nNote:  - the premium herein is provisional and is liable to be \nenhanced in accordance with the provisions of Licence \nAgreement/Lease Deed.  \nxxx xxx xxx  \n5.The remaining 90% of the provisional premium shall have \nto be paid by you in 8 equal half yearly installments each \nof which will be due for payment on 1st day of January and \n1st day of July each year. The first installments of each \npayment will fall due fo r payment on 01.01.2006. The \nsecond and subsequent installments of the premium will fall \ndue on 1st day of July and 1st day of January each year.  \nAn interest at 15.00% per annum shall be charged on the \noutstanding (balance) premium with effect from the date of \nallotment and will be payable along with installments of \npremium as stipulated in clause 3 above subject to a rebate \nof 3.00% per annum and p ayment on or before the \nprescribed date and if there are no arrears of dues. The \namount of the balance premium and the interest due on it \nfrom time to time shall remain first charge on the land and Page 4 of 29 \n the building and machinery erected thereon till it is (they \nare) paid in full.  \nNote: - the premium mentioned herein is provisional and is \nliable to be enhanced in accordance with the provisions of \nlicence agreement/Lease Deed . \nxxx xxx xxx  \n9. The plot has been allotted on as it is where it is basis and \nleveling etc, if any, is to be undertaken by you at expenses. \nYou will pay to the U.P. State Industrial Development \nCorporation Ltd. Within 30 days from the date of the \ndemands made by this corpo ration from time to time such \nrecurring fee in the nature of service and/or maintenance \ncharges as determined by this corporation. In case of \ndefault you will be liable to pay interest @15.00% p.a. on \nthe amount due . \nxxx xxx xxx  \n13. You will have to take over possession of the land \nexecuting the lease deed within 30 days from the date of \ninviting you to do so or within 3 months from the date of this \nletter whichever is earlier. ” \n                         [Sic] \n \n4.3. After allotment , KNMT  inspected the Subject Land and asserted that \nit was encroached upon by third parties, seeking demarcation by the \nrelevant State Authorities. Simultaneously, KNMT  defaulted in paying \nthe ‘reservation money’ by the prescribed date of 18.10.2003. \nResponding to this default, UPSIDC , vide communication dated \n04.11.2003, granted an extension until 17.11.2003 for payment along \nwith interest , while clearly stipulating that non -compliance would \nresult in automatic cancellation of the allotment.  \n4.4. KNMT  deposited the reserve amount through two demand drafts \ndated 17.11.2003 and requested that UPSIDC  not levy any interest Page 5 of 29 \n until physical possession  of the Subject Land  was granted to it. \nUPSIDC , vide letter dated 11.12.2003, categorically rejected the \naforesaid request by stating that the same was  violative of its policy . \nThereafter, UPSIDC  afforded KNMT  a three -day window to provide its \nunconditional  consent to preserve the validity of the allotment.  \n4.5. Subsequently, KNMT , admittedly , vide letter dated 15.12.2003, \nresponded to UPSIDC ’s communication, confirming payment of the \ninterest amoun t while simultaneously express ing discontent \nregarding the levy of such interest and requested UPSIDC  to \nreconsider its decision. Ultimately , after multiple correspondences, \nthis issue was finally resolved vide letter dated 07.01.2004, whereby \nKNMT  accepted the conditions of the Allotment  Letter . Appellant No.  \n2 (official of KNMT ) thereafter explicitly agreed to the original terms \nand conditions, including to deposit the reservation amount  along \nwith requisite interest , for completion of allotment of the Subject \nLand.  Concurrently, it bears emphasis that KNMT  wrote several \nletters seeking demarcation and handing over of possession of the \nSubject Land after the removal of alleged encroachments. However, \nno action was allegedly taken in respect of these communications.  Page 6 of 29 \n 4.6. Soon thereafter , vide letter dated  21.02.2004, UPSIDC  apprised KNMT  \nof a policy change, whereby KNMT  was directed to execute the lease \ndeed prior to delivery of possession. Accordingly, KNMT  was required \nto furnish the necessary documents and make requisite payments for \nthe execution of the lease deed within 15 days, failing which UPSIDC  \ncautioned that it would proceed with cancellation of allotment of the \nSubject Land.  \n4.7. Notably, t he Allotment Letter required KNMT  to make payments in a \nscheduled manner.  KNMT  nonetheless failed to pay the instalments  \nand requested rescheduling of the same vide letter dated 11.03.2005. \nUPSIDC , in response, assured them of consideration of their request \nand, in the interim , directed them to pay the lease rent and also to \nprovide the necessary documents for the execution of the lease deed.  \n4.8. UPSIDC , on 01.07.2005, approved  the request for rescheduling the \npayment  and directed  KNMT to pay the total amount of INR \n1,44,27,313 /- in ten instalments over a period of 5 years along with \n15% interest starting from the date of issuance of the aforesaid letter , \nwhich reads as  follows : \n \n“Please refer your undated letter on the above subject by \nwhich you requested to reschedule the total amount of your \nplot and sought permission to pay the first installment in \nJuly 2005. In this connection, you are informed that Page 7 of 29 \n according to your request, the approval of the headquarter \nhas been issued to reschedule the total amount of \nRs.1,44,27,313=10 paise to be paid in 10 six monthly \ninstallments including 15°/o interest and the first \ninstallments of 10 % amounting to Rs. 14,42,731=35 paise \nis payable by 01.07.2005. The balance 90  % amount is to \nbe paid in six monthly (a) further installments including the \ninterest. You are therefore requested to please arrange to \ndeposit the first installment of the amount of Rs. \n14,42,731=35 p aise as early as possible. ” \n              [Sic] \n4.9. However, KNMT failed to adhere to the aforesaid schedule as well and, \nhaving defaulted in payment, UPSIDC issued a notice dated \n14.12.2005 , thereby mandating it to deposit a sum of INR \n39,76,404.85/ - (inclusive of interest and the previous pending \namount). KNMT, conversely , continued to request UPSIDC to \nhandover possession and to reconsider the decision to levy interest.  \n4.10.  Following the continued non -compliance, UPSIDC  issued a final \nnotice dated 13.11.2006, calling upon  KNMT  to deposit an amount of \nINR 68,49,869.20/ - as well as to submit the necessary documents for \nexecution of the lease deed. The notice stipulated a deadline of 10 \ndays, failing which the allotment of the plot would be cancelled as per \nthe terms of the Allotment Letter. The relevant portion of the notice is \nas follows :  \n“…. Now last and final notice is hereby given to you to \nplease submit an amount of Rs. 68,49,869.20 accrued upto \n30.6.2006 and submit the desired documents within TEN Page 8 of 29 \n DAYS from the date of this letter failing which allotment of \nplot shall be cancelled as per Clause No. 15(a) & (b) of \nallotment letter dated 18.9.03 and the money deposited by \nyou shall stand forfeited.”  \n \n \n4.11.  In response, KNMT , without making the payment, vide letter dated \n04.12.2006, repeated its earlier request to hand over the possession \nof the land after demarcation and sought removal of the \nencroachment. UPSIDC  replied on 13.12.2006, stating that \npossession of the land could only be handed over after execution of \nthe sale deed. The letter also underscored KNMT ’s failure to deposit \nthe requisite documents  for execution of the lease deed or any amount \nexcept the reserve amount since 2003.  In this light, UPSIDC  finally \ndeclined KNMT ’s representation. The letter dated 13.12.2006 \nelucidated that :  \n“In this regard, it is informed you that the above said land \nwas allotted to you in September, 2003 thereafter you have \ndeposited only 10°/o amount of allotment. Later on in the \nyear, 2005 the re -schedulement was made on your request, \nbut despite that no pa yment has been made by you till \ntoday, only writing for marking. As per the rules of the \nCorporation, the possession of the land can be given after \ndue payment and execution of lease deed. Neither you have \nmade payment nor have submitted the requisite doc uments \nof lease deed. You have only taking time by way of \nunnecessary correspondence.  \nYou had been requested to get execute the lease deed after \nmaking due payment so that the possession can be given to \nyou. But, the aforesaid actions, you by not making the \npayment of dues and execution of lease deed, you want to \nevade the matter by making unnecessary correspondences. \nHence, the representation submitted by you is declined. ” \n      [Sic] Page 9 of 29 \n  \n4.12.  Feeling aggrieved, KNMT  assailed the letter dated 13.12.2006  before \nthe High Court  through  Writ Petition No. 349/2007 (MB)  (First Writ ). \nMeanwhile , the allotment of the Subject Land was cancelled vide the \norder dated 15.01.2007 , which was also challenged by KNMT  by \namending the First Writ Petition.  \n4.13.  The High Court, vide interim order dated 13.02.2007, restrained \nUPSIDC  from making any fresh allotment of the Subject Land. \n4.14.  Ultimately, the High Court disposed of  the First Writ vide order dated \n27.05.2009 with a direction to restore the allotment in favo ur of \nKNMT, subject to certain conditions , including completion of all \nformalities  in accordance with the Allotment Letter and revalidation \nof demand drafts.  \n4.15.  Aggrieved, UPSIDC  challenged  the order dated 27.05.2009 before \nthis Court vide SLP (C) No. 14680/2009 , wherein the matter  was \nremitted back to the High Court with the following observations :  \n“It is apparent from the impugned order that the \nrespondents challenged the cancellation order dated \nJanuary 15, 2007 by filing a petition for amendment in the \nwrit petition. Admittedly, the Court, without discussing the \nvalidity of the order dated January 15, 2007, decided the \nmatter in favour of the respondents and directed to restore \nthe allotment and revalidate the demand drafts of \n‘91,27,139.65 and to execute the lease deed in favour of the \nrespondents.  Page 10 of 29 \n Learned counsel for the parties accept that the High Court \nought to have given reasons regarding validity of the order \nof cancellation dated January 15, 2007 before passing the \nimpugned order.  \nIn the circumstances, we are of the view that the case \nshould be remitted to the Division Bench of the High Court \nfor its decision on merits.  \nWe, accordingly, allow this appeal, set aside the impugned \njudgment and order dated May 27, 2009, and remit the case \nto the Division Bench of the High Court for its decision on \nmerits expeditiously. ” \n \n4.16.  It is pertinent to note that , in the interregnum , UPSIDC  allotted the \nSubject Land to M/ s Jagdish pur Paper Mills Ltd i.e. Respondent No.3 , \nwhich was challenged by KNMT  before the High Court  through \nanother Writ Petition bearing  Misc. Bench No. 11055/2013  (Second \nWrit). The High Court therein directed the parties to maintain status \nquo with regard to the Subject Lan d. UPSIDC  challenged the said \ninterim order dated 27.11.2013 by means of SLP (C) No. 7952/2014  \nwherein vide order dated 07.04.2017, th is Court directed  the High \nCourt to expeditiously adjudicate both the Writ Petition s filed by \nKNMT.   \n4.17.  Consequently, the High Court  heard the matter  and, vide the \nImpugned Order , upheld the cancellation of the allotment of Subject \nLand. In doing so, t he High Court held that: Page 11 of 29 \n i) KNMT  failed to follow the stipulations of the allotment as it did \nnot adhere to the payment schedule ;  \nii) The explanation for delayed payment provided by KNMT , though \nreasonable, failed to form part of the terms and conditions of \nallotment. In other words, strict adherence to the payment \nschedule was necessary ; and \niii) UPSIDC  rightly cancelled the allotment of Subject Land by \ncomplying with  the terms of  The Manual for Marketing and \nManagement of Industrial Areas (Manual ), specifically citing  \nClause 3.04  (vii), which postulates that :  \n“(vii) If an allottee has not paid the dues despite three \nconsecutive legal notices, the Regional Manager shall be \nrequired either to cancel the allotment or send his \nrecommendation for issue of Recovery Certificate. ” \n \n4.18.  It is in this factual backdrop that the aggrieved  KNMT  is before this \nCourt . It must further be noted that, d uring  the pendency of the \ninstant appeals, this Court, vide order dated 17.11.2017, stayed the \noperation of the Impugned Order.  \nB. CONTENTIONS OF THE PARTIES  Page 12 of 29 \n 5. We have heard Learned Senior Counsel s for the parties at a \nconsiderable length and meticulously perused the documents \nsubmitted on record.  \n6. Mr. Maninder Singh, Learned Senior Counsel appearing on behalf of \nKNMT  made  the following contentions : \na. The High Court erred in its conclusion that KNMT  failed to make \npayment of the allotment price as per  the schedule. On the \ncontrary, UPSIDC  failed to transfer the physical possession of the \nSubject Land and merely continued to demand the outstanding \namount without fulfilling its reciprocal contractual obligations. \nKNMT  wrote several letters requesting  to deliver  possession . \nHowever, UPSIDC  continued to make excuses  and used the \noutstanding dues as a cloak for not handing over possession of \nthe Subject Land to KNMT . In other words, UPSIDC  allegedly \nfrustrated the contract.  \nb. UPSIDC ’s refusal to demarcate the Subject Land contravenes the \nprovisions contained in the Allotment Letter. It was thus \nemphasi zed that UPSIDC was not in a position to handover the \nphysical possession as the farmers were still holding the Subject \nLand and continued to cultivate it for agricultural purposes.  Page 13 of 29 \n c. Pursuant to the High Court’s directions dated 27.05.2009, KNMT  \nduly deposited the due amount with UPSIDC , which has \nremained unutilized  for more than ten years. Evidently, KNMT  \nduly abided by both the terms of the Allotment Letter as well as \nthe directions given by the High Court.  \nd. The High Court erroneously interpreted Clause 3.04  (vii) of the \nManual, which stipulates that UPSIDC  must give three legal \nnotices to defaulters. In the instant  case, UPSIDC  sent only one \nsuch notice dated 13.11.2006. UPSIDC , therefore , failed to abide  \nby the conditions prescribed in the Manual, and the cancellation \norder suffers from procedural infirmities. In other words, the \ncancellation of allotment is procedurally flawed and legally \nuntenable, as it disregarded both the mandatory notice s as \ncontemplated under the Manual as well as the fundamental \nprinciple of reciprocal contractual obligations, where possession \nand demarcation ought to have preceded demands for full \npayment.  \n7. Per contra , Mr. K.K. Venugopal and Mr. Atmaram N .S. Nadkarni, \nLearned Senior Counsel s, represent ed UPSIDC  and canvassed  the \nfollowing submissions : Page 14 of 29 \n a. UPSIDC provided ample opportunities for KNMT to make \npayment as per the terms and conditions of the allotment. \nHowever, KNMT chose to delay payment for more than six years \nfrom the date of allotment on false, misleading and specious \ngrounds. Moreover, KNMT could not hono ur its commitment even \nafter UPSIDC, taking a lenient view, rescheduled the payment \nterms. Furthermore , despite the High Court ’s directions dated \n12.03.2007, KNMT paid only the outstanding principal amount \nwithout any interest or additional fees for restoration.  \nb. The procedure outlined  in Clause 3.04 of the Manual was duly \nadhered to by UPSIDC  through notices dated 14.12.2004, \n1.07.2005, 14.12.2005, and 13.11.2006. Strangely, \nnotwith standing the rejection of its request for waiving of interest, \nKNMT  repeatedly implored UPSIDC  to reconsider the same  rather \nthan making payment towards the allotment price. \nc. The allegations regarding  the non -demarcation and \nencroachment on the Subject Land are false and vexatious. The \nAllotment Letter issued to KNMT  itself contained the site plan \nalong with precise measurement s and the area of land in the plot. \nFurthermore, to the satisfaction of KNMT , UPSIDC  had Page 15 of 29 \n demarcated the Subject Land on 03.03.2005 , which  was duly \nacknowledged by KNMT in its letter dated 11.03.2005.  \nd. UPSIDC  had charged the interest  in consonance with the terms \nof the Allotment Letter accepted by KNMT . In this regard, a \npointed reference was made to  Clause s 3 and 5 of the Allotment \nLetter, whereunder the method of computation of interest on the \noutstanding balance was duly provided.  \ne. Lastly, KNMT  itself has admitted the non-payment  of dues  before \nthis Court . Further, the current market value of the Subject Land \nis valued in the range of more than a hundred crores.  In these \ncircumstances, the instant appeal is wholly without merit and \nought to be dismissed.  \nC. ISSUES  \n8. Having considered the rival contentions advanced by the parties, it is \nevident that the central issue concerns the legality of the cancellation \nof allotment by UPSIDC . Given the nature of the dispute and the \ncompeting interpretations regarding procedural compliance, we find it \nappropriate to examine the following issues:  \ni) Whether UPSIDC  is responsible for frustrat ing the performance \nof the allotment contract ? Page 16 of 29 \n ii) Whether the cancellation of allotment of the Subject Land  was \nprocedurally defective  and legally untenable ? \nD. ANALYSIS  \nD.1 ISSUE NO.1: Whether UPSIDC is responsible for frustrating the \nperformance of the allotment contract . \n9. Although the issue in these Appeals revolves around the cancellation \nof allotment by UPSIDC, we deem it necessary first to  address the \nKNMT ’s plea  pertaining to the alleged frustration of the contract. To \nclarify, these contentions concern the purported non -demarcation, \nalleged encroachment, and non -delivery of possession of the Subject \nLand by UPSIDC. For our analysis, we must collocate these insta nces \nagainst the factual matrix as well as the terms of allotment to \nconclusively ascertain the plausibility of frustration of the contract.  \n10. Firstly , on a careful scrutiny of the record, we find that though KNMT \naddressed multiple communications to UPSIDC  alleging non -\ndemarcation of the Subject Land , such communication s were, \nhowever , ex-facie an afterthought . We say so for the reason that the \nsite plan appended with the Allotment Letter has described  precise \nmeasurements and all other relevant details pertaining to  the Subject Page 17 of 29 \n Land. That apart, the allotment was made on an ‘as it is where it is ’ \nbasis.  \n11. In any case, UPSIDC demarcated the Subject Land on 03.03.2005 to \nthe satisfaction of KNMT , and the latter also acknowledged such \nfactum  vide letter dated 11.03.2005 , which reads as under:  \n“It is to inform that the demarcation of the said land has \nbeen made on 03.03.2005 by the department, which I \nagree. Please inform the value of the stamp papers required \nfor the execution of the registry of the said land, so that I \nmay get the lease deed of the said land executed, so that \nfurther work may be proceeded. ” \n \n12. There is thus no merit in the contention that KNMT suffered any \nprejudice due to the purported non-demarcation  of the Subject Land . \n13. Secondly , in so far as the encroachment at the site is  concerned, the \naffidavits filed by UPSIDC enumerate details of the 276 Khasra \nnumbers constituting the Subject Land. UPSIDC has further clarified \nthat possession of the said land was duly taken after completing the \nacquisition  process , which included payment of compensation to the  \nlandowners . These averments are duly supported with documentary \nproof . We, therefore, find that the allegation of encro achment is thus \ndevoid of any merit.  Page 18 of 29 \n 14. Lastly , we must consider whether UPSIDC erred in not handing over \npossession of the Subject Land despite several requests made by \nKNMT. In this regard, Clause 2.15 of the Manual , which deals with \nthe delivery of possession of plots,  proves instructive . It provides that : \n“2.15. POSSESSION OF PLOTS  \n(i) The date of Possession of Plots shall be fixed by the \nRegional Manager after registration of Lease Deed itself.  \n(ii) That date so fixed shall be intimated to the lessor \nalongwith the second copy of the lease deed and the \nconcerned Junior Engineer for necessary action on their part \nthrough a letter.  \n(iii) Effort shall be made to hand over possession within 15 \ndays of the registration of the lease deed as far as \npracticable.  \n(iv) If the lessee fails to take possession even after issuance \nof two letters, legal notice of the same may be issued and \naction may be taken accordingly. ” \n15. It may be seen that UPSIDC was obligated to hand over possession \nonly after registering the lease deed , which was a mandatory \ncondition. The Clause  categorically stipulates that the Regional \nManager shall fix the date of possession only ‘after registration of \nLease Deed itself ’, thereby creating a sequential condition  wherein \nregistration must precede possession.  \n16. That being so, it becomes pellucid that the insistence of UPSIDC  to \nfurnish requisite documents for registration of the lease deed was both \nlegitimate and in conformity  with the prescribed procedure . Since Page 19 of 29 \n KNMT  failed to  furnish the necessary documents in a timely manner , \nit is itself to blame for the non-delivery of possession.  \n17. Our examination of all three contentions raised by KNMT reveals that \nnone of the alleged acts —non-demarcation, removal of encroachment, \nor non -delivery of possession —constitute conduct that would \nfrustrate the performance of the allotment terms. On the contrary, the \nrecord demonstrates that UPSIDC acted in accordance with \nprescribed procedures and as per the terms of allotment. In contrast, \nKNMT failed to fulfil its obligations, particularly regarding the timely \nsubmission of documents required for executing the lease deed. The \nfoundation upon which KNMT forges its argument of frustration thus \ncrumbles.  \nD.2 Issue No.2: Whether the cancellation of allotment of the Subject \nLand was procedurally defective and legally untenable.  \n18. Adverting to the alleged illegality in the cancellation of allotment by \nUPSIDC, KNMT relies on Clause 3.04 of the Manual, which prescribes \nthe procedure to address defaults by allottees. The relevant C lause in \nthis regard is reproduced in totality below for ease of analysis:   \n“3.04 ACTION AGAINST DEFAULTERS  \nIn case payment is not received by 31st January/31st July \nlegal notice shall be issued to the defaulting \nallottees/licences/lessees in the following manner.  Page 20 of 29 \n (i) The Regional Man ager shall ensure that the legal notice \nin all the defaulting cases are issued by 10th February and \n10th August.  \n(ii) A separate file shall be opened in every Regional Office \nin which the Dealing Assistant and concerned officer shall \ngive a certificate that notice to all defaulting allottees have \nbeen issued. This certificate shall be verified by the Regional \nManager . \n(iii) The legal notice shall be sent by Registered Post with \nA/D and appropriate entry in the Legal Notice Register shall \nbe made. The legal notice shall be issued in terms of the \nallotment letter/licence agreement/lease deed and the \nperiod by which the pa yment is required shall also be \nstrictly in accordance with the terms of allotment \nletter/licence agreement/lease deed.  \n(iv) After the expiry of the period of legal notice and \nconfirmation of its service it shall be the responsibility of the \nDealing Assistant to process the file within 15 days. The \nsame shall then be put up before the Regional Manager for \nhis orders and ins truction for cancellation or otherwise.  \n(v) If the Regional Manager decides not to cancel the \nallotment of plot and the next due date of payment of \ninstalment of premium/interest has fallen, then another \nlegal notice shall be issued in the manner specified above.  \n(vi) After the expiry of the legal notice, if no payment is \nreceived it shall be the responsibility of the concerned officer \nto put up the file to the Regional Manager and obtain his \norders about cancellation of allotment or issuance of \nRecovery Certificat e or otherwise.  \n(vii) If an allottee has not paid the dues despite three \nconsecutive legal notices, the Regional Manager shall \nbe required either to cancel the allotment or send his \nrecommendation for issue of Recovery Certificate.  \nHowever, if Regional Manager feels that further time should \nbe accorded, he shall do so with the approval of Head Office \nonly.  \n(viii) List of defaulters for amount exceeding Rs.20,000/ - \nmay be published in newspaper in the month of \nFebruary/September at least once in a year, after obtaining \napproval of Head Office. ” \n                [Emphasis Supplied ] Page 21 of 29 \n 19. A bare perusal of the above -reproduced  provision reveals a well -\ndefined procedure prescribed to address defaults by allottees. During \narguments, KNMT placed considerable emphasis on sub -clause (vii), \ncontending that UPSIDC had failed to issue the stipulated three \nconsecutive legal notices. KNM T nevertheless conceded that the notice \ndated 13.11.2006 could be considered a ‘legal notice ’ within the \nmeaning of the aforesaid Clause. Per contra , UPSIDC maintains that \nthe previous correspondence dated 14.12.2004, 01.07.2005, and \n14.12.2005 also substa ntially satisfied the ingredients of a ‘legal \nnotice ’ as contemplated under the Manual.  \n20. It seems to us that this issue ought  to be examined through the prism \nof administrative law principles vis-à-vis the contractual powers of the \nState. While it is well -settled that land allotment authorities such as \nUPSIDC possess the inherent right to cancel allotments upon violation \nof stipulated conditions, this Court has consistently emphasized  that \njudicial intervention in matters concerning land revocation should be \ncircumscribed to ensure adherence to procedural safeguards.1 This \nparadigm underscores the administrative autonomy vested in such \n \n1 Dilip Singh and Ors v. State of Haryana and Ors., (2019) 11 SCC 422, paragraph 22.  Page 22 of 29 \n authorities while safeguarding allottees ’ rights through procedural \nfairness.  \n21. As already elucidated, KNMT relies upon Clause 3.04  (vii) of the \nManual to assert that non -issuance of the requisite legal notices  by \nUPSIDC resulted in procedural illegality. In this light, it becomes \nincumbent upon us to ascertain whether the correspondence issued \nby UPSIDC satisf ies the threshold requirement of ‘three consecutive \nlegal notices ’ as mandated under the said provision and, \nconsequently, whether the cancellation of allotment was procedurally \nsound. To resolve this issue, we must determine the  essential \ncharacteristics that embody a ‘legal notice ’ within the contemplation \nof the Manual.  \n22. It may be recapitulated that the notice dated 13.11.2006 has been \nunderstood as a ‘legal notice ’ by both sides . Upon comparative \nanalysis of the communications, particularly those dated 14.12.2004 \nand 14.12.2005, we find that these bear substantial similarity with \nthe notice dated 13.11.2006. It is beyond our comprehension  as to \nwhat prejudice has really been caused to KNMT merely because these \nnotices are not captioned as legal notices .  Page 23 of 29 \n 23. It further appears to us that the expression ‘legal notice’ connotes an \nunambiguous  communication along with legal consequences to a \nnoticee  who is alleged to be in default . Illustratively, the essential \nelements of a legal notice would include :  \na. It should contain a clear and concise set of facts which convey \nthe information leading to the relevant circumstances.  This \nelement is also fulfilled when reference is made to any earlier \ncommunications issued between the concerned parties ; \nb. It should convey the intimation of any impending legal obligation \nor breach committed by any party ;  \nc. It should convey the intention of the party issuing the \ncommunication to hold the other party liable to appropriate legal \naction or charge ; and \nd. The communication in toto must be unambiguous and should not \nmislead or suppress material information. If issued under a \nStatute, it must comply with the relevant requirement s \nprescribed therein  as well.  \n24. If the  communications dated 14.12.2004, 14.12.2005, and \n13.11.2006 are juxtaposed to the abovementioned ingredient s, we Page 24 of 29 \n have no reason to doubt that the se constitute valid ‘legal notices ’ and \nthus, UPSIDC has duly complied with  the process envisaged under \nClause 3.04(vii) of the Manual.  \n25. We may hasten to add  at this stage  that the  dues for the Subject Land, \nallotted in 2003, remained unpaid despite multiple communications \nspanning several years. KNMT not only failed to make timely \npayments but also sought unwarranted concessions, including waiver \nof interest and rescheduling of dues. This persistent non -compliance \nestablishes KNMT as a chronic defaulter, while the continued \nattempts  to seek waiver evince a deliberate strategy to avoid payment \nobligations. UPSIDC ’s action in treating KNMT as a defaulter was , \ntherefore , both justified and necessary to preserve the integrity of the \nallotment process. Allowing such deliberate defaults to persist \nunchecked would undermine the entire framework of land allocation \nand set a detrimental precedent.  \n26. For the reasons stated, we are satisfied  that the cancellation of \nallotment by UPSIDC is fully justified  and in accordance with law.  \nE. INVOKING THE PUBLIC TRUST DOCTRINE  IN THE ALLOCATION OF \nRESOURCES .  Page 25 of 29 \n 27. The prolonged litigation initiated by KNMT has spanned over fifteen \nyears, unnecessarily burdening the judicial system and impeding the \nefficient functioning of public authorities. Such protracted disputes \nhighlight the need for more stringent initial evaluation processes to \nprevent chronic defaults.  \n28. While we have upheld the cancellation due to KNMT ’s default, the \ncircumstances reveal systemic concerns in the original allocation \nprocess. UPSIDC allotted the Subject Land to KNMT within merely two \nmonths of application, raising questions about the thoroughness of \nthe evaluation. Furthermore, during the pendency of this dispute, \nUPSIDC demonstrated remarkable alacrity in considering alternative \nallotments to M/s. Jagdishpur Paper Mills Ltd.  \n29. We, therefore,  consider it necessary to examine whether UPSIDC ’s \nprocedure for industrial land allotment meets standards of \nadministrative propriety, particularly in light of the Public Trust \nDoctrine  (Doctrine ) mandating that public resources be managed \nwith due diligence, fairness, and in conformity with public interest.  \n30. The Doctrine  emanates from the ancient principle that certain \nresources  (seashores, rivers and forests)  are so intrinsically important \nto the public that they cannot be subjected to unrestricted private Page 26 of 29 \n control. Rooted in Roman law and incorporated into English common \nlaw, this Doctrine recogni zes that the Sovereign holds specific \nresources as a truste e for present and future generations.2 \n31. In the Indian context, the Doctrine has evolved to encompass public \nresources meant for collective benefit, reflecting the constitutional \nmandate under Article 21. As held in Natural Resources Allocation \nIn re,  while the Doctrine does not impose an absolute prohibition on \ntransferring public trust property, it subjects such alienation to \nstringent judicial review to ensure legitimate public purpose and \nadequate safeguards .3 \n32. When a substantial tract of industrial land is allocated without a \ncomprehensive evaluation, it raises critical questions about \nadherence to these principles. The Doctrine requires that allocation \ndecisions be preceded by a thorough assessment of public benefits, \nbeneficiary credentials, and safeguards ensuring continued \ncompliance with stated purposes.  \n33. The allocation of 125 acres of industrial  land to KNMT without a \ncompetitive process fundamentally violate d the Doctrine , which \n \n2 M.C. Mehta v. Kamal Nath, (1997) 1 SCC 388, para 24 -25. \n3 (2012) 10 SCC 1 . Page 27 of 29 \n demands proper procedure  and substantive accountability in public \nresource allocation.4 UPSIDC  ought to have considered verifiable \nevidence of economic benefits, employment generation potential, \nenvironmental sustainability, and alignment with regional \ndevelopment objectives to demonstrate that the decision serves the \ncollective benefit . The failure to adopt transparent mechanisms not \nonly deprived the public exchequer of potential revenue —as evidenced \nby the substantial appreciation in the value of such a large tract of \nland—but also created a system where privileged access supersedes \nequal opportunity. This betrays the fiduciary relationship between the \nState and its citizens.  \n34. Having  upheld the cancellation  due to KNMT ’s chronic default, we \nobserve that the hasty allotment followed by years of litigation \nexemplifies systemic deficiencies in the allocation process. This \nnecessitates comprehensive directions to ensure that future \nallocations uphold principles of transparen cy and accountability, \nthereby preventing prolonged disputes while ensuring that public \nresources genuinely promote industrial development and economic \ngrowth.  \n \n4 Centre for Public Interest Litigation v. Union of India, (2012) 3 SCC 1, para 94 -96. Page 28 of 29 \n F. CONCLUSION AND DIRECTIONS  \n35. In light of our detailed examination of the contentions raised by the \nparties , the comprehensive analysis of the factual and legal matrix  \nand the resultant conclusions , we uphold the cancellation of the \nallotment by UPSIDC.  \n36. The actual allotment or any offer thereof  made by UPSIDC in favour \nof M/s Jagdishpur Paper Mills Ltd (Respondent No.3) for the Subject \nLand is also declared to be illegal , contrary to public policy and is \nconsequently annulled . However, if any earnest money or any \npayment has been received from the said prospective allottee, the \nsame is directed to be refunded along with interest at the rate granted \nby the Nationalized  Banks.  \n37. The appeals are accordingly dismissed with no order as to costs.  \n38. However, considering the broader  implications for the transparent \nallocation of public resources and the need to strengthen \nadministrative accountability in industrial land distribution, we deem \nit appropriate to issue the following directions : \ni) The State Government of Uttar Pradesh  and UPSIDC  are directed \nto ensure that any such allotment in the future be made in a Page 29 of 29 \n transparent, non -discriminatory and fair manner by ensuring \nthat such allotment process fetches maximum revenue and also \nachieves the larger public interest like  industrial development \npriorities, environmental sustainability, and regional economic \nobjectives; and  \nii) The Subject Land shall also be allo tted strictly in accordance with \nthe procedure as illustrated in  direction ( i) above . \n39. Ordered accordingly. Pending applications, if any, also stand disposed \nof in the above terms.  \n \n…..........................J.  \n                          (SURYA KANT)  \n \n \n         \n             ………….………………..........................J.  \n        (NONGMEIKAPAM KOTISWAR SINGH)   \n \n \n \nNEW DELHI;  \nDated: May 30, 2025"
}