{
  "filename": "MACHHINDRANATH_S_O_KUNDLIK_TARADE_DECEASED_THROUGH_L.RS._VS._RAMCHANDRA_GANGADHAR_DHAMNE.pdf",
  "page_count": 29,
  "content": "2025 INSC 795\nREPORTABLE\nIN THE SUPREME COURT OF INDIA\nCIVIL APPELLATE JURISDICTION\nCIVIL   APPEAL NO.         OF 2025  \n[@ SPECIAL LEAVE PETITION (CIVIL) NO.7728 OF 2020 ]\nMACHHINDRANATH S/O KUNDLIK TARADE\nDECEASED THROUGH LRS                  …APPELLANTS\nA1:  BHAGIRATHIBAI \nA2:  ASHABAI\nA3:  BHAUSSAHEB\nA4:  MEENABAI\nVERSUS\nRAMCHANDRA GANGADHAR DHAMNE & ORS.       …RESPONDENTS\nR1: RAMCHANDRA GANGADHAR DHAMNE\nR2: ASHOK\nR3: CHHAYA BABASAHEB GADHE\nR4: NARESHKUMAR BABASAHEB GADHE\nR5: BALASAHEB\nJ  U  D  G  M  E  N  T\nAHSANUDDIN AMANULLAH, J.\n                  1 of 29Leave granted.\n2.       The present appeal impugns the Final Judgment and Order dated\n15.01.20191 in Letters Patent Appeal (hereinafter abbreviated as ‘LPA’)\nNo.33/1998 in First Appeal No.624/1992 (hereinafter referred to as the\n‘Impugned Order’) passed by the High Court of Judicature at Bombay,\nBench at Aurangabad (hereinafter referred to as the ‘High Court’), whereby\nthe appeal preferred by the appellants was dismissed and Judgment and\nOrder dated 17.09.1993 [ 1994 MhLJ 558 ] in First Appeal No.624/1992\npassed by the learned Single Judge of the High Court was affirmed. The\nlearned  Single  Judge  differed  with  the  Judgment  and  Order  dated\n27.03.1980 in Special Civil Suit No.49/1973 passed by the learned Civil\nJudge, Senior Division, Ahmednagar (hereinafter referred to as the ‘Trial\nCourt’) and set aside the decree of possession so granted by the Trial\nCourt.\nPARTIES:\n3.     The appellants before us, along with respondent no.5, are the Legal\nRepresentatives (hereinafter abbreviated to ‘LRs’) of the original plaintiff.\nRespondent no.1 is the original defendant no.1 and respondents no.2  to 4\n1 Cause Title corrected by the High Court vide Speaking to Minutes Order dated 11.09.2019.\n                  2 of 29are the LRs of the original defendant no.2. Despite valid service of notice,\nno one has entered appearance on behalf of respondents no.1, 2, and 5.\nThough, when the matter was heard and judgment was reserved by this\nCourt,  learned  counsel  for  respondents  no. 3  and  4  was  not  present,\nhowever, subsequently, in terms of the Order dated 17.12.2024, a note of\nwritten  submissions  has  been  filed  on  their  behalf,  which  is  taken  on\nrecord.\nFACTUAL MATRIX :\n4.       For the sake of convenience and clarity of facts, the parties shall be\nreferred to as per their status/position in the suit. The suit property is\nagricultural  land  bearing  Survey  No.30  situated  at  Village  Kendal  Bk.,\nTaluka Rahuri, Ahmednagar, Maharashtra admeasuring 15 Acres and 17\nGuntha (hereinafter referred to as the ‘suit land’). The suit land was the\nancestral property of the original plaintiff-Machhindranath. On 20.04.1956,\nthe plaintiff enrolled as a member of the Kendal Bk. Vividh Karyakari Seva\nSahakari Sanstha  Limited (hereinafter referred to as the ‘Society’), which,\nadmittedly, is a registered Co-operative Society in terms of the provisions\nof the Maharashtra Co-operative Societies Act, 1960 (hereinafter referred\nto as the ‘Act’). Thereafter, the plaintiff obtained a loan from the Society,\nwhich was to be repaid by 09.11.1971, and created a charge on the suit\n                  3 of 29land in favour of the Society. A declaration to this effect was made by the\nplaintiff on 15.08.1969 and subsequently, Mutation Entry no.3346 came to\nbe recorded on 09.09.1969 mentioning this declaration.\n5.       As things stood, the plaintiff found himself in a financial crunch and\napproached  defendant  no.1  for  a  loan  of  Rs.5,000/-  (Rupees  Five\nThousand). Defendant no.1 was none other than the plaintiff’s nephew as\nalso his son-in-law. Defendant no.1 extended such loan and as security,\nthe plaintiff executed a Registered Sale Deed dated 02.11.1971 of the suit\nland in his favour. On the same day, a document styled as ‘ Ram Ram\nPatra’ (hereinafter referred to as the ‘Reconveyance Deed’) was executed\nby defendant no.1 mentioning that the total value of suit land is around\nRs.25,000/- (Rupees Twenty-Five Thousand) and that he would re-convey\nthe  suit  land  on  repayment  of  Rs.5,000/-  (Rupees  Five  Thousand).\nMutation Entry no.3520 came to be recorded in the name of defendant\nno.1 qua the suit land on 24.12.1971.\n6.      On 15.07.1972, defendant no.1 executed a Registered Sale Deed in\nfavour of defendant no.2 in respect of 10 Acres of the suit land for a\nconsideration of Rs.30,000/- (Rupees Thirty Thousand). As a consequence\nof the said Sale Deed dated 15.07.1972, Survey No.30 came to be divided\nin two parts. The land sold to defendant no.2 was Survey No.30/1 and the\n                  4 of 29remaining portion became Survey No.30/2. On knowledge of the Sale\nDeed executed by defendant no.1 in favour of defendant no.2, the plaintiff\napproached  the  Trial  Court  on  28.02.1973  by  filing  Special  Civil  Suit\nNo.49/1973  seeking  possession  of  Survey  Nos.30/1  and  30/2  and  a\ndirection for re-conveyance of the same along with mesne profits. After the\ninstitution of the suit, defendant no.2 filed an application to the Society to\nstrike off its charge on the suit land. Vide a Resolution dated 03.04.1973,\nthe  Society  resolved  that  the  charge  would  be  struck  off  only  after  a\ncompromise takes place in respect of the land. However, subsequently, by\na Resolution dated 27.08.1973 passed by the Society, the suit land came\nto be released by the Society from its charge, on account of repayment of\nthe loan by the plaintiff.\n7.       After considering the evidence placed on record by the parties, the\nTrial Court held, vide Order dated 27.03.1980, that the Sale Deed dated\n02.11.1971 was void under Section 48 of the Act and that defendant no.2\nhad failed to prove that he was a  bonafide purchaser for value without\nnotice.  However,  on  the  question  of  bar  under  the  Prevention  of\nFragmentation  and  Consolidation  of  Holdings  Act,  1947  (hereinafter\nreferred to  as  the ‘Fragmentation  Act’), the  Trial  Court found that  the\nalienation  was  in  pursuance  of  the  Certificate  granted  under  the\nFragmentation  Act.  In  the  result,  Trial  Court  passed  a  decree  for\n                  5 of 29possession of the suit land with direction to defendant no.1 to execute the\ndeed  of  reconveyance  of  the  suit  land  in  favour  of  the  plaintiff  after\nreceiving Rs.5,000/- (Rupees Five Thousand) from him.\n8.       Against the decree supra, defendant no.2 initially approached the\nHigh Court of Judicature at Bombay by filing First Appeal No.457/1980,\nwhich was later transferred to the Aurangabad Bench and re-numbered\nFirst Appeal No.624/1992. The learned Single Judge  vide Order dated\n14.10.1988  remanded  the  matter  to  the  Trial  Court,  by  framing  four\nadditional issues. On remand, the Trial Court considered the four issues\nwith fresh evidence of the parties, and vide Order dated 28.04.1989 found\nthat the Society was a registered resource society having majority of its\nmembers  as  agriculturists  and  that  the  Society  was  sub-classified  as\nservice resource society. After receipt of the decision of the Trial Court on\nthe four additional issues, the learned Single Judge dismissed the appeal\nand confirmed the decree of possession. Against this, defendant no.2 filed\nLPA No.1/1990, which was allowed by a Division Bench and the matter\nwas remanded to the learned Single Judge for fresh reconsideration on all\nissues.  Pursuant  thereto,  the  learned  Single  Judge  reconsidered  the\nevidence and allowed the first appeal thereby setting aside the decree of\npossession and dismissing the suit brought by the plaintiff. Aggrieved by\nthese  findings,  the  original  plaintiff  (predecessor-in-interest  of  the\n                  6 of 29appellants)  filed LPA  No.33/1998 before  the  Division Bench, dismissal\nwhereof has been occasioned vide the Impugned Order.\nSUBMISSIONS BY THE APPELLANTS :\n9.    Learned counsel for the appellants submitted that the mandate of\nSection 47(2) of the Act very specifically creates an embargo on transfer of\nland in any manner without previous sanction/permission of the Society\nand as per Section 47(3) of the Act, transfer made in contravention of sub-\nsection  (2)  is  void.  Further,  the  charge  of  Society  was  recorded  in\naccordance with Section 48(a) and Section 48(d) of the Act again creates\nan embargo from alienating the whole or any part of the land specified in\nthe declaration submitted while creating charge under Section 48(a) and\nfurther, Section 48(e) declares such alienations in contravention of Section\n48(d)  as  void.  Admittedly,  the  Sale  Deed  executed  on  15.07.1972  by\noriginal defendant no.1 in favour of defendant no.2, is without any such\nsanction and therefore void in terms of Sections 47(3) and 48(e) of the Act.\nIt was canvassed that the subsequent removal of charge by the Resolution\ndated 27.08.1973 is inconsequential.\n10.      It was pointed out that defendant no.1 had not contested the suit. It\nwas  only  the  subsequent  purchaser/defendant  no.2  who  did  so.\n                  7 of 29Admittedly, defendant no.2 had no presence at the time of the execution of\nthe Registered Sale Deed dated 02.11.1971 or the reconveyance deed of\neven date executed between the plaintiff and defendant no.1. Therefore,\ndefendant no.2 cannot falsify the Sale Deed dated 02.11.1971 and his\ncase had to be limited to that of a  bonafide purchaser for value without\nnotice. The Trial Court specifically observed, on perusal of substantial\nevidence, that the plaintiff had proved the true nature of the transaction\nexecuted  on  02.11.1971  and  that  defendant  no.2  was  not  a  bonafide\npurchaser  on  account  of  the  series  of  admissions  extracted  from  him\nduring cross-examination.\n11.     The learned Single Judge, on remand, had set aside the decree by\ninterpreting Sections 47 and 48 of the Act. The evidence of Narsing Sonar\n(Assistant Registrar, Co-Operative Societies at Rahuri), Karbhari Shete\n(Chief Secretary of the Society) and Ram Krishna Hapse (Secretary of the\nSociety) has been accepted which proves existence of charge on the date\nwhen  the  Sale  Deed  dated  15.07.1972  was  executed  inter-se the\ndefendants.  Although  the  learned  Single  Judge  observed  that  the\ncooperative societies mentioned in Section 48 of the Act must be protected\nagainst defaults in the matter of recoveries, however, significance is given\nto the  release of charge  dated 27.08.1973  and  it  was  held that  such\n                  8 of 29release  would  impliedly  restore  status  quo  ante,  which  is  legally\nimpermissible.\n12.       It was submitted that the specific finding of the Trial Court recorded\nin order dated 27.03.1980 at Paragraph 15 pertaining to defendant no.2\nnot  being  bonafide purchaser  for  value  without  notice,  has  not  been\ndisturbed. This finding had remained unchallenged for absence of any\nground in the appeal. Further, findings about the validity of the Sale Deed\ndated 02.11.1971 had attained finality as they had not been challenged by\ndefendant no.1. The Impugned Order, it was submitted, committed an error\nin concurring with the learned Single Judge to hold that since the suit land\nwas released from the charge of the Society on 27.08.1973, the same\nwould validate the Sale Deed dated 15.07.1972. It was vehemently argued\nthat  the  patent  error  committed  by  the  Impugned  Order  is  in  not\nconsidering that the prior permissions contemplated under Sections 47 and\n48 of the Act were required on the date of the Sale Deed i.e. 15.07.1972\nand subsequent release of charge would not have any retrospective effect\nas such  post-facto approval is not contemplated in the Act, and thus, is\ninconsequential.\n13.     With regard to the Sale Deed dated 02.11.1971, it was submitted\nthat  same  will  have  to  be  appreciated  based  on  the  surrounding\n                  9 of 29circumstances  which  would  include  not  only  the  Reconveyance  Deed\ndated 02.11.1971 but also the act of creating charge by Mutation Entry\nno.3520 on 24.12.1971, which was in teeth of the declaration submitted by\nplaintiff in terms of Section 48(a) of the Act and the evidence of the office-\nbearers of the Society. More so for on that date under Mutation Entry No.\n3346 dated 09.09.1969, the name of the Society was already mutated with\nregard to the suit land, but the said Society was neither noticed nor its\nconsent  was  taken.  On  consideration  of  the  aforesaid  facts,  it  will  be\ncrystalized that the true nature of the Sale Deed dated 02.11.1971 is that\nof a conditional sale. Reliance was placed on Paragraphs 13, 14 & 21-24\nof the decision in C S Venkatesh v A S C Murthy , (2020) 3 SCC 280 .\n14.     Lastly, it was submitted that concurrent finding of fact has never\nbeen an embargo against the power of judicial review in the nature of\nArticle 136 of the Constitution of India, which in fact invokes the concept of\nextraordinary  civil  appellate  jurisdiction  and  the  same  has  been\nappreciated and reiterated by this Court from time to time and recently in\nState of Rajasthan v Shiv Dayal , (2019) 8 SCC 637  wherein it was held\nthat concurrent findings can always be interfered with, when it is pointed\nout that the finding of fact in question is  de hors the pleadings and a\nmisinterpretation of the material on record. On these grounds, learned\n                  10 of 29counsel  prayed  that  the  appeal  be  allowed  and  for  restoration  of  the\nJudgment and Order passed by the Trial Court.\nSUBMISSIONS BY RESPONDENTS NO.3 AND 4 :\n15.      Learned counsel for the respondents no.3 and 4 submitted that the\nImpugned Order rightly considered provisions of the law and dismissed the\nplaintiff’s suit. The plaintiff failed to prove that the sale transaction between\nhimself  and  defendant  no.1  was  a  contract  or  reconveyance  or  loan\ntransaction.  Further,  the  plaintiff  was  conscious  and  aware  about  the\ncharge of the Society and having still entered into the Sale Deed dated\n02.11.1971 with defendant no.1, cannot be allowed to take the benefit of\nhis own wrong and claim that the sale is void ab initio in terms of Sections\n47 and 48 of the Act.\n16.    It was submitted that the plaintiff had not placed on record any\nevidence to show that the market value of the suit land was higher than\nRs.5,000/-  (Rupees  Five  Thousand)  in  the  year  1971.  Therefore,  the\ncontention  of  the  plaintiff  that  the  suit  land  was  sold  for  inadequate\nconsideration  is  unacceptable.  Further,  the  defendants  proved  the\nexecution of the Sale Deed dated 15.07.1972 by defendant no.1 in favour\nof defendant no.2 after receipt of consideration of Rs.30,000/- (Rupees\n                  11 of 29Thirty  Thousand).  Moreover,  the  Sale  Deed  dated  15.07.1972  is  a\nregistered document and the endorsement of the Sub-Registrar shows his\npresence and that consideration of Rs.30,000/- (Rupees Thirty Thousand)\nwas duly received. Hence, validity of the Sale Deed dated 15.07.1972 has\nbeen proved.\n17.    It was submitted that there are concurrent findings in favour of the\ndefendants and there is no perversity in the Impugned Order warranting\ninterference by this Court. On these grounds, learned counsel prayed for\ndismissal of the appeal.\nANALYSIS, REASONING AND CONCLUSION :\n18.      Having heard learned counsel for the parties and going through the\nrecord, including written submissions as filed by the parties concerned, we\nfind that there are multiple factors requiring consideration. The main issue\nis as to whether the conveyance of the suit land by the original plaintiff\ndated 02.11.1971 in favour of defendant no.1 could have been done and,\nthe same having been done, could be sustained in law.\n19.    On the aforesaid point, there is no dispute with regard to the\napplication of Section 48 of the Act which provides that when on any\n                  12 of 29immovable property a charge has been created in favour of any society by\nany member by way of a declaration in pursuance of a loan, then there is\nan embargo on alienating such property during the subsistence of the\ncharge. In this regard, sub-sections (c), (d) and (e) of Section 48 of the Act\nare relevant. The concerned Section is extracted hereunder: \n‘48.  Charge  on  immovable  property  of  members,\nborrowing  from  certain  societies.— Notwithstanding\nanything contained in this Act or in any other law for the time\nbeing in force—\n(a) any person who makes an application to a society of\nwhich he is a member, for a loan shall, if he owns any land or\nhas interest in any land as a tenant, make a declaration in\nthe form prescribed. Such declaration shall state that the\napplicant thereby, creates, charge on such land or interest\nspecified in the declaration for the payment of the amount of\nthe  loan  which  the  society  may  make  to  the  member  in\npursuance of the application and for all future advances (if\nany), required by him which the society  may make to him as\nsuch  member,  subject  to  such  maximum  as  may  be\ndetermined by the society, together with interest on such\namount of the loan and advances; \n(b) any person who has taken a loan from a society of which\nhe is a member, before the date of the coming into force of\nthis Act, and who owns any land or has interest in land as a\ntenant, and who has not already made such a declaration\nbefore  the  aforesaid  date  shall,  as  soon  as  possible\nthereafter, make a declaration in the form and to the effect\nreferred to in clause (a); and no such person shall, unless\nand  until  he  has  made  such  declaration,  be  entitled  to\nexercise any right, as a member of the society; \n(c) a declaration made under clause (a) or (b) may be varied\nat any time by a member, with the consent of the society in\nfavor of which such charge is created;  \n(d) no member shall alienate the whole or any part of the\nland or interest therein, specified in the declaration made\nunder clause (a) or (b) until the whole amount borrowed by\nthe member together with interest thereon, is repaid in full:  \n                  13 of 29Provided that, it shall be lawful to a member to execute a\nmortgage / bond in respect of such land or any part thereof in\nfavour of an Agriculture and Rural Development Bank or of\nthe State Government under the Bombay Canal Rules made\nunder  the  Bombay  Irrigation  Act,  1879  or  under  any\ncorresponding law for the time being in force for the supply of\nwater from a canal to such land, or to any part thereof: \nProvided further that, if a part of the amount borrowed by a\nmember is paid the society with the approval of the Central\nBank to which it may be indebted may, on an application\nfrom the member, release from the charge created under the\ndeclaration made under clause (a) or (b), such part of the\nmovable  or  immovable  property  specified  in  the  said\ndeclaration, as it may deem proper, with due regard to the\nsecurity of the balance of the amount remaining outstanding\nfrom the member; \n(e) any alienation made in contravention of the provisions of\nclause (d) shall be void ; \n(f) subject to all claims of the Government in respect of land\nrevenue or any money recoverable as land revenue, and all\nclaims of the Agriculture and Rural Development Bank in\nrespect of its dues, in either case whether prior in time or\nsubsequent, and to the charge (if any) created under an\naward made under the Bombay Agricultural Debtors Relief\nAct, 1947 or any corresponding law for the time being in\nforce in any part of the State, there shall be a first charge in\nfavour of the society on the land or interest specified in the\ndeclaration  made  under  clause  (a)  or  (b),  for  and  to  the\nextent of the dues owing by the member on account of the\nloan;\n(g) and in particular, notwithstanding anything contained in\nChapter X of the Maharashtra Land Revenue Code, 1966,\nthe  Record  of  Rights  maintained  there  under  shall  also\ninclude the particulars of every charge on land or interest\ncreated under a declaration under clause (a) or (b), and also\nthe particulars of extinction of such charge. \nExplanation - For the purposes of this section the expression\n\"society\" means; (i) any resource society, the majority of the\nmembers of which are agriculturists and the primary object of\nwhich is to obtain credit for its members, or (ii) Any society,\nor  any  society  of  the  class  of  societies,  specified  in  this\nbehalf by him State Government, by a general or special\norder.’\n                  14 of 2920.      From a reading of the aforesaid provision, there is no ambiguity with\nregard to the import of the Section. Alienation of any such property on\nwhich a charge is created in favour of the concerned cooperative society\nby way of declaration is totally beyond the capacity of the owner/member\nwho has declared it as a charged property, until the amount, for which the\ncharge was created along with the interest, is repaid in full. However, even\nif a part of the amount due is paid then a society may, on an application\nmoved by the member, release from charge such part of the property, as it\nmay deem proper having regard to the outstanding amount.\n21.       In the present case, there is no denial to the fact that the charge on\nthe suit land as declared by the plaintiff was prior to the date of him\nexecuting the Sale Deed dated 02.11.1971 in favour of defendant no.1. It\nis also not in dispute that neither the amount for which the charge was\ncreated was repaid to the Society either in full or in part nor any such\napplication for  part-release was either filed  before  or accepted  by  the\nSociety prior to the said sale. Thus, at first glance, it appears to be an\nopen-and-shut case that the said Sale Deed dated 02.11.1971 was void as\nper Section 48(e) of the Act. Further, the subsequent Sale Deed dated\n15.07.1972  by  respondent  no.1/original  defendant  no.1  in  favour  of\ndefendant no.2 on this analogy would also have to be held to be void.\n                  15 of 29However, we hasten to add that a deeper probe is required as to what\nextent the theory of the sale being void ab initio had to be applied has not\nbeen  spelt  out  by  the  statute  and,  thus  is  required  to  be  gone  into\ndepending upon the specific and relevant facts and circumstances of each\ncase as also the ancillary background. Therefore, for the time being, the\nCourt would move to the other issue and thereafter take a final view having\nregard to the overall picture which emerges, for the final disposal of the\ninstant case.\n22.    Coming to the other issue which is as to whether the subsequent\nrelease  of  the  charge  created  on  the  suit  land  by  the  Society  upon\nreceiving the entire dues having been paid by the plaintiff, would give\nretrospectivity to the said release so as to validate and ratify the Sale\nDeeds dated 02.11.1971 and 15.07.1972? Under Section 48(d) of the Act,\na society has the power to release from charge any part of the land\nspecified in the declaration. Further, Section 48(c) of the Act relates only to\nvariation of the declaration, but by obvious and necessary implication, it\nwould include conclusion/release of the charge itself, in case the entire\ndues of a society are satisfied by the member who made the declaration.\nIn the present case, the Society had itself resolved to release the charge\non the suit land on 27.08.1973. For all practical purposes, the interest of\nthe Society has not suffered.\n                  16 of 2923.     The emphasis of the plaintiff before this Court is that the Trial Court\nas well as the learned Single Judge had, in the first round of litigation, held\nin his favour and both the Sale Deeds dated 02.11.1971 and 15.07.1972\nwere declared void and the suit seeking reconveyance was decreed. This\nraises another question which needs to be answered i.e., against whom or\nbetween whom, if at all, any alienation under Section 48(e) of the Act is\napplicable for the said acts resulting in the same being void?\n24.      In this regard, the conduct of the member/person who has under a\ndeclaration created a charge upon property in lieu of any loan obtained\nfrom a society would be important. Section 48(e) of the Act declares void\nany transaction by a member-loanee against the society, where he/she\nalienates such immovable property on which a charge is created under\ndeclaration. Thus, the primal purpose is to safeguard the interest of the\nsociety which advanced the loan. As a corollary, the right to sue or get a\ndeclaration  qua any alienation made by a loanee rests and is available\nonly to the society in favour of whom the property under a declaration was\ncharged. It would, therefore, not be within the domain of the member-\nloanee who himself commits a breach to take a stand that the act done by\nhim should be declared void, without the society coming forward before an\nappropriate forum to set aside such alienation. The law cannot, and does\n                  17 of 29not, reward a person for his/her own wrongs. In Sindav Hari Ranchhod v\nJadev  Lalji  Jaymal ,  (1997)  7  SCC  95 ,  Section  49  of  the  Gujarat\nCooperative Societies Act, 1961, a provision in pari materia to Section 48\nof the Act, was involved, and the Court observed:\n‘8. In  our  view,  this  submission  on  behalf  of  the  learned\ncounsel for the respondents cannot be sustained.  It is true\nthat no relief was claimed by the plaintiffs against the Society\nbut the grievance made by the plaintiffs in substance was of\ncourse on behalf of the Society and whether such Society\nwas covered by Section 49 or not and whether such Society\nhad waived its statutory right or not in favour of Original\nDefendant  1  were  all  questions  which  could  have  been\nthrashed  out  only  in  the  presence  of  the  Society  which\nconspicuously was not joined as at least a proper party. It is\nalso pertinent to note that the Society has not challenged\nthese sale deeds executed by Defendant 1 at any time.  The\nplaintiffs also failed to lead evidence for showing how Section\n49(1) got attracted on the facts of the present case, despite\nhaving full opportunity before the trial court to prove their\ncase on this issue. They could not be given a second innings\njust  for  the  asking  as  is  done  in  the  impugned  order.\nConsequently  the  plaintiffs  could  not  legitimately  and\neffectively challenge the sale transactions entered into by\ntheir father in favour of the alienees namely Defendants 15\nand 10 on the ground of violation of Section 49(1) of the Act.\nIn our view on the facts of the present case, therefore, there\nwas no occasion for the High Court for ordering any remand\nas on the main issue the plaintiffs had failed, hence the suit\nought to have been dismissed against all the defendants\ninstead of only against some of them as ruled by the High\nCourt. Consequently, this appeal is required to be allowed\nand the plaintiffs' suit against appellant — Defendant 15 also\nis liable to be dismissed as on merits the plaintiffs had failed\nto effectively challenge the sale transactions entered into by\ntheir father in favour of Defendant 15. ’\n(emphasis supplied)\n                  18 of 2925.     In the present case, it is also not in dispute that the Society, in\nwhose  favour  the  charge  was  created  on  the  land  in  question,  never\nmoved before any forum for enforcing its charge over the suit land or\nraised any grievance with regard to either of the Sale Deeds. Thus, the\nsituation which emerges is that Section 48(e) of the Act which says that\nany alienation made in contravention of the provisions of clause (d) shall\nbe void has to be read as directory to the extent that the same can be\nacted upon only at the instance of the party aggrieved ( viz. the society\nconcerned) upon whom the right has been created under the statute. In\nother words, with regard to a transaction, unless the society comes forward\nto seek its nullification/setting aside, the same would at best be a voidable\naction and not void ab initio. The distinction between ‘ void’ and ‘voidable’\nwas considered by the Court in Dhurandhar Prasad Singh v Jai Prakash\nUniversity, (2001) 6 SCC 534 :\n‘16. The  expressions  “void  and  voidable”  have  been  the\nsubject-matter of consideration  before English courts times\nwithout  number.  In  the  case\nof Durayappah v. Fernando [(1967) 2 All ER 152: (1967) 2\nAC  337:  (1967)  3  WLR  289  (PC)]  the  dissolution  of  the\nMunicipal Council by the Minister was challenged. Question\nhad arisen before the Privy Council as to whether a third\nparty could challenge such a decision. It was held that if the\ndecision was a complete nullity, it could be challenged by\nanyone, anywhere. The court observed at p. 158 E-F thus:\n“The answer must depend essentially on whether the\norder of the Minister was a complete nullity or whether it\nwas an order voidable only at the election of the Council.\nIf the former, it must follow that the Council is still in\noffice  and  that,  if  any  councillor,  ratepayer  or  other\n                  19 of 29person having a legitimate interest in the conduct of the\nCouncil likes to take the point, they are entitled to ask\nthe  court  to  declare  that  the  Council  is  still  the  duly\nelected Council with all the powers and duties conferred\non it by the Municipal Ordinance.”\n17. In the case of  McC (A minor), In re  [(1985) 1 AC 528 :\n(1984) 3 All ER 908: (1984) 3 WLR 1227 (HL)] the House of\nLords  followed  the  dictum  of  Lord  Coke  in  Marshalsea\ncase [(1612)  10  Co  Rep  68  b:  77  ER  1027]  quoting  a\npassage from the said judgment which was rendered in 1613\nwhere it was laid down that where the whole proceeding\nis coram non judice  which means void ab initio, the action will\nlie without any regard to the precept or process. The Court\nlaid down at AC p. 536 thus: (All ER pp. 912h-i, 913a-b)\n“Consider  two  extremes  of  a  very  wide  spectrum.\nJurisdiction meant one thing to Lord Coke in 1613 when\nhe said in Marshalsea case  [(1612) 10 Co Rep 68 b: 77\nER 1027] Co Rep, at p. 76a:\n‘… when a court has jurisdiction of the cause,\nand  proceeds  inverso  ordine  or  erroneously,\nthere  the  party  who  sues,  or  the  officer  or\nMinister of the court who executes the precept\nor process of the court, no action lies against\nthem. But when the court has not jurisdiction of\nthe cause, there the whole proceeding is  coram\nnon judice, and actions will  lie against them\nwithout any regard of the precept or process….’\nThe Court of the Marshalsea in that case acted without\njurisdiction  because,  its  jurisdiction  being  limited  to\nmembers of the King's household, it entertained a suit\nbetween two citizens neither of whom was a member of\nthe King's household. Arising out of those proceedings a\nparty  arrested  ‘by  process  of  the  Marshalsea’  could\nmaintain an action for false imprisonment against, inter\nalios, ‘the Marshal who directed the execution of the\nprocess’. This is but an early and perhaps the most-\nquoted  example  of  the  application  of  a  principle\nillustrated  by  many  later  cases  where  the  question\nwhether a court or other tribunal of limited jurisdiction\nhas acted without jurisdiction (coram non judice) can be\ndetermined by considering whether at the outset of the\nproceedings that court had jurisdiction to entertain the\n                  20 of 29proceedings at all. So much is implicit in the Lord Coke's\nphrase ‘jurisdiction of the cause’.”\n18. In  another  decision,  in  the  case  of  Director  of  Public\nProsecutions v. Head [1959  AC  83:  (1958)  1  All  ER  679:\n(1958) 2 WLR 617 (HL)] the House of Lords was considering\nthe validity of an order passed by the Secretary of State in\nappeal preferred against judgment of acquittal passed in a\ncriminal case. The Court of Criminal Appeal quashed the\nconviction  on  the  ground  that  the  aforesaid  order  of  the\nSecretary was null and void and while upholding the decision\nof the Court of Criminal Appeal, the House of Lords observed\nat AC p. 111 thus: (All ER p. 692g-i)\n“This  contention  seems  to  me  to  raise  the  whole\nquestion of void or voidable; for if the original order was\nvoid, it would in law be a nullity. There would be no need\nfor an order to quash it. It would be automatically null\nand  void  without  more  ado.  The  continuation  orders\nwould be nullities too, because you cannot continue a\nnullity. The licence to Miss Henderson would be a nullity.\nSo  would  all  the  dealings  with  her  property  under\nSection 64 of the Act of 1913 [ Mental Deficiency Act].\nNone of the orders would be admissible in evidence. The\nSecretary of State would, I fancy, be liable in damages\nfor all of the ten years during which she was unlawfully\ndetained,  since  it  could  all  be  said  to  flow  from  his\nnegligent act; see Section 16 of the Mental Treatment\nAct, 1930.\nBut if the original order was only voidable, then it would\nnot be automatically void. Something would have to be\ndone to avoid it. There would have to be an application\nto the High Court for certiorari to quash it.”\n19. This question was examined by the Court of Appeal in\nthe case of R. v. Paddington Valuation Officer, ex p Peachey\nProperty Corpn. Ltd.  [(1965) 2 All ER 836: (1966) 1 QB 380:\n(1965)  3  WLR  426  (CA)]  where  the  valuation  list  was\nchallenged on the ground that the same was void altogether.\nOn  these  facts,  Lord  Denning,  M.R.  laid  down  the  law,\nobserving at p. 841 thus:\n“It  is  necessary  to  distinguish  between  two  kinds  of\ninvalidity. The one kind is where the invalidity is so grave\nthat the list is a nullity altogether.  In which case there is\nno need for an order to quash it. It is automatically null\nand void without more ado. The other kind is when the\n                  21 of 29invalidity does not make the list void altogether, but only\nvoidable. In that case it stands unless and until it is set\naside. In the present case the valuation list is not, and\nnever has been, a nullity. At most the first respondent —\nacting within his jurisdiction — exercised that jurisdiction\nerroneously. That makes the list voidable and not void. It\nremains good until it is set aside.”\n20. de  Smith,  Woolf  and  Jowell  in  their  treatise     Judicial  \nReview of Administrative Action, 5th Edn., para 5-044, have\nsummarised the concept of void and voidable as follows:\n“Behind the simple dichotomy of void and voidable acts\n(invalid  and  valid  until  declared  to  be  invalid)  lurk\nterminological and conceptual problems of excruciating\ncomplexity. The problems arose from the premise that if\nan act, order or decision is ultra vires in the sense of\noutside jurisdiction, it was said to be invalid, or null and\nvoid. If it is intra vires it was, of course, valid. If it is\nflawed  by  an  error  perpetrated  within  the  area  of\nauthority  or  jurisdiction,  it  was  usually  said  to  be\nvoidable; that is, valid till set aside on appeal or in the\npast quashed by certiorari for error of law on the face of\nthe record.”\n21. Clive  Lewis  in  his  work  Judicial  Remedies  in  Public\nLaw at  p.  131  has  explained  the  expressions  “void  and\nvoidable” as follows:\n“A challenge to the validity of an act may be by direct\naction or by way of collateral or indirect challenge. A\ndirect action is one where the principal purpose of the\naction is to establish the invalidity. This will usually be by\nway of an application for judicial review or by use of any\nstatutory  mechanism  for  appeal  or  review.  Collateral\nchallenges  arise  when  the  invalidity  is  raised  in  the\ncourse of some other proceedings, the purpose of which\nis  not  to  establish  invalidity  but  where  questions  of\nvalidity become relevant.”\n22. Thus the expressions “void and voidable” have been the\nsubject-matter of consideration on innumerable occasions by\ncourts. The expression “void” has several facets. One type of\nvoid acts, transactions, decrees are those which are wholly\nwithout jurisdiction, ab initio void and for avoiding the same\nno declaration is necessary, law does not take any notice of\nthe same and it can be disregarded in collateral proceeding\nor  otherwise. The  other  type  of  void  act,  e.g.,  may  be\n                  22 of 29transaction against a minor without being represented by a\nnext friend. Such a transaction is a good transaction against\nthe whole world. So far as the minor is concerned, if he\ndecides to avoid the same and succeeds in avoiding it by\ntaking  recourse  to  appropriate  proceeding  the  transaction\nbecomes void from the very beginning. Another type of void\nact may be which is not a nullity but for avoiding the same a\ndeclaration has to be made. Voidable act is that which is a\ngood  act  unless  avoided ,  e.g.,  if  a  suit  is  filed  for  a\ndeclaration that a document is fraudulent and/or forged and\nfabricated, it is voidable as the apparent state of affairs is the\nreal state of affairs and a party who alleges otherwise is\nobliged to prove it. If it is proved that the document is forged\nand fabricated and a declaration to that effect is given, a\ntransaction becomes void from the very beginning.  There\nmay be a voidable transaction which is required to be set\naside and the same is avoided from the day it is so set aside\nand not any day prior to it. In cases where legal effect of a\ndocument cannot be taken away without setting aside the\nsame, it cannot be treated to be void but would be obviously\nvoidable  .  ’\n(emphasis supplied)\n26.       Another aspect of importance is the fact that ultimately, the dues of\nthe Society have been cleared, may be by the plaintiff himself, but the\nresult is that the same has also been followed up by acceptance and\nrelease by the Society i.e., the suit land stood released from charge on and\nwith effect from 27.08.1973.\n27.      Another factual aspect raised by the appellants is that the suit land\nis highly undervalued as the consideration is only Rs.5,000/- (Rupees Five\nThousand) though the same ought to have been Rs.25,000/- (Rupees\nTwenty-Five Thousand). This contention cannot be given much importance\n                  23 of 29considering the relationship between the parties i.e., the defendant no.1\nbeing the son-in-law and nephew of the plaintiff. Further, no material to\nbuttress/support  the  claim  of  the  valuation  being  Rs.25,000/-  (Rupees\nTwenty-Five  Thousand)  was  ever  produced  before  any  of  the  Courts\nbelow. Thus, a bald statement on a purely factual aspect has rightly not\nbeen accepted by the Courts. We too do not propose to chart a different\ncourse on this.\n28.      Before, however, forming a final view, this Court is also required to\nconsider the plea of the appellants that on 02.11.1971, after execution of\nthe Sale Deed by the plaintiff in favour of respondent no.1/ defendant no.1,\nimmediately a reconveyance deed under the name and style of ‘ Ram Ram\nPatra’ was also executed, which stipulated that upon Rs.5,000/- (Rupees\nFive  Thousand)  being  repaid  by  the  plaintiff  to  the  respondent  no.1/\ndefendant no.1, he would re-convey the land to the plaintiff. This document\nwould not be of any help to the appellants mainly because cognizance of\nthe same cannot be taken in view of the document not being executed\neither on stamp paper or registered and, additionally, being in the writing of\na  different  scribe  vis-a-vis the  registered  Sale  Deed  of  even  date.\nMoreover,  the  plaintiff  while  executing  the  registered  Sale  Deed  on\n02.11.1971 in favour of defendant no.1 has clearly stated that the suit land\nwas  free  of  any  encumbrance(s),  which,  in  our  opinion,  negates  the\n                  24 of 29argument urged that the sale was a conditional sale and not a full-fledged\nsale.\n29.      Though neither discussed in any of the Orders nor argued by any\nparty, a serious doubt arises in the mind of the Court inasmuch as it cannot\nbe believed that a valid reconveyance deed would not specify any time-\nperiod and also not provide for any escalation in the amount to be returned\nin lieu of reconveyance i.e., to say that for an indefinite period the land\nwould remain with defendant no.1, but whenever the plaintiff wants, he can\nask  for  its  reconveyance  by  paying  merely  Rs.5,000/-  (Rupees  Five\nThousand). Besides being iniquitous, this also demonstrates that such\nterm could  not have  been  incorporated,  if  at all there was  a  genuine\nreconveyance deed. Had it really been agreed between the parties that the\nsuit land was to be reconveyed upon the money being returned, the money\nto be returned would be commensurate with escalation for the period for\nwhich it was not returned by providing for some increase, either quantified\nor by prescribing a rate of interest and most importantly an outward time-\nlimit. These are conspicuous by their absence in the Reconveyance Deed.\n30.     It is also noteworthy that the plaintiff has nowhere stated that he\never approached defendant no.1 for re-conveying the suit land. The only\nstand taken was that he was ready to return Rs.5,000/- (Rupees Five\n                  25 of 29Thousand) and that the Court may pass a decree directing reconveyance\nfor the sum of Rs.5,000/- (Rupees Five Thousand). This itself dilutes the\nclaim  inasmuch  as  the  cause  of  action  would  arise  when  the  plaintiff\nasserted that he was ready, willing and offered to pay the amount to\ndefendant  no.1,  who  refused  to  accept  such  payment  of  Rs.5,000/-\n(Rupees Five Thousand). Absent such averment, no relief can enure to the\nplaintiff.\n31.   Apropos the rights of the parties  inter-se, the Court would only\nobserve that defendant no.2 was a  bonafide purchaser from respondent\nno.1/defendant  no.1,  on  the  date  the  Sale  Deed  was  executed  on\n15.07.1972, for the reason that such transaction was made on the basis of\nthe title which was apparent from the Sale Deed dated 02.11.1971 in\nfavour of respondent no.1/defendant no.1. This would not have given any\noccasion to defendant no.2 to be cautious or under any impression, much\nless knowledge, that the property bought by him was encumbered on the\ndate of purchase.\n32.    Undoubtedly, the present case comes under a unique category\nwhere a person on the one hand comes before a Court seeking that his\nown actions be nullified on the ground that it was void and on the other\nhand wants relief in his favour, which is consequential to and traceable to\n                  26 of 29his own wrong. It would not be proper for a Court of law to assist or aid\nsuch person who states that the wrong he committed be set aside and a\nrelief be granted de hors the wrong committed, after condoning the same.\nIn the present case, the plaintiff cannot be allowed to benefit from his own\nwrong and the Court will not be a party to a perpetuation of illegality. In\nRam Pyare v Ram Narain , (1985) 2 SCC 162 , a 3-Judge Bench of this\nCourt, in the circumstances therein, did not void a transaction even though\nthe transaction was void being prohibited by law. The principle that no\nparty can take advantage of his/her own wrong i.e.  ex injuria sua nemo\nhabere debet is squarely attracted. In Kusheshwar Prasad Singh v State\nof Bihar, (2007) 11 SCC 447 , it was held:\n‘13. The  appellant  is  also  right  in  contending  before  this\nCourt that the power under Section 32-B of the Act to initiate\nfresh  proceedings  could  not  have  been  exercised.\nAdmittedly, Section 32-B came on the statute book by Bihar\nAct 55 of 1982. The case of the appellant was over much\nprior to the amendment of the Act and insertion of Section\n32-B. The appellant, therefore, is right in contending that the\nauthorities cannot be allowed to take undue advantage of\ntheir own default in failure to act in accordance with law and\ninitiate fresh proceedings.\n14. In this connection, our attention has been invited by the\nlearned counsel for the appellant to a decision of this Court\nin Mrutunjay  Pani     v.     Narmada  Bala  Sasmal   [AIR  1961  SC\n1353]  wherein  it  was  held  by  this  Court  that  where  an\nobligation is cast on a party and he commits a breach of such\nobligation, he cannot be permitted to take advantage of such\nsituation. This is based on the Latin maxim     commodum ex  \ninjuria  sua  nemo  habere  debet     (no  party  can  take  undue  \nadvantage of his own wrong).\n15. In Union  of  India     v.     Major  General  Madan  Lal  \nYadav [(1996) 4 SCC 127: 1996 SCC (Cri) 592] the accused\n                  27 of 29army  personnel  himself  was  responsible  for  delay  as  he\nescaped from detention. Then he raised an objection against\ninitiation of proceedings on the ground that such proceedings\nought to have been initiated within six months under the\nArmy Act, 1950. Referring to the above maxim, this Court\nheld that the accused could not take undue advantage of his\nown wrong. Considering the relevant provisions of the Act,\nthe Court held that presence of the accused was an essential\ncondition  for  the  commencement  of  trial  and  when  the\naccused did not make himself available, he could not be\nallowed to raise a contention that proceedings were time-\nbarred.  This  Court  (at  SCC  p.  142,  para  28)  referred\nto Broom's Legal Maxims  (10th Edn.), p. 191 wherein it was\nstated:\n“It is a maxim of law, recognised and established, that no\nman shall take advantage of his own wrong; and this\nmaxim, which is based on elementary principles, is fully\nrecognised in courts of law and of equity, and, indeed,\nadmits  of  illustration  from  every  branch  of  legal\nprocedure.”\n16. It  is  settled  principle  of  law  that  a  man  cannot  be\npermitted to take undue and unfair advantage of his own\nwrong to gain favourable interpretation of law. It is sound\nprinciple that he who prevents a thing from being done shall\nnot avail himself of the non-performance he has occasioned.\nTo put it differently, “a wrongdoer ought not to be permitted\nto make a profit out of his own wrong”. ’\n(emphasis supplied)\n33.    On an overall circumspection, the learned Single Judge and the\nDivision Bench have not committed any error.\n34.   In  the  light  of  the  discussions  made  and  reasons  recorded\nhereinabove, we do not find any merit in the present appeal. Accordingly,\nthe appeal stands dismissed.\n                  28 of 2935.No order as to costs. I.A. No.42744/2020 is closed.\n36.Registry is directed to prepare Decree Sheet accordingly.\n                          \n………………...........................J.\n[SUDHANSHU DHULIA]\n                                             \n  ………………...........................J.  \n    [AHSANUDDIN AMANULLAH] \nNEW DELHI                                                                                                       \nJUNE 02, 2025\n                  29 of 29"
}