{
  "filename": "MAYA_P.C._VS._STATE_OF_KERALA.pdf",
  "page_count": 16,
  "content": "2025 INSC 773\n Civil Appeal  No.14915 of 2024 etc.   Page 1 of 16 NON-REPORTABLE  \n \nIN THE SUPREME COURT OF INDIA  \nCIVIL APPELLATE JURISDICTION  \n \nCIVIL APPEAL NO.  14915  OF 2024  \n \nMaya P.C. & Ors.                             … Appellant s \n    \n \n versus  \n \n \nThe State  of Kerala & Anr.                   … Respondent s \n  \nwith  \n \nCIVIL APPEAL NOS.14916 -14917 OF 2024  \n \nCIVIL APPEAL NO.14918 OF 2024  \n \nand \n \nCIVIL APPEAL NO.14919 OF 2024  \n \n      J U D G M E N T  \nABHAY S. OKA, J.  \nFACTUAL ASPECTS  \n1. The appellants in these Civil Appeals are persons \nwith benchmark disabilities, each with a physical \ndisability exceeding 40%. They were engaged in various \npublic institutions in the State of Kerala under Rule 9(a)(i) \nof the Kerala State and Subordinate Servic e Rules, 1958 \n(for short, “the KS & SSR”), which governs temporary  Civil Appeal  No.14915 of 2024 etc.   Page 2 of 16 appointments made in public interest, for a period not \nexceeding 179 days.  \n2. By a Government Order (for short, “ the G.O.”) dated \n18th May 2013, the State Government of Kerala (first \nrespondent) resolved to regularise the services of 2,677 \nphysically disabled persons against supernumerary posts, \nwho had been engaged temporarily through employment \nexchange under Rule 9(a)(i) of the KS & S SR between 16th \nAugust 1999 and 31st December 2003. According to the \nsaid G.O., the appellants were to be reappointed to  \nsupernumerary posts created solely for their absorption. \nThe said G.O. further stipulated that such supernumerary \nposts would stand abolished upon the retirement of the \nincumbents.  \n3. Pursuant to the above G.O., the appellants were \nreappointed on a regular basis in their respective \ndepartments. However, by a subsequent G.O. dated 3rd \nFebruary 2016, the first respondent , inter alia, declared \nthat such reappointed persons shall not be eligible for \ndeclaration of probation, inclusion in the combined \nseniority list, or consideration for promotion.  \n4. The appellants, feeling aggrieved by the imposition of \nthese restrictions, adopted their remedies as discussed \nherein below . It is in the backdrop of the aforesaid common  Civil Appeal  No.14915 of 2024 etc.   Page 3 of 16 facts that the cases of individual appellants must now be \nadverted to.  \n5. In this batch of Civil Appeals, Civil Appeal Nos. 14915 \nof 2024, 14916 -17 of 2024 & 14918 of 202 4 arise out of a \ncommon impugned judgment dated 1st February 2021 , \ndelivered by the Division Bench of the Kerala High Court. \nWhereas, Civil Appeal No. 14919 of 202 4 arises out of the \nimpugned judgment dated 5th March 2021, delivered by \nthe co-ordinate Division Bench of the Kerala High Court  by \nrelying upon the above judgment dated 1st February 2021.  \n6. Civil Appeal No. 14915 of 2024  \n6.1 The appellants herein were appointed as \nAssistants in Mahatma Gandhi University (second \nrespondent), through employment exchange for \n179 days under Rule 9(a)(i) of KS & SSR, between \n16.08.1999 and 31.12.2003. Pursuant to G.O. \ndated 18th May 2013 and 7th August 2013, \nappellant nos. 1 to 10 were reappointed by an \norder dated 10th December 2013, and appellant \nnos. 11 and 12 were reappointed by a subsequent \norder dated 27th March 2014. Notably, appellants \nNos. 11 and 12 were earlier holding regular posts \nas peons in the revenue department and had  Civil Appeal  No.14915 of 2024 etc.   Page 4 of 16 resigned from their posts to avail themselves of \nthe benefit under the G.O.  dated 18th May 2013.  \n6.2 Upon completion of probation and passing the \nrequisite departmental tests, the appellants were \nincluded in the final seniority list of assistants. \nHowever, following the G.O. dated 3rd February \n2016, their names were excluded from the \ncombined seniority list, and they were denied the \nbenefit of promotion.  \n6.3 The appellants challenged the said G.O. dated 3rd \nFebruary 2016 by filing Writ Petition (Civil) No. \n9832 of 2016 before the Kerala High Court. The \nlearned Single Judge allowed the writ petition on \n13th September 2017 and directed the \nrespondents to grant the petitioners the benefits \nof seniority, declaration of probation,  and \npromotion. The learned Single Judge held that \nG.O. dated 3rd February 2016 was contrary to the \nprinciples of equality and fair treatment and noted \nthat once the person is appointed to a post, he is \nentitled to be treated equally on par with his \ncounterparts. However, in a writ appeal by the \nfirst respondent, the Division Bench of the High \nCourt reversed the judgment of the Single Judge . \nThe Division Bench upheld the provisions of the  Civil Appeal  No.14915 of 2024 etc.   Page 5 of 16 said G.O. dated 3rd February 2016,  prompting the \nappellants to approach this Court.  \n7. Civil Appeal No. 14916 -14917 of 2024  \n7.1 The appellant, who has 50% disability, was \ninitially engaged on a temporary basis in the \nKerala Public Service Commission (KPSC) under \nRule 9(a)(i) of the KS & SSR for 179 days. \nThereafter, she was selected through regular \nrecruitment and appointed as Lowe r Division \nClerk (LDC) at Central Plantation Crops Research \nInstitute (CPCRI) under the Indian Council of \nAgricultural Research. On the issuance of G.O.s \ndated 18th May 2013 and 7th August 2013, she \nresigned from CPCRI and rejoined the KPSC as \nAssistant on  12th December 2013, pursuant to \nappointment against a supernumerary post.  \n7.2 Having cleared the relevant departmental \nexaminations, the appellant sought a declaration \nof probation and inclusion in the seniority list. \nHowever, her request was declined, citing the G.O. \ndated 3rd February 2016. Aggrieved thereby, the \nappellant filed an Original Application before the \nKerala Administrative Tribunal (for short, “the \ntribunal”). On 12th July 2019, the tribunal allowed  Civil Appeal  No.14915 of 2024 etc.   Page 6 of 16 her claim by following the judgment of the Single \nJudge of the Kerala High Court in W.P. (C) No. \n9832 of 2016,  dated 13th September 2017. \nHowever, the Division Bench of the Kerala High \nCourt reversed the tribunal’s order vide impugned \norder dated 01st February 2021, holding that the \nappellant’s appointment being against a \nsupernumerary post was a policy concession, and \ntherefore , the benefits of promotion and seniority \ncould not be claimed as a matter of right. The \npresent Civil Appeal arises therefrom.  \n8. Civil Appeal No. 14918 of 2024  \n8.1 The appellant  was appointed as LDC in the Civil \nSupplies Department under the G.O. dated 18th \nMay 2013. He completed his probation and \nsuccessfully cleared the departmental tests. \nDespite his inclusion in the provisional seniority \nlist, he was excluded from the final list in view of \nthe restrictions contained in the G.O. dated 3rd \nFebruary 2016.  \n8.2 He approached the tribunal by filing an Original \nApplication, which was allowed on 11th October \n2019 by following the order of the Single Judge of \nthe Kerala High Court in aforesaid W.P. (C) No.  Civil Appeal  No.14915 of 2024 etc.   Page 7 of 16 9832 of 2016 dated 13th September 2017. The \ntribunal granted him full -service benefits. \nHowever, the Division Bench of the Kerala High \nCourt vide impugned order dated 01st February \n2021 reversed the order of the tribunal, holding \nthat the appellant’s appointment being against a \nsupernumerary post was a policy concession, and \ntherefore , the benefits of promotion and seniority \ncould not be claimed as a matter of right.  \n9. Civil Appeal No. 14919 of 2024  \n9.1 The appellant, with 40% permanent disability, \nwas appointed as Rehabilitation Technician Grade \nII under Rule 9(a)(i) of KS & SRR and subsequently \nreappointed against a supernumerary post in the \nMedical Education Department. His appointment \nwas regularised with effect from 15th October \n2013, and he was declared to have completed his \nprobation. On 9th March 2017, he was promoted \nto the post of Grade I Technician (Prosthetics).  \n9.2 However, the Health Department issued an order \ndated 7th April 2018, cancelling his promotion and \nregularisation, citing the G.O. dated 3rd February \n2016 and stating that those appointed to  Civil Appeal  No.14915 of 2024 etc.   Page 8 of 16 supernumerary posts do not have claims to  \nregularisation or promotion.  \n9.3 The appellant challenged the aforesaid order by \nfiling an Original Application before the tribunal, \nwhich ruled in his favour vide order dated 16th \nOctober 2019 and set aside the order of the Health \nDepartment dated 7th April 2018.  The tribunal \nfound that the restrictions were discriminatory \nand contrary to the Rights of Persons with \nDisabilities Act, 2016. The Division Bench of the \nKerala High Court, however, set aside the \ntribunal’s order vide impugned  judgment dated \n05th March 2021, relying on the common \njudgment rendered by the co -ordinate Division on \n1st February 2021 in connected matters, wherein \nit was held that appointments made against \nsupernumerary posts under a concessional \nscheme do not confer enforceable rig hts to \npromotion or seniority.  \nSUBMISSIONS  \n10. The learned senior counsel appearing for the \nappellants submitted that neither of the aforesaid G.O. nor \nthe appointment orders issued to the appellants contain \nany stipulation to the effect that the appellants would be \ndenied promotion or other service be nefits, or that they  Civil Appeal  No.14915 of 2024 etc.   Page 9 of 16 would be compelled to remain in the same post until their \nretirement.  \n11. It was submitted that the appellants were included in \nthe seniority list and, in several cases, probation had also \nbeen declared. Thus, the G.O.  dated 3rd February 2016 , by \nwhich the first respondent purported to deny the \nappellants the benefits of probation, seniority, promotion \nand transfer,  was issued after the appellants had \ncompleted more than three years of satisfactory service. \nThe learned senior counsel  drew our attention  to the fact \nthat some of the appellants, including appellants nos. 11 \nand 12 i n Civil Appeal No. 14915 of 2024, had voluntarily \nresigned from regular government service in the \nexpectation that they would be treated as regular \nemployees of the university upon reappointment.  \n12. Learned senior counsel for the appellants further \nsubmitted that the High Court committed a further error \nin holding that the appellants could not claim parity with \nregular employees solely on the ground that they were not \nappointed pursuant to a reservati on under the Persons \nwith Disabilities (Equal Opportunities, Protection of Rights \nand Full Participation ) Act, 1995  (the 1995 Act) or the \nRights of Persons with Disabilities Act, 2016 (the 2016 \nAct). It was submitted that such reasoning negates the \nconstitutional mandate under Articles 14 and 16 .  Civil Appeal  No.14915 of 2024 etc.   Page 10 of 16 13. Learned senior counsel appearing for the appellant \nsubmitted that the action of the respondents is completely \nagainst the mandate of Section 33 of the 2016 Act, which \nprovides for a 3% reservation for the persons with \ndisability .  His submission is that denying the benefit of \ncompleting probation and promotion would be contrary to \nthe spirit of the 1995 and 2016 Acts.  He submitted that \nthe G.O. dated 18th May 2013 grants regularisation to the \npersons with disability  who were working temporarily. He \nsubmitt ed that what is given by this G.O. dated 18th May \n2013 cannot be withdrawn subsequently to the prejudice \nof the beneficiaries of the G.O. dated 18th May 2013.  \n14. The learned senior counsel for the first respondent \nsubmitted that the objective of the G.O.  dated 18th May \n2013  was to ensure a reasonable accommodation for \npersons with disabilities and that no further competition \nprocedures had been applied in favour of the beneficiaries. \nIt was submitted that the G.O.  dated 18th May 2013  clearly \nstated that the respective posts of the beneficiaries will be \ncancelled as and when the employee retires from their \npost.  \n15. The l earned  senior  counsel further contended that \nthe benefits conferred under the G.O.  dated 18th May 2013 \nalready include salary, increments, pension, leave and \nother allowances. Extending further service benefits, such  Civil Appeal  No.14915 of 2024 etc.   Page 11 of 16 as promotion, would set an unfair precedent and disrupt \nthe rights of regularly appointed employees. It was thus \nsubmitted that the action taken by the first respondent in \nissuing the clarification dated 03rd February 2016 was \ncorrective in nature and does not suffer from any illegality \nor arbitrariness.   \n16. The submission of the learned  senior counsel \nappearing  for the first respondent  and others is that the \nG.O. dated  18th May 2023 is by way of concession  and \ntherefore, as rightly held by Division Bench of the High \nCourt, the appellants cannot  claim anything which is not \nprovided in the  G.O. dated 18th May 2013 as a matter of \nright.  Learned  counsel appearing  for the respondent s \npointed out the findings recorded by the High Court  in the \nimpugned judgment and order. He submitted that the \nDivision  Bench has relied upon a binding decision of this \nCourt in the case of Secretary, State of Karnataka and \nOrs. v. Uma Devi  (3) and Ors1.  Learned counsel \nsubmitted that supernumerary  posts were created to \naccommodate the appellants  and therefore, they cannot be \ntreated as regular employees .  They are not  entitled to \nbenefits which  are available  to the regular employees .  He \npointed out that the Division Bench has not considered  the \n \n1 (2006) 4 SCC 1   Civil Appeal  No.14915 of 2024 etc.   Page 12 of 16 provisions of the 1995  Act.  He would, therefore, submit \nthat no interference is called for.  \nCONSIDERATION OF SUBMISS IONS \n17. We have perused the G.O. dated 18th May 2013 , \nwhich was published in the State  Government Gazette \ndated 24th May 2013.  A copy of the G.O. is annexed as \nAnnexure P -2 in Civil Appeal No.1491 5 of 2024. The \nrelevant part of the G.O. reads thus: - \n“On the basis of detailed examination \nconducted by the Government in this \nregard, order is issued creating \nsupernumerary posts for granting re -\nappointment to about 2677 physically \nhandicapped who had completed 179 \ndays of service, after being \ntemporarily ap pointed as per K.S & \nS.S.R. Part Il, Rule 9(A)(i), through \nemployment exchange during the \nperiod between 16.08.1999 till \n31.12.2003 and granting re/regular \nappointment to the said employees in \nexercise of the power under Rule 39 of \nthe General Rules, in s uch a manner \nwhereby the said supernumerary \nposts shall cease to exist upon \nretirement of the said employees from \nservice.  \nDetailed guidelines regarding \nregular appointment of the said \nemployees shall be issued later .” \n                    (emphasis added)  \n  Civil Appeal  No.14915 of 2024 etc.   Page 13 of 16 18. Thus, the G.O. can be analysed as under:  - \na. The G.O. authorise d the creation of \nsupernumerary posts for granting reappointment \nto about 2677 persons with disability  who have \ncompleted 179 days of service;  \nb. The G.O. was  applicable to those persons with \ndisability  who were employed  through  the \nemployment exchange during the period from the \n16th August 1999 till 31st December 2003;  \nc. The G.O. specifically provide d that detailed \nguidelines  regarding the “regular appointment”  of \nthe said  employee s shall be issued later ; and \nd. On the re tirement  of the employees \naccommodated in supernumerary posts, the same \nshall cease to exist on the retirement of the said \nemployees.  \n19. Thus,  the intention was to give regular appointment s \nto those persons with disability  who were working on \ntemporary posts through  the employment exchange and \nwho were employed between 16th August 1999 and 31st \nDecember 2003 .  Thus, the intention was to grant \npermanency to those persons with disability .  Civil Appeal  No.14915 of 2024 etc.   Page 14 of 16 20. The orders of the reappointment of the appellant s in \nCivil Appeal No.14915 of 2024  at annexure s P-6 and P -7 \nshow that :- \na. The appointment was made on probation for a \nperiod of one year within a continuous period of \ntwo years , as per the Mahatma Gandhi University \nStatute s; \nb. The posts occupied by the appellants will be \nexhausted as and when they retire from service;  \nand \nc. The National Pension Scheme will apply to the \nappointments fr om 1st April 2013 .   \nThus, the employment of the appellants was regular \nemployment on a regular basis, as they were treated as \nhaving been  appointed on probation.  \n21. Thereafter,  G.O. dated 3rd February 2016 was issued , \nwhich was specifically  made a pplicable  to the beneficiaries  \nunder the G.O. dated 18th May 2013.   Clause 3.5  thereof \nprovides that those who are appointed on the basis of the \nG.O. dated 18th May 2013 shall not be eligible for seniority \nand completion of probation  as other regular employees , \nas this category of employees was appointed on \nsupernumerary post s.  Therefore, there cannot be any \ncombined seniority list also.   Civil Appeal  No.14915 of 2024 etc.   Page 15 of 16 22. In case of the appellants  in other appeals , the \nappointment orders do not record that the appellant s will \nnot be entitled to the benefits of completion of probation or \npromotion.  \n23. The G.O. dated 18th May, 2013 , is to ensure that the \npersons with disability  appointed through  the employment \nexchange  in a particular  post should be regularly \nappointed.  Therefore,  all of them were appointed on \nprobation . Now, by the subsequent G.O. dated 3rd \nFebruary 201 6, what is conferred  on the appellants by the \nG.O. dated 18th May 2013 cannot be withdrawn.   \nMoreover, many appellants based on the G.O. dated 18th \nMay 2013 changed their position and opted for other \nemployment for securing the benefits under the G.O.  The \nG.O. contemplates regular appointments to be given.  \nClause 3.5 of the G.O. dated 3rd February , 2016  seeks to \nwithdraw what is specifically conferred by the G.O. dated \n18th May 2013.  Hence, the G.O.  dated 3rd February 2016 \nis discriminatory  and irrational  and therefore , violative of \nArticle  14 of the Consti tution of India.  \n24. Hence, we pass the following order:  \ni) We set aside the impugned judgments of the \nDivision Bench of the Kerala High Court ;   Civil Appeal  No.14915 of 2024 etc.   Page 16 of 16 ii) We restore the judgments of the learned \nSingle Judge of the Kerala High Court and the \njudgments of the Kerala Administrative \nTribunal, which were set aside by the \nimpugned judgments of the Division Bench ; \niii) The appeals are accordingly allowed.  \n \n \n.....…………………………….J.  \n           (Abhay S Oka)  \n \n \n....…………………………….J.  \n                                                          (Augustine George Masih)  \nNew Delhi;  \nMay 23, 2025."
}