{
  "filename": "RAKHI_SADHUKHAN_VS._RAJA_SADHUKHAN.pdf",
  "page_count": 6,
  "content": "2025 INSC 789\nCIVIL APPEAL NO. 10209 OF 2024 and connected case  Page 1 of 6 \n REPORTABLE  \nIN THE SUPREME COURT OF INDIA  \nCIVIL APPELLATE JURISDICTION  \n \nCIVIL APPEAL NO. 1020 9 OF 202 4 \n  \n \nRAKHI SADHUKHAN                 …APPELLANT(S)  \nVERSUS  \nRAJA SADHUKHAN        …RESPONDENT(S)  \nWITH  \nCONTEMP T PETITION (C)  NO. 857 OF 202 4 \nIN \nCIVIL APPEAL NO. 10209 OF 2024  \n  \n \nRAKHI SADHUKHAN                 …PETITIONER (S) \nVERSUS  \nRAJA SADHUKHAN        …RESPONDENT(S)  \n \nJ U D G M E N T  \n \nVIKRAM NATH, J.  \n1. The present appeal arises out of the order dated 25.06.2019 \npassed by the High Court of Calcutta in FA No. 92 of 2019 \n(FAT No. 122 of 2015), whereby the Division Bench allowed \nthe respondent -husband’s appeal and granted a decree of \ndivorce, awarding permanent alimony of Rs. 20,000/ - per \nmonth to the appellant -wife, with an increase o f 5% every \nthree years.  CIVIL APPEAL NO. 10209 OF 2024 and connected case  Page 2 of 6 \n 2. The facts relevant to the present appeal are as follows:  \n2.1 The appellant -wife and respondent -husband were married \non 18.06.1997.  \n2.2 A son was born to the them on 05.08.1998.  \n2.3 In July 2008, the respondent -husband filed Matrimonial \nSuit No. 430 of 2008 under Section 27 of the Special \nMarriage Act, 1954 seeking dissolution of marriage on the \nground of cruelty allegedly inflicted by the appellant -wife. \n2.4 Subsequently, the appellant -wife filed Misc. Case No. 155 of \n2008 in the same suit under Section 24 of the Hindu \nMarriage Act, 1955, seeking interim maintenance for \nherself and the minor son.  \n2.5 The Trial Court, by order dated 14.01.2010, awarded \ninterim maintenance of Rs. 8,000/ - per month to the \nappellant -wife and Rs. 10,000/ - towards litigation \nexpenses.  \n2.6 The appellant -wife then instituted Misc. Case No. 116 of \n2010 under Section 125 of the Code of Criminal Procedure, \n1973. The Trial Court, vide order dated 28.03.2014, \ndirected the respondent -husband to pay maintenance of \nRs. 8,000/ - per month to the appellant -wife and Rs. \n6,000/ - per month to the minor son, along with Rs. 5,000/ - \ntowards litigation costs.  CIVIL APPEAL NO. 10209 OF 2024 and connected case  Page 3 of 6 \n 2.7 The Trial Court, vide order dated 10.01.2016, dismissed the \nmatrimonial suit, finding that the respondent -husband had \nfailed to prove cruelty. Aggrieved, the respondent filed FAT \nNo. 122 of 2015 before the High Court of Calcutta.  \n2.8 During the pendency of the appeal, the appellant -wife filed \nCAN No. 4505 of 2025 seeking interim maintenance of Rs. \n30,000/ - for herself and Rs. 20,000/ - for the son, along \nwith Rs. 50,000/ - towards litigation expenses.  \n2.9 The High Court, by order dated 14.05.2015, directed the \nrespondent -husband to pay interim maintenance of Rs. \n15,000/ - per month.  \n2.10 Subsequently, by order dated 14.07.2016, the High Court \nnoted that the respondent -husband was drawing a net \nmonthly salary of Rs. 69,000/ - and enhanced the interim \nmaintenance to Rs. 20,000/ - per month.  \n2.11 Finally, the High Court, by the impugned order dated \n25.06.2019, allowed the respondent’s appeal, granted a \ndecree of divorce on the ground of mental cruelty and \nirretrievable breakdown of marriage, and directed the \nrespondent -husband to :  \n(i)  redeem the mortgage on the flat where the appellant -wife \nwas residing and transfer the title deed to her name by \n31.08.2019;  CIVIL APPEAL NO. 10209 OF 2024 and connected case  Page 4 of 6 \n (ii) allow the appellant -wife and their son to continue    \nresiding in the said flat; and  \n(iii) continue to pay permanent alimony of Rs. 20,000/ - per \nmonth to the appellant -wife, subject to a 5% increase \nevery three years.  \nAdditionally, the High Court directed payment of \neducational expenses for the son’s university education and \nRs. 5,000/ - per month for private tuition. Aggrieved by the \nquantum of alimony awarded, the appellant -wife is before \nthis Court.  We have heard learned counsel for the parties.  \n3. This Court, vide order dated 20.02.2023, issued notice \nconfined to the question of enhancement of permanent \nalimony awarded to the appellant -wife. \n4. By interim order dated 07.11.2023, this Court, noting the \nabsence of representation on behalf of the respondent -\nhusband  despite proof of service, enhanced the monthly \nmaintenance to Rs. 75,000/ - with effect from 01.11.2023. \nThe respondent -husband subsequently entered \nappearance and filed an application seeking vacation of the \nsaid interim order.  \n5. The appellant -wife contends that the amount of Rs. \n20,000/ - per month, which the High Court made final, was \noriginally awarded as interim maintenance. She submits \nthat the respondent -husband has a monthly income of \napproximately Rs. 4,00,000/ - and the quan tum of alimony CIVIL APPEAL NO. 10209 OF 2024 and connected case  Page 5 of 6 \n awarded is not commensurate with the standard of living \nmaintained by the parties during the marriage.  \n6. In response, the respondent -husband submits that his \ncurrent net monthly income is Rs. 1,64,039/ -, earned from \nhis employment at the Institute of Hotel Management, \nTaratala, Kolkata. He has placed on record salary slips, \nbank statements, and income tax ret urns for the year \n2023 –2024. It is further stated that he was earlier employed \nwith the Taj Hotel, drawing a gross annual salary of Rs. \n21,92,525/ -. He also submits that his monthly household \nexpenses total Rs. 1,72,088/ -, and that he has remarried, \nhas a dependent family, and aged parents. The respondent -\nhusband contends that their son, now 26 years of age, is \nno longer financially dependent.  \n7. Having considered the submissions and materials on \nrecord, we are of the view that the quantum of permanent \nalimony fixed by the High Court requires revision. The \nrespondent -husband’s income, financial disclosures, and \npast earnings establish that he is in  a position to pay a \nhigher amount. The appellant -wife, who has remained \nunmarried and is living independently, is entitled to a level \nof maintenance that is reflective of the standard of living \nshe enjoyed during the marriage and which reasonably \nsecures her future. Furthermore, the inflationary cost of \nliving and her continued reliance on maintenance as the \nsole means of financial support necessitate a reassessment  \nof the amount.  CIVIL APPEAL NO. 10209 OF 2024 and connected case  Page 6 of 6 \n 8. In our considered opinion, a sum of Rs. 50,000/ - per month \nwould be just, fair and reasonable to ensure financial \nstability for the appellant -wife. This amount shall be \nsubject to an enhancement of 5% every two years. As \nregards the son, now aged 26, we ar e not inclined to direct \nany further mandatory financial support. However, it is \nopen to the respondent -husband to voluntarily assist him \nwith educational or other reasonable expenses. We clarify \nthat the son’s right to inheritance remains unaffected, and \nany claim to ancestral or other property may be pursued in \naccordance with law.  \n9. In view of the above, the appeal is allowed. The impugned \norder of the High Court is modified to the extent that the \npermanent alimony payable to the appellant -wife shall be \nRs. 50,000/ - per month, subject to a 5% increase every two \nyears, as noted above.  \n10. The contempt petition to be disposed of accordingly.  \n11. Pending application(s), if any, shall stand disposed of.  \n \n………………………………..J.  \n[VIKRAM NATH]  \n \n \n \n………………………………..J.  \n[SANDEEP MEHTA]  \n \nNEW DELHI;  \nMAY 29, 2025"
}