{
  "filename": "VAIBHAV_VS._THE_STATE_OF_MAHARASHTRA.pdf",
  "page_count": 25,
  "content": "2025 INSC 800\nCriminal  Appeal  No. 1643 of 2012                                                     Page 1 of 25 \n REPORTABLE  \n \nIN THE SUPREME COURT OF INDIA  \nCRIMINAL APPELLATE JURISDICTION  \n \nCRIMINAL  APPEAL  NO. 1643  OF 2012  \n \nV AIBHA V               …APPELLANT (S) \n \nVERSUS  \n \nTHE STATE OF MAHARASHTRA      …RESPONDENT (S) \n \nJ U D G M E N T \n \nSATISH  CHANDRA  SHARMA,  J. \n \n1. This is a tale of two friends,  Vaibhav  and Mangesh,  who \nwere  studying  at Bagla  Homeopathy  Medical  College,  Arvat  \nChandrapur,  Maharashtra.  They  were  students  of first year and \noften  used to commute  together  on their two-wheelers.  On the \nfateful  day of 16.09.2010,  both friends  left the college  together  \non the scooter  belonging  to Mangesh,  had tea at the tea stall of \nPW-3 and arrived  at Vaibhav’s  house  in the afternoon.  When  \nMangesh’s  father/PW -1 discovered  late in the evening  that his Criminal  Appeal  No. 1643 of 2012                                                     Page 2 of 25 \n son had not reached  home,  he tried to find out and eventually  \nlodged  a missing  report.  The next day, on 17.09.2010,  the dead \nbody  of Mangesh  was found  and accordingly,  the present  \ncriminal  case came  to be registered  against  unknown  persons.   \n2. Investigation  commenced  and a supplementary  statement  \nof PW-1 was recorded  wherein  he raised  suspicion  against  \nVaibhav,  Mangesh’s  friend,  classmate,  scooter  partner  and \nappellant  before  us in the present  appeal.  Upon  investigation,  the \npolice  prepared  the chargesheet  wherein  the appellant  was \nalleged  to have  caused  death  of deceased  Mangesh  by shooting  \nhim by the gun belonging  to the appellant’s  father/PW -12.  \n3. Upon  trial, the Trial  Court  found  that the appellant  had \nkilled  Mangesh  using  the service  gun belonging  to his father  \nwhen  he came  to drop him after college.  Thereafter,  the appellant  \ncalled  his friends  Vishal  and Akash  (juvenile  at the time of \nincident)  for helping  him in the disposal  of the dead  body.  The \nappellant  was found  guilty  for the commission  of the offences  \nunder  Sections  302, 201 read with Section  34 of Indian  Penal  \nCode,  1860  (hereinafter  referred  as “IPC”  for brevity)  and \nSection  5 read with 25(1)(a)  of Arms  Act, 1959 . His friend  Vishal  \nwas also found  guilty  for the commission  of the offence  under  \nSection  201 read with Section  34 of IPC. Both  the convicts  had \npreferred  separate  appeals  before  the Bombay  High  Court  and \nboth the appeals  came  to be disposed  of by the impugned  Criminal  Appeal  No. 1643 of 2012                                                     Page 3 of 25 \n judgment,  wherein  the conviction  of the appellant  was upheld  \nand Vishal  was acquitted  for want  of evidence.  The present  \nappeal  assails  the said impugned  judgment  dated  13.06.2012  \npassed  in Criminal  Appeal  No. 57/2012.  \nIMPUGNED  JUDGMENT  \n4. While  upholding  the conviction  of the appellant,  the High  \nCourt  appreciated  the testimonies  of the prosecution  witnesses  \nand acknowledged  that the case is based  on circumstantial  \nevidence  as no direct  evidence  of the alleged  act could  be found.  \nAfter  examining  the testimonies  of the prosecution  witnesses,  the \nHigh  Court  observed  that the material  against  the accused  could  \nbe summed  up as follows:  \n“17. The material evidence adduced by the \nprosecution an admitted by the defence which are \nnecessary for the decision of this appeal are \nenumerated thus: - \n(a) PW12 Khushal Tijare, father of the deceased, is \na Police Officer to whom the 9mm pistol was \nentrusted along with 30 rounds.  \n(b) The accused and the deceased were known to \neach other.  \n(c) On 16.9.2010, PW12 Khushalrao had kept the \npistol u nder the mattress in his bedroom.  \n(d) A1 and the deceased had been to the house of \nA1. On 16.9.2010 after 3 p.m. nobody was at home.  Criminal  Appeal  No. 1643 of 2012                                                     Page 4 of 25 \n (e) A1 called upon his father telephonically and \ndemanded the keys of the rear door which leads to \nthe abandoned quarter.  \n(f) PW12 informed A1 that the keys were behind the \nwall.  \n(g) On 16.9.2010, the deceased was lastly seen in \nthe company of the accused as admitted by him.  \n(h) On 16.9.2010 after 8 p.m., PW1 was searching \nfor his son and in the course of  searching visited the \nhouse of A1 to inquire about Mangesh and that A1 \ninformed PW1 that he had lastly seen Mangesh at 4 \np.m. \n(i) A1 visited the house of PW1 at 10 p.m. on \n16.9.2010 and inquired about Mangesh. He \nreturned home. His parents were at home. However, \nhe did not disclose anything.  \n(j) On 17.9.2010, A1 visited the house of PW1 i.e. \nfather of Mangesh at 9 a.m. Thereafter he revisited \nthe house of PW1 with four friends and assured \nPW1 that they would search for Mangesh and made \nPW1 believe that Mangesh was alive.  \n(k) After the dead body was noticed in the courtyard \nbehind the residential house of A1 and was being \nremoved from the spot, A1 accompanied the Police \nstill pretending ignorance about cause of death of \nMangesh.  \n(l) The admission of A1 that his acquaintance with \nthe deceased was just one month prior to the \nincident.  \n(m) The admission of A1 as a defence witness that \nwhen he went to change his clothes in his room, \nMangesh was sitting on the bed in the living room, \nA1 heard the noise of firearm and came in the living Criminal  Appeal  No. 1643 of 2012                                                     Page 5 of 25 \n room and found Mangesh lying on the ground with \nthe pistol in his hand and that pistol was of  his \nfather.  \n(n) The admission of defence witness A1 that as \nsoon as he saw Mangesh lying on the ground with \nthe pistol, his first reaction was that he took the \npistol and kept under the mattress of the bed i.e. the \nplace where it was left by his father. Yet he has \nstated that he had no knowledge as to where his \nfather had left the pistol. This contention cannot be \nbelieved.  \n(o) The admission of A1 that out of fear he removed \nthe dead body from the living room and took it to the \ncourtyard on the rear side of his house, that he \ncleaned the floor  due to fear.  \n(p) The admission of A1 that when he had gone to \nchange his clothes, Mangesh had not left the living \nroom. Therefore, Mangesh had no access to the bed \nroom and location of the  pistol from beneath the \nmattress within a span of few minutes.  \n(q) The fact that although there was memorandum \nof recovery of clothes and it was not followed by a \nseizure, coupled with the statement of A1 that he \nhad given it to the Police but they said that it was \nnot required. The act of the accused disposing the \ncartridge at a particular place, showing  the place \nto the Police, attempting to search the bullet at that \nplace and yet not finding it.  \n(r) The explanation of PW12 below Exh.83 which is \ndenied in the cross -examination of PW12.  \n(s) The sanction order issued by the District \nMagistrate for prosecuting the accused showing \nthat the weapon of assault was used in the offence.”  \n Criminal  Appeal  No. 1643 of 2012                                                     Page 6 of 25 \n 5. The High  Court  laid great  emphasis  on the fact that after \nthe death  of Mangesh,  the appellant  had tried to stifle  the \ninvestigation  by removing  evidence.  It observed  thus:   \n“20. The fact that the accused attempted to stifle the \ninvestigation is relevant under Section 8 of the \nIndian Evidence Act. The fact of fear as deposed by \nA1, accepted by the accused is relevant.”  \n \n6. On a careful  perusal  of the impugned  judgment,  it could  be \nseen that the High  Court  has heavily  relied  upon  Section  8 of the \nIndian  Evidence  Act, 1872  (hereinafter  referred  as “Evidence  \nAct” ) to draw  inferences  from  the subsequent  conduct  of the \nappellant,  especially  removal  of the dead  body,  concealment  of \nclothes,  visits  by the accused  to the residence  of PW-1 pretending  \nto enquire  about  the deceased  etc. As regards  the causal  link \nbetween  the appellant  and the alleged  act, the High  Court  \nobserved  that the link was established  as the 9 mm pistol  \nbelonging  to the father  of the appellant  had caused  the death  of \nthe appellant.  The following  para is indicative  of the same:  \n“23. …In the present case, the accused has himself \nadmitted the weapon to be the service pistol of his \nfather and that it was in the hand of deceased when \nhe first saw him. The prosecution has led cogent and \nconvincing evidence to prove that Mangesh had \nsustained the bullet injury with the same 9mm \npistol. There is no ambiguity of the identity or \ndescription of weapon. The link evidence between \nthe crime and the accused is established beyond Criminal  Appeal  No. 1643 of 2012                                                     Page 7 of 25 \n reasonable doubt and by the admission of the \naccused himself and his father.”  \n \n7. The appellant  had taken  two primary  defenses  before  the \nHigh  Court  – impossibility  of homicidal  death  in light of the \ntrajectory  of the bullet  and report  of PW-9 which  pointed  towards  \naccidental  death.  Both  the contentions  were  turned  down  in the \nimpugned  judgment  assigning  different  reasons.  While  rejecting  \nthe former  contention,  the High  Court  again  adverted  to the \nsubsequent  conduct  of the appellant  and observed  thus:  \n“22. The learned counsel for the accused also \npleaded that it appears from the evidence that the \nbullet was fired from a close range of 15cm would \nshow that it is accidental.  He has argued that there \nwas no blackening around the eye. The direction in \nwhich  the bullet had travelled through the eye to the \noccipital region would show that it is a case of \naccidental firing. The counsel has further argued \nthat falsity of defence or giving a false explanation \ndoes not provide an additional link and cannot be \nmade a ground for conviction. In the present case, \nit is not the falsity of defence which is being \nconsidered and, therefore, we have referred to \nSection 8 of the Indian Evidence Act. The accused \nhad prepared a good ground and given false \nexplanation or rathe r made up a new story at the \nthreshold i.e. even prior to investigation, at the time \nof investigation and, therefore, his conduct \nindicates the act of guilty mind.”  \n Criminal  Appeal  No. 1643 of 2012                                                     Page 8 of 25 \n 8. On the second  aspect,  the High  Court  observed  that it was \nnot obligatory  for PW-9 to have  given  her opinion  regarding  the \ncause  of death,  as the cause  of death  was well known  and was \n“admitted  by the accused  on oath”. The relevant  part of the \nimpugned  judgment  reads  thus:  \n“28. The learned counsel has heavily relied upon \nthe deposition of PW9 wherein it is stated that she \ncannot say as to whether the death is accidental or \nhomicidal. We have already discussed that it is not \nobligatory on the part of the Doctor to give the \ncause of death when the cause is known and is \nestablished by the cogent and convincing evidence \nand moreover admitted by the accused on oath.”  \n \nTHE  CHALLENGE  \n9. Taking  exception  to the impugned  judgment,  Ld. Counsel  \non behalf  of the appellant  submits  that the High  Court  did not \nexamine  the grounds  taken  by the appellant.  It is submitted  that \nas per the evidence  of PW-9, the trajectory  of the bullet  was such \nthat it had exited  from  the downward  portion  of the skull  of the \ndeceased  and then hit the ventilator  above  the door.  It is \nsubmitted  that such a trajectory  was only possible  in case of a \nsuicidal  death  and not homicidal.  It is further  submitted  that the \ncourts  below  have  erred  in not appreciating  the testimony  of    \nPW-9, who had clearly  deposed  that she could  not ascertain  the Criminal  Appeal  No. 1643 of 2012                                                     Page 9 of 25 \n cause  of death  and could  not tell with certainty  whether  the death  \nwas suicidal  or homicidal.    \n10. Relying  upon  medical  jurisprudence,  it is further  \nsubmitted  that in cases  of accidental  injuries  by fire arm, bullet  is \nhit from  a close  distance.  Further,  in such cases,  the injury  is often  \nsingular.  It is submitted  that in the present  case,  both the elements  \nof accidental  death  are present  and the Courts  below  erred  in not \nappreciating  so.  \n11. As regards  the conduct  of the appellant  after the incident,  \nit is submitted  that the appellant  has categorically  deposed  that \nthe death  of Mangesh  was caused  by his father’s  pistol  at his \nresidence.  He has also deposed  that as he heard  the gunshot,  he \ncame  out and saw the dead  body  of Mangesh  lying  in pool of \nblood.  He got scared  of his father  and tried to clean  up the scene  \nand in doing  so, he removed  the dead  body  of the deceased  and \ncleaned  the blood  by using  phenyl.  It is further  submitted  that \nthere  was no motive  for the appellant  to have  caused  the death  of \nMangesh  and the relationship  between  the appellant  and the \ndeceased  was friendly.  To buttress  this submission,  it is \nsubmitted  that in a case based  on circumstantial  evidence,  \nabsence  of motive  is a crucial  fact which  renders  the prosecution  \ncase doubtful.   \n12. It is further  submitted  that the Courts  below  had placed  \nundue  burden  upon  the appellant  to offer  explanation  for certain  Criminal  Appeal  No. 1643 of 2012                                                     Page 10 of 25 \n circumstances  and his subsequent  conduct.  It is contended  that it \nwas for the prosecution  to prove  its case beyond  reasonable  doubt  \nand mere  inability  of the appellant  to explain  certain  aspects  \ncould  not be read against  him to arrive  at a finding  of guilt.  \nLastly,  it is submitted  that in a case based  on circumstantial  \nevidence,  if two views  are possible,  the Court  must  lean in favour  \nof the view  favourable  to the accused.   \nDISCUSSION  \n13. We have  carefully  considered  the grounds  of appeal,  \nrespective  submissions  advanced  at Bar and have  heard  both \nsides  at length.  We may now consider  the principal  issue  whether  \nthe finding  of the High  Court  regarding  the conviction  of the \nappellant  is sustainable  in light of the evidence  on record.   \n14. In the factual  matrix  of the present  case,  it could  be \nobserved  at the outset  that certain  facts  stand  duly admitted.  We \nmay first consider  such facts.  The cause  of death  of the deceased  \nis undisputed,  as it is admitted  that the deceased  was shot by the \nservice  pistol  belonging  to PW-12, the father  of the appellant.  \nAlthough,  the investigating  officer  did not obtain  any ballistic  \nreport  to ascertain  the nexus  between  the bullet  injury  and the \nservice  pistol  of PW-12, however,  it could  be seen from  the \nrecord  that the nexus  has not been  questioned  by the defence.  In \nfact, both the appellant  and PW-12 have  admitted  that the bullet  Criminal  Appeal  No. 1643 of 2012                                                     Page 11 of 25 \n was shot from  the pistol  of PW-12 which  was lying  in the house.  \nFurthermore,  PW-11 has also confirmed  that when  the service  \npistol  was re-deposited  by PW-12, one bullet  was missing  from  \nthe sanctioned  number  of bullets.   \n15. Going  further,  it is also admitted  that the appellant  had \nindeed  removed  the dead  body  of the deceased  and had cleaned  \nup the scene  of crime.  It is also a matter  of record  that the \ndiscoveries  made  under  Section  27 of Evidence  Act were  not \nchallenged  by the appellant  as the appellant  had admitted  that \nvarious  articles  belonging  to himself  and the deceased,  and \nconnected  with the alleged  incident,  were  discovered  in \nfurtherance  of his disclosures.  All these  aspects,  however,  \nassume  greater  relevance  for the offence  under  Section  201 IPC. \nInsofar  as the offences  under  Section  302 IPC and Section  25 of \nArms  Act are concerned,  the prosecution  case leaves  us wanting  \nfor answers.  No doubt,  the deceased  was shot by the pistol  \nbelonging  to the father  of the appellant  and in the house  of the \nappellant,  but the pertinent  question  that craves  for an answer  is \n– who pulled  the trigger?  Despite  two rounds  of litigation,  the \nquestion  is yet to find an answer.  \n16. In a case based  on circumstantial  evidence,  answers  to \nsuch questions  are not found  on the face of the record.  Rather,  \nthe truth  is found  concealed  in the layers  of incriminating  and \nexonerating  facts,  and the Court  is required  to arrive  at a judicial  Criminal  Appeal  No. 1643 of 2012                                                     Page 12 of 25 \n finding  on the basis  of the best possible  inference  which  could  be \ndrawn  from  a comprehensive  analysis  of the chain  of \ncircumstances  in a case.  As per the record  and the analysis  carried  \nout by the Courts  below,  the circumstances  weighing  against  the \naccused  could  briefly  be summarized  as: \ni. The presence  of deceased  at the house  of the appellant  \nprior  to and at the time of incident;  \nii. Admitted  removal  of dead  body  of the deceased  by the \nappellant;  \niii. Admitted  removal,  concealment  and subsequent  \ndiscovery  of various  articles  as per the disclosure  made  \nby the appellant;  \niv. Fatal  gunshot  by the pistol  lying  in the house  of the \nappellant;  \nv. Subsequent  conduct  of the appellant  in trying  to show  \nconcern  to the father  of the deceased  despite  knowing  \nabout  the death;  \nvi. Failure  of the appellant  to explain  certain  \ncircumstances  such as the manner  in which  the pistol  \nfell in the hands  of the deceased,  how was it re-\nconcealed  etc.   \n17. Having  observed  the incriminating  circumstances,  we may \nnow advert  to the circumstances  which  leave  missing  links  in the Criminal  Appeal  No. 1643 of 2012                                                     Page 13 of 25 \n chain  of the prosecution.  Such  instances  include  the doubt  \nexpressed  by PW-9 regarding  the nature  of death,  trajectory  of \nbullet,  possibility  of accidental  injury  etc. The case of the \nappellant  is that a proper  appreciation  of the exonerating  \ncircumstances  would  make  the version  of the prosecution  highly  \nimprobable  and doubtful.  We may now examine  the same  by first \nconsidering  the version  of PW-9. Notably,  PW-9 has deposed  \nregarding  the trajectory  of the bullet  as it entered  and exited  the \nskull  of the deceased.  PW-9 had also annexed  a diagram  of the \ntrajectory,  which  revealed  that the bullet  entered  through  the eye \nof the deceased  and exited  from  the lower  part of the skull  from  \nthe back.  It would  have  been  possible  to reconcile  this trajectory  \nwith the version  of homicidal  death.  However,  questions  arise \nwhen  the journey  of the bullet  is analyzed  after it exited  from  the \nlower  part of the skull.  For, after taking  an exit from  the lower  \nskull,  the bullet  hit against  a ventilator  which  was installed  above  \nthe door of the living  room.  Admittedly,  the ventilator  was \ninstalled  at a height  significantly  higher  than the height  of the \ndeceased,  thereby  meaning  that the bullet  travelled  upwards  after \nit left the skull  of the deceased.  The version  of the prosecution  is \nsimply  that the appellant  shot the deceased  in the eye and there  \nhas been  no effort  to prove  the directions  of entry  or exit or to \nexplain  the inward  or outward  journey  of the bullet.  The \nprosecution  version  remains  acceptable  only till the point  of entry  Criminal  Appeal  No. 1643 of 2012                                                     Page 14 of 25 \n of the bullet  through  the eye, but it starts  becoming  cloudy  when  \nthe upward  trajectory  of the bullet  is analyzed  further,  as \ndiscussed  above.   \n18. In usual  course  of things,  such trajectory  of the bullet  could  \nhave  been  possible  only if the deceased  was sitting  and looking  \ndownwards  towards  the barrel  of the pistol  from  a close  distance.  \nIt was only then that the bullet  could  have  hit the ventilator  \ndespite  exiting  from  the lower  part of the skull.  In fact, this is \nprecisely  the defence  of the appellant  - that the deceased,  on \nfinding  the service  pistol  of PW-12, got curious,  picked  it up, \nstarted  looking  into it with one eye from  a close  distance  and \naccidentally  pressed  the trigger.  The probability  of the version  \nput across  by the appellant  is on the higher  side as compared  to \nthe version  put across  by the prosecution,  which  simply  does not \ngive any explanation  for the trajectory  of the bullet.   \n19. In gunshot  cases  wherein  the nature  of death  – suicidal,  \naccidental  or homicidal  – is not ascertainable  from  direct  \nevidence,  multiple  factors  are taken  into account  for arriving  at a \nconclusion.  Such  factors  include,  but are not limited  to, the point  \nof entrance,  the size of wound,  direction  of wound,  position  of \nwound,  possible  distance  of gunshot,  number  of wounds,  position  \nof weapon,  trajectory  of bullet  after entering  into the human  \nbody,  position  of exit wound  (if bullet  has exited),  direction  of \nexit wound,  direction  of the bullet  after exit, distance  travelled  by Criminal  Appeal  No. 1643 of 2012                                                     Page 15 of 25 \n the bullet  after exit, nature  of final impact  on surface  (if any) etc. \nAll such factors,  to the extent  of their applicability  to the facts  of \nthe case,  need  to be examined  by the Court  before  arriving  at a \njudicial  finding  of fact. Undoubtedly,  no such analysis  could  be \nfound  in the impugned  judgment.  The High  Court  merely  \nbrushed  aside  the defence  of the appellant  by referring  to the \nsubsequent  conduct  of the appellant  and by raising  adverse  \ninference  on that basis.    \n20. Similarly,  the inconclusive  opinion  of PW-9 regarding  the \ndeath  being  homicidal  or suicidal/accidental  was also a relevant  \nfact. No doubt,  PW-9 was not bound  to give a conclusive  opinion  \nas observed  by the High  Court,  however,  it ought  to have  been \nexamined  whether  the failure  to do so had a bearing  on the \njudicial  determination  of the real cause  of death.  The nature  of \ndeath  ought  to have  been  examined  in light of the surrounding  \ncircumstances  discussed  above,  which  weigh  against  the \npossibility  of a homicidal  death.  The appellant  has also placed  \nreliance  on medical  jurisprudence  regarding  the nature  of injuries  \nin accidental  or suicidal  gunshot  cases.  More  often  than not, in \naccidental  gunshot  cases,  the injury  is found  to be singular  and \ninflicted  from  a close  range.  The present  case ticks  the boxes  of \nan accidental  gunshot  injury,  both in theory  and in fact. \nContrarily,  the aforesaid  discussion  indicates  that the possibility  \nof a homicidal  death  is very weak  in the present  case.  It must  also Criminal  Appeal  No. 1643 of 2012                                                     Page 16 of 25 \n be kept in mind  that the imprints  on the pistol  have  not been \nmatched  with the appellant  and therefore,  no direct  nexus  exists  \nto conclude  that the trigger  was pulled  by the appellant.  On this \naspect  as well,  we may note with dismay  that the High  Court  \nrejected  the defence  of the appellant  by simply  observing  that the \nhomicidal  death  of the deceased  was ‘admitted’  by the appellant  \non oath.  There  is no such admission  qua the nature  of death.  \nContrarily,  the appellant  had deposed  on oath that the death  was \n‘accidental’,  a version  that he has carried  consistently  up to this \nCourt.  \n21. Having  said so, we may now examine  what  weighed  with \nthe High  Court  to arrive  at the finding  of guilt of the appellant.  \nOn a careful  reading  of the impugned  judgment,  one would  \nunmistakably  note that the subsequent  conduct  of the appellant  \nin indulging  in destruction  of evidence  weighed  heavily  against  \nhim in the mind  of the Court.  The inability  of the appellant  to \nexplain  certain  aspects  also weighed  against  him. Undoubtedly,  \nin a case based  on circumstantial  evidence,  facts  indicating  \nsubsequent  conduct  are relevant  facts  under  Section  8 of the \nEvidence  Act. Equally,  the inconsistencies  in the version  of the \nappellant  are also relevant.  However,  the occasion  to examine  the \nversion/defence  of the appellant  could  have  arisen  only if the \nprosecution  had succeeded  in discharging  its primary  burden  \nbeyond  reasonable  doubt.  In criminal  jurisprudence,  it is a time-Criminal  Appeal  No. 1643 of 2012                                                     Page 17 of 25 \n tested  proposition  that the primary  burden  falls upon  the \nshoulders  of the prosecution  and it is only if the prosecution  \nsucceeds  in discharging  its burden  beyond  reasonable  doubt  that \nthe burden  shifts  upon  the accused  to explain  the evidence  against  \nhim or to present  a defence.  In the present  case,  the version  of the \nprosecution  suffers  from  inherent  inconsistencies  and doubts,  as \ndiscussed  above,  and in such a scenario,  the inability  of the \nappellant  to explain  certain  circumstances  could  not be made  the \nbasis  to relieve  the prosecution  from  discharging  its primary  \nburden.  The High  Court  fell in a grave  error  in doing  so, as it \nplaced  greater  reliance  on the loopholes  in the appellant’s  version  \nwithout  first determining  whether  the chain  of circumstances  \nsought  to be proved  by the prosecution  was complete  or not. \nPertinently,  the inability  of an accused  to offer  plausible  \nexplanation  on certain  aspects  would  not automatically  absolve  \nthe prosecution  of its evidentiary  burden,  which  must  be \ndischarged  first and beyond  doubt.   \n22. In law, there  is a significant  difference  in the evidentiary  \nburden  to be discharged  by the prosecution  and the accused.  \nWhereas,  the former  is expected  to discharge  its burden  beyond  \nreasonable  doubt,  the latter  is only required  to prove  a defence  on \nthe anvil  of preponderance  of probabilities.  If the accused  leads  \ndefence  evidence  in the course  of a criminal  trial, the same  ought  \nto be tested  as probable  or improbable  in the facts  and Criminal  Appeal  No. 1643 of 2012                                                     Page 18 of 25 \n circumstances  of the case.  The present  case,  we are afraid,  reveals  \nthat the defence  taken  by the accused  since  the beginning  of the \ncase was not tested  by the Trial  Court  and the High  Court.  \nDespite  a specific  defence  taken  by the appellant  before  both the \nCourts,  the Courts  simply  did not examine  the same  in the \nmanner  required  by law. The probability  of the version  put across  \nby the appellant  ought  to have  been  tested  against  the \ncircumstantial  theory  of the prosecution.  In other  words,  it was \nincumbent  upon  the Courts  below  to have  examined  whether  the \ndefence  taken  by the appellant  was a probable  defence  or not. \nThe failure  to do so has certainly  resulted  into a failure  of justice  \nand it is sufficient  to reopen  the evidence  in the instant  appeal,  as \nwe have  done.   \n23. We may now come  to the next aspect  of the case i.e. \nabsence  of motive  and consequence  thereof.  It is trite law that in \na case based  on circumstantial  evidence,  motive  is relevant.  \nHowever,  it is not conclusive  of the matter.  There  is no rule of \nlaw that the absence  of motive  would  ipso facto  dismember  the \nchain  of evidence  and would  lead to automatic  acquittal  of the \naccused.  It is so because  the weight  of other  evidence  needs  to be \nseen and if the remaining  evidence  is sufficient  to prove  guilt,  \nmotive  may not hold relevance.  But a complete  absence  of \nmotive  is certainly  a circumstance  which  may weigh  in favour  of \nthe accused.  During  appreciation  of evidence  wherein  favourable  Criminal  Appeal  No. 1643 of 2012                                                     Page 19 of 25 \n and unfavourable  circumstances  are sifted  and weighed  against  \neach other,  this circumstance  ought  to be incorporated  as one \nleaning  in favour  of the accused.  In Anwar  Ali & Anr. v. State  of \nHimachal  Pradesh1, this Court  analyzed  the position  of law thus:   \n“24. Now so far as the submission on behalf of the \naccused that in the present case the prosecution has \nfailed to establish and prove the motive and \ntherefore the accused deserves acquittal is \nconcerned, it is true that the absence of proving the \nmotive ca nnot be a ground to reject the prosection \ncase. It is also true and as held by this Court Suresh \nChandra Bahri v. State of Bihar2 that if motive is \nproved that would supply a link in the chain of \ncircumstantial evidence but the absence thereof \ncannot be a ground to reject the prosecution case. \nHowever, at the same time, as observed by this \nCourt in Babu3, absence of motive in a case \ndepending on circumstantial evidence is a factor \nthat weighs in favour of the accused. In paras 25 \nand 26, it is observed and held as under:  \n“25. In State of U.P . v. Kishanpal4, this Court \nexamined the importance of motive in cases of \ncircumstantial evidence and observed : (SCC pp. \n87-88, paras 38 -39) \n‘38. ... the motive is a thing which is primarily \nknown to the accused themselves and it is not \npossible for the prosecution to explain what \nactually promoted or ex - cited them to \ncommit the particular crime.  \n \n1 (2020)  10 SCC  166 \n2 1995  Supp  (1) SCC  80 \n3 Babu  v. State  of Kerala , (2010)  9 SCC  189 \n4 (2008)  16 SCC  73 Criminal  Appeal  No. 1643 of 2012                                                     Page 20 of 25 \n 39. The motive may be considered as a \ncircumstance which is relevant for assessing \nthe evidence but if the evidence is clear and \nunambiguous and the circum - stances prove \nthe guilt of the accused, the same is not \nweakened even if the motive is not a very \nstrong one. It is also settled law that the \nmotive loses all its importance in a case \nwhere direct evidence of eyewitnesses is \navailable, because even if there may be a very \nstrong motive for the accused persons to \ncommit a particular crime, they cannot be \nconvicted if the evidence of eye - witnesses is \nnot convincing. In the same way, even if there \nmay not be an apparent motive but if the \nevidence of the eyewitnesses is clear and \nreliable, the absence or inadequacy of motive \ncannot stand in the way of convic tion.’  \n26. This Court has also held that the absence of \nmotive in a case depending on circumstantial \nevidence is a factor that weighs in favour of the \naccused. (Vide Pannayar v. State of T.N.5)” \n \n24. In the subsequent decision in Shivaji Chintappa Patil v. \nState of Maha rashtra6, this Court relied upon the decision in \nAnwar Ali and observed as under: - \n \n“27. Though in a case of direct evidence, motive \nwould not be relevant, in a case of circumstantial \nevidence, motive plays an important link to \n \n5 (2009)  9 SCC  152 \n6 (2021)  5 SCC  626 Criminal  Appeal  No. 1643 of 2012                                                     Page 21 of 25 \n complete the chain of circumstances. The \nmotive... ...”  \n \nMore  recently,  in Nandu  Singh  v. State  of Madhya  Pradesh  \n(now  Chhattisgarh )7, the position  was reiterated  by this Court  in \nthe following  words:   \n“10. In a case based on substantial evidence, \nmotive assumes great significance. It is not as if \nmotive alone becomes the crucial link in the case to \nbe established by the prosecution and in its absence \nthe case of Prosecution must be discarded. But, at \nthe same time, complete absence of motive assumes \na different complexion and such absence definitely \nweighs in favour of the accused.”  \n \n25. Thus,  a complete  absence  of motive , although  not \nconclusive,  is a relevant  factor  which  weighs  in favour  of the \naccused.  No doubt,  the final effect  of such absence  on the \noutcome  of the case shall  depend  upon  the quality  and weight  of \nsurrounding  evidence.  In the present  case,  the testimonies  of \nprosecution  witnesses  have  invariably  revealed  that the appellant  \nand the deceased  were  friends  and there  was no ill-will between  \nthem.  Even  the father  of the deceased  has testified  to that effect.  \nThe relevance  of motive  in a case of homicide  has been  a subject  \nof prolonged  discussion.  Ordinarily,  in cases  involving  direct  \nevidence  of the commission  of crime,  motive  has little role to \n \n7 Criminal  Appeal  No. 285 of 2022  Criminal  Appeal  No. 1643 of 2012                                                     Page 22 of 25 \n play as presence  or absence  of motive  is immaterial  if the \ncommission  of the crime  stands  proved  through  other  evidence.  \nEven  otherwise,  motiveless  crimes  are not unknown  to the \nsociety.  However,  in cases  purely  based  on circumstantial  \nevidence,  the absence  of motive  could  raise  serious  questions  and \nmight  even  render  the chain  of evidence  as doubtful.  It is so \nbecause  the presence  of motive  does the job of explaining  the \ncircumstantial  evidence.  For instance,  in the facts  of the present  \ncase,  any evidence  of enmity  between  the appellant  and the \ndeceased  would  have  made  suspicious  the act of the appellant  of \ntaking  the deceased  to his home  prior  to his death.  However,  \nsince  the evidence  suggests  that they were  friends,  the fact that \nthe appellant  brought  him home  could  not be termed  as per-se \nincriminating.  Therefore,  motive  explains  the circumstances  on \nrecord  and enables  the Court  to draw  better  inference  in a case \nbased  on circumstantial  evidence.   \n26. As regards  the subsequent  conduct  of the appellant,  before  \nparting,  we may also note that the same  was consistent  with the \ntheory  of accidental  death.  That his act of removal  of the dead \nbody  and concealment  of articles  was a result  of fear of his father  \n- is quite  natural.  A young  boy studying  in first year of college,  \nwith no criminal  background  and with no motive  in sight,  would  \ncertainly  have  become  scared  on seeing  that his friend  has \naccidentally  shot himself  in the living  room  of his house  with the Criminal  Appeal  No. 1643 of 2012                                                     Page 23 of 25 \n pistol  belonging  to his father  and is lying  in a pool of blood.  The \nsubsequent  conduct  of cleaning  up the scene  and restoring  the \nliving  room  in its original  shape,  although  punishable  in law, \ndoes not become  so unnatural  that it could  be made  the basis  to \nconvict  him for the commission  of murder  without  additional  \nevidence  to that effect.  More  so, when  such conclusion  is not \nconsistent  with the surrounding  evidence  on record,  especially  \nmedical  evidence,  as discussed  above.  \n27. No doubt,  the subsequent  acts of cleaning  up the crime  \nscene  and making  false  enquiries  amount  to disappearance  of \nevidence  and raise  grave  suspicion  against  the appellant . \nHowever , mere  suspicion,  no matter  how grave,  cannot  take the \nplace  of proof  in a criminal  trial. The suspicion  ought  to have  \nbeen  substantiated  by undeniable,  reliable,  unequivocal,  \nconsistent  and credible  circumstantial  evidence,  which  does not \nleave  the probability  of any other  theory.  In the present  case,  the \ntheory  put across  by the appellant  is fairly  probable  and is \nsupported  by medical  evidence  including  the examination  of the \nbullet  injury  and trajectory.  Contrarily,  the conclusion  drawn  by \nthe Courts  below  is not supported  by medical  evidence  and is not \nconsistent  with the bullet  injury  and trajectory,  as discussed  \nabove.  We have  come  far since  our acknowledgement  that in a \ncase purely  based  on circumstantial  evidence,  it must  be \nestablished  that the chain  of circumstances  is complete.  Such  Criminal  Appeal  No. 1643 of 2012                                                     Page 24 of 25 \n chain  must  be consistent  with the conclusion  of guilt only and \nmust  not support  a contrary  finding.  The rigid  principles  \nunderlying  an examination  based  on circumstantial  evidence  are \nbased  on the premise  that the very act of arriving  at a finding  of \nguilt on the basis  of inferences  must  be performed  with great  \ncaution  and margin  of error  must  be kept at a minimum.  Having  \nsaid so, we may also observe  that naturally,  there  could  be some  \ninconsistencies  in the chain  of circumstances  in the natural  \ncourse  of things  and mere  presence  of inconsistencies  does not \nautomatically  demolish  the case of the prosecution.  However,  the \nprosecution  must  be able to explain  the inconsistencies  to the \nsatisfaction  of the Court.  For, the ultimate  test is the judicial  \nsatisfaction  of the Court.  In the present  case,  the counter  \nprobabilities  and inconsistencies  in the chain  of circumstances  \nhave  not been  explained.  \n28. Momentarily,  even  if it is believed  that the view  taken  by \nthe Courts  below  is a possible  view,  it ought  to have  been \nexamined  whether  a reasonable  counter  view  was possible  in the \ncase.  It is a time-tested  proposition  of law that when  a Court  is \nfaced  with a situation  wherein  two different  views  appear  to be \nreasonably  possible,  the matter  is to be decided  in favour  of the \naccused.  The benefit  of a counter  possibility  goes to the accused  \nin such cases.  Criminal  Appeal  No. 1643 of 2012                                                     Page 25 of 25 \n 29. In light of the foregoing  discussion,  we hereby  conclude  \nthat the High  Court  has erred  in arriving  at the finding  of guilt \nand in upholding  the verdict  of the Trial  Court.  The \ncircumstantial  evidence  on record  is not consistent  and leaves  a \nreasonable  possibility  of an alternate  outcome  i.e. of innocence  \nof the appellant  on the charges  of murder  and illegal  usage  of fire \narm. Accordingly,  the impugned  order  and judgment  are partially  \nset aside  to the extent  of conviction  of the appellant  for the \noffences  punishable  under  Sections  302 IPC and Section  5 read \nwith 25(1)(a)  of Arms  Act. Consequently,  the appellant  is \nacquitted  for the offences  under  Section  302 of IPC and Section  \n5 read with 25(1)(a)  of Arms  Act. His conviction  under  Section  \n201 IPC is sustained  and he is sentenced  for the period  already  \nundergone  by him, for reasons  discussed  above.   \n30. The captioned  appeal  stands  disposed  of in the aforesaid  \nterms.  Interim  application(s),  if any, shall  also stand  disposed  of.  \n \n \n \n……………………………………J.  \n                   [B.V.  NAGARATHNA]  \n \n \n \n……………………………………J.  \n                                             [SATISH  CHANDRA  SHARMA]  \nNEW  DELHI  \nJune 04, 2025"
}