{
  "filename": "BOYAPATI_SRINIVASA_APPA_RAO_VS._V_KAMESWARA_RAO.pdf",
  "page_count": 4,
  "content": "IN THE SUPREME COURT OF INDIA\nCIVIL APPELLATE JURISDICTION\nCIVIL APPEAL NOS.   2665-2666/2016  \nBOYAPATI SRINIVASA APPA RAO & ANR.  APPELLANT(S)\n    VERSUS\nV KAMESWARA RAO & ORS. RESPONDENT(S)\nO R D E R\n Application for d ischarge of Advocate-on-Record is allowed. \nThese appeals arise out of the order passed by the High Court\nof Judicature at Hyderabad in Writ Petition No. 28057/2012 and Writ\nPetition (SR) No. 138912/2014. \nRespondents, namely, V Kameswara Rao and G. Prajapathi Rao,\nwho were the writ petitioners before the High Court in the\naforestated two writ petitions have filed affidavit(s) before this\nCourt praying that they may be permitted to withdraw the writ\npetitions itself. \nRespondent No. 3, Sri Durga Malleswara Educational Society,\nhad also preferred Writ Petition No. 27867/2011 for the similar\nrelief(s) before the High Court.  When the writ petition was\ndismissed by the High Court, respondent No. 3, Sri Durga Malleswara\nEducational Society, preferred a special leave petition, that is,\nSLP (C) No. 7825/2012, which came up for hearing on 19.03.2012.  On\nthe said date, respondent No. 3, Sri Durga Malleswara Educational\n1Society, prayed for permission to withdraw Writ Petition No.\n27867/2011.  The prayer was found unusual, but this Court accepted\nthe request and permitted respondent No. 3, Sri Durga Malleswara\nEducational Society, to withdraw Writ Petition No. 27867/2011 with\nliberty to avail other appropriate remedies.\n Mr. Jayanth Muth Raj, learned senior counsel appearing for\nrespondent No. 3, Sri Durga Malleswara Educational Society, would\nobject to the prayer made by respondents, namely, V Kameswara Rao\nand G. Prajapathi Rao,  seeking permission to withdraw the writ\npetitions  itself.   However,  as  the  similar  prayer  made  by\nrespondent No. 3, Sri Durga Malleswara Educational Society, was\nallowed by this Court, it does not behove respondent No. 3, Sri\nDurga Malleswara Educational Society, to object such a prayer.\nAccordingly, we permit the respondents, namely, V Kameswara Rao and\nG. Prajapathi Rao, to withdraw their respective writ petitions,\nthat is,  Writ Petition No. 28057/2012 and Writ Petition (SR) No.\n138912/2014. \nAccordingly, the aforesaid writ petitions are dismissed as\nwithdrawn and consequently, the present appeals are dismissed as\ninfructuous. \nAs stated above, Mr. Jayanth Muth Raj, learned senior counsel\nappearing for respondent No. 3, Sri Durga Malleswara Educational\nSociety, while objecting to the withdrawal of the writ petitions\nhas prayed for liberty to revive the civil proceedings, which were\npending in the form of Appeal Suit No. 118/2012.  The said\nproceedings were disposed of in view of the fact that the award\nitself was set aside in the two writ petitions, which now have been\n2permitted to be withdrawn. \nAccordingly, liberty is reserved in favour of respondent No.\n3,  Sri Durga Malleswara Educational Society, to revive Appeal Suit\nNo. 118/2012, if it so desires.  It goes without saying that the\nappeal suit shall be decided on its own merits. \nPending application(s), if any, shall stand disposed of. \n......................J.\n(PRASHANT KUMAR MISHRA )\n......................J.\n(AUGUSTINE GEORGE MASIH )\nNEW DELHI\nJUNE 03, 2025.\n3ITEM NO.33               COURT NO.5               SECTION XII-A\n               S U P R E M E  C O U R T  O F  I N D I A\n                       RECORD OF PROCEEDINGS\nCivil Appeal Nos. 2665-2666/2016\nBOYAPATI SRINIVASA APPA RAO & ANR.                 Appellant(s)\n                                VERSUS\nV KAMESWARA RAO & ORS.                             Respondent(s)\nIA  No.  139219/2025  -  DISCHARGE  OF  ADVOCATE  ON  RECORD,  IA  No.\n159513/2019 - PERMISSION TO FILE ADDITIONAL DOCUMENTS/FACTS/ANNEXURES\n \nDate : 03-06-2025 These matters were called on for hearing today.\nCORAM : HON'BLE MR. JUSTICE PRASHANT KUMAR MISHRA\n         HON'BLE MR. JUSTICE AUGUSTINE GEORGE MASIH\n(PARTIAL COURT WORKING DAYS BENCH) \nFor Appellant(s) Mr. Dama Sheshadri Naidu, Sr. Adv.\n                   Mr. Pawanshree Agrawal, AOR\n                   Ms. Aakriti Goel, Adv.\n                                      \nFor Respondent(s) Mr. Ravi Shankar Jandhyala, Sr. Adv.\n                   Mr. Kaushik Choudhury, AOR\n                   Mr. Saksham Garg, Adv.\n                                      \n                   Mr. C. K. Sasi, AOR\n                   Ms. Meena K Poulose, Adv.\n                                      \n                   Mr. Jayanth Muth Raj, Sr. Adv.\n                   Mr. Sureshan P., AOR\n                   Mrs. Malavika Jayanth, Adv.\n                   Ms. Isha Singh, Adv.\n                                      \n                   Mr. P B Suresh, Sr. Adv.\n                   Mr. Aneesh Mittal, AOR\n                   Ms. Komal Mittal, Adv.                           \n          UPON hearing the counsel, the Court made the following\n                             O R D E R\nApplication for discharge of Advocate-on-Record is allowed. \nThe appeals are dismissed as infructuous in terms of the signed\norder. \nPending application(s), if any, shall stand disposed of. \n(BABITA PANDEY)                         (AKSHAY KUMAR BHORIA)\n  ASTT. REGISTRAR-cum-PS                       COURT MASTER (NSH)\n(Signed order is placed on the file)\n4"
}